[
    {
        "postid": "5909453046",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#10004;Looking for someone working in Telco (Singtel , Starhub , M1) \n&#10004;Looking for someone working in money lender (Singapore) \n&#10004;Looking for leads / Data \n&#10004;Looking for debt collector \nGreat opportunity!!! Good Earning !!!  \nCall or sms me for more info 84054862 / Whatsapp  83512053 \nGT Agency Pte Ltd  \n(Marketing Director) \nJoe Tan     ",
        "title": "Job Offered"
    },
    {
        "postid": "5918663991",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMaison Ikkoku looking for full time positions of:- \n \n1. Accountant \n2. Cost Controller  \n \nplease email detail CV with recent photo to \n  show contact info \n ",
        "title": "Accountant &amp; Cost Controller"
    },
    {
        "postid": "5951384610",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities: \n \n• Secure appointments/meetings through inbound and outbound calls to acquire new prospects \n \n• Close sales through inbound and outbound calls to acquire new sales \n \n• Close sales through inbound and outbound calls to upsell and cross-sell existing customers \n \n• Keep close track of leads and conduct follow ups with customers for closure of sales \n \n• Report to the Sales &amp; Business Development Manager \n \n \n \nJob Description \n \n• Ability to speak in Chinese \n \n• Deliver prepared sales talks, reading from scripts that describe products or services, or improvise, in order to persuade potential customers to take a desired action eg. agree to an appointment for presentation or purchase a product or service. \n \n• Schedule appointments for sales representatives to meet prospective customers or for customers to attend sales presentations or workshops. \n \n• Explain products or services and prices, and answer questions from potential customers. \n \n• Obtain potential customer information such as name, address, email, and contact numbers. \n \n• Obtain names and telephone numbers of potential customers from sources such as internet directories, telephone directories, trade directories, and lists purchased from other organizations. \n \n• Telephone or write email letters to correspondence with potential customers or to follow up initial sales contacts. \n \n• Documenting and recording information like entering, transcribing, recording, storing, or maintaining information of customers. \n \n• Maintain records of contacts, accounts, and new opportunities/leads created. \n \n• Conduct client or market surveys in order to obtain information about potential customers. \n \n• Contact existing customers to promote cross-sell or up-sell of companies' products and services. \n \n• Maintains phone time or sales quotas as determined by management \n \n \nSMS interest to Keagan @ 93526073, Preferably Locals and ability to converse in Chinese     ",
        "title": "Administrator / Personal Assistant"
    },
    {
        "postid": "5954302547",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nmy name is Lou Hou Wah, stay in singapore i have already been in problem with loan shark, 1st of january i ran out of my house and went to my mothers house because loan shark looking for me, no money to pay the loan shark because of bad business that went wrong, but what happened i met this company they granted me a loan very fast, we worked online me also very scared to work with them, but i got my loan from them paid off the loan shark, M very grateful for their help now i want other people who need any type of loan to contact them through whatsapp +601126530905 they are called financial craft.     ",
        "title": "How i got my financial rescue"
    },
    {
        "postid": "5936977882",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nYourglobalpro is an online platform for CPA Lawyer cross-border consultant. Services offered include company formation, trademark registration, Accounting services \nYourglobalpro offers cross-border business services in 40 countries including in Australia, Bahrain, Belgium, Brazil, France, Germany, Hong Kong, India, Indonesia, Ireland, Italy,Japan, Kenya, Luxembourg, Malaysia, Mexico, Netherlands, Oman, Panama, Qatar, Saudi Arabia, Singapore, Spain, Sri Lanka, Tanzania, United Arab Emirates, United Kingdom andUSA.  \n ",
        "title": "CPA Lawyer cross-border consultant"
    },
    {
        "postid": "5916022941",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#10004;Looking for someone currently working in Telco (Singtel , Starhub , M1) \n&#10004;Looking for someone currently working in money lender (Singapore) \n&#10004;Looking for leads / Data \n&#10004;Looking for debt collector \nGreat opportunity!!! Good Earning !!!  \nCall or sms me for more info 84054862 / Whatsapp  83512053 \nGT Agency Pte Ltd  \n(Marketing Director) \nJoe Tan     ",
        "title": "Looking for extra cash?"
    },
    {
        "postid": "5954305551",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nmy name is Lou Hou Wah, stay in singapore i have already been in problem with loan shark, 1st of january i ran out of my house and went to my mothers house because loan shark looking for me, no money to pay the loan shark because of bad business that went wrong, but what happened i met this company they granted me a loan very fast, we worked online me also very scared to work with them, but i got my loan from them paid off the loan shark, M very grateful for their help now i want other people who need any type of loan to contact them through whatsapp +601126530905 they are called financial craft.     ",
        "title": "How i got my financial rescue"
    },
    {
        "postid": "5941837940",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWork from home..do shopping or make daily commission for accounts ..Partime of full time     ",
        "title": "Vacancy For Shopper !!!!1000 weekly"
    }
]