[
    {
        "postid": "5943124550",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSTART THE NEW YEAR WITH A BANG AND TRANSFORM YOUR BODY! \n \nWith over 9 years experience in the sport and fitness industry, I have a wealth of knowledge and I have worked with some awesome clients and coaches throughout my career! \n \nI provide the ultimate bespoke service for my clients, after our free consultation I will provide a training and nutritional programme that is tailored to your needs. \n \nSpecialising in: \n- Body transformation \n- Fat loss  \n- Strength and bodybuilding \n- Sport specific training \n- Injury and rehabilitation  \n \nGet in touch NOW for your FREE consultation: \n  show contact info \n \n+\n  show contact info \n \n \nAlso an online coach at www.personalconditioningcoaches.com     ",
        "title": "Personal Trainer and Lifestyle Coach (British, highly qualified)"
    },
    {
        "postid": "5915968746",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you paying too much for your facial IPL or RF treatments? Or waiting in line for too long?  \nUnlimited IPL or RF Facials at $149 per month or $799 for 6 months. \n \nAt Wellaholic. No Queues. No Waiting Time. No Excuses.  \nCall us at 68168038 to book a free trial now. \n \nRead more at www.wellaholic.com  \n ",
        "title": "Unlimited IPL or RF Facials at $149 per month"
    },
    {
        "postid": "5898959343",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPhuket Makeup Artist for Weddings. \nBridal Hair &amp; Makeup for Pre Wedding Shoots in Krabi,Phuket,Khao Lak. \nwww.weddingmakeupinphuket.com  \nAirbrush makeup available. \nVisiting Service. \nHair Stylist for Weddings &amp; Events in Thailand. \nMakeup Artist Phuket (facebook)     ",
        "title": "Makeup Artist Phuket H&M; Wedding"
    },
    {
        "postid": "5914544822",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHouse-call service, location at your convenience. \n \nWe provide professional makeup and hairstyling services for your beauty needs on your special day. \n \nBridal. D&amp;D. Parties. Event. Stage. \n \nFor booking and enquiries: \nWhatsapp: 97910849 \n \nFind out more at our website: www.reynahearts.com     ",
        "title": "Makeup &amp; Hairstyling Service"
    },
    {
        "postid": "5944547989",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#25105;&#20204;&#26469;&#33258;&#20110;&#20013;&#22269;, &#28418;&#20142;, &#39640;, &#30382;&#32932;&#30333;, &#36523;&#26448;&#28779;&#36771;, D&#32617;&#26479;&#12290;&#25105;&#20204;&#25552;&#20379;&#25353;&#25705;&#21644;&#20854;&#20182;&#26381;&#21153;, &#20215;&#38065;&#21512;&#29702;, &#26381;&#21153;&#22909;&#12290; \n \n&#25105;&#20204;&#30340;&#24215;&#22312;: Parklane Shopping Mall Cozy Slimming Centre #02-19 &#21644; #02-19B. \n \n&#23545;&#19981;&#36215;, &#25105;&#20204;&#19981;&#25552;&#20379;&#33080;&#29031;&#12290;&#31561;&#20182;&#20204;&#12290; \n \nAilin - 90601045 \nYing Ying - 98894765     ",
        "title": "2 beautiful ladies are waiting for you"
    },
    {
        "postid": "5914449352",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThank you for customer long term support J Studios, IPL Hair Removal is one of the most popular services at J Studios due to the good reputation of effective results.  \n \nAs an appreciation to customers, we offer an unbelievable rock bottom discount ever! We have never offered such low price before. Now, you can grab the chance to enjoy big saving!  \n \nWe offer huge discount to all Hair Removal Treatments (Upper lip, Chin, Arms, Underarms, Legs, Bikini Lines, Brazilian).  \n \nCall/SMS/Whatspp to 91828565 to discover the amazing discount price now!  \n \nhttp://www.jstudios.com.sg/index.php/en/our-services/ipl-permanent-hair-removal     ",
        "title": "No more waxing and shaving! Go for IPL Hair Removal in Huge Discount!"
    },
    {
        "postid": "5914448256",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJ Studios has been established since 2011 and based on good reviews and reputation, we have strong support by our customers. Although we are located in Chinese Garden, some customers are even come from the east side of Singapore and some of them are airline flight attendants and TV artists.  \n \nWhy customers like J Studios? \n \n1. Privacy - We provide exclusiveness to you for maximum privacy, unlike ordinary salon on the street. \n2. Ladies only - As we only serve female customers, that gives you a piece of mind. \n3. Effective beauty machines - advance machines to maximize the result. \n4. Friendly and non-pushy environment - we provide expert advice and professional attitude. \n5. Relaxing decor and amenity to let you forget the hassles. \n6. Professional skills - we are certified by CIDESCO and CIBTAC to give you full confidence. \n \nCheck out the reviews by our customers: http://www.jstudios.com.sg/index.php/en/j-studios/testimonials \n \nCheck out our facebook page to learn more: http://www.facebook/jstudios.com.sg \n \nPlease contact 91828565 for enquiry and appointment.     ",
        "title": "J Studios Review - Facial Service, Hair Removal, Body Slimming, Makeup"
    },
    {
        "postid": "5900359538",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nNeed help with troubled skin?  \n \nWhatever your concerns may be, My Facial Room offers various safe, time-tested, affordable and professional facial treatments to cater to your skincare needs.  \n \nCall / SMS Wilson Lim @ 9225 9058 now to fix an appointment. Consultation is FREE.  \n \nOr, log on to http://facialroomsg.wixsite.com/myfacialroom for more details.  \n \n \nLet My Facial Room help you achieve better skin health. Regain your confidence today.  \n \n \n \nMy Facial Room -- Professional Home Skin Care Services that Work | Address : Block 154 Bishan Street 13 #07-02 Singapore 570154. | Tel : 9225 9058 ( By appointment only) | Web : http://facialroomsg.wixsite.com/myfacialroom | Blog : http://arieswilson.blogspot.sg | Facebook : http://facebook.com/facialroom.sg  \n \nBusiness hours : 3pm to 9pm on weekdays, 5pm to 9pm on Saturdays, and 11am to 8pm on Sundays and Public Holidays.  \n \n \n* Certified by International Therapy Examination Council, England ( ITEC -- UK), with over 10 years of professional experience.  \n \n* Only premium quality beauty products ( formulated in France and USA), professional salon-standard machines and pure, energised water ( Reverse Osmosis Water) are used in every facial therapy for optimum benefits.  \n \n* All equipment and instruments are sanitised to clinical standard, before and after every use, for your safety and protection.  \n \n* Both genders are welcome.  \n \n* No GST.  \n \n* Mode of payment : Cash only.     ",
        "title": "My Facial Room - Your Answer to Clearer Skin in only One Session"
    },
    {
        "postid": "5923925346",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWelcome to a whole new you! \n \nWe specialize in fat loss, muscle toning and strengthening, kickboxing/Muay Thai, TRX, kettlebells, human movement, trigger point therapy (pain relief) and posture correction.  \n \nOne-to-one, buddy package and small groups of up to 4(to be formed by you). We have a base studio in town. Or we can also travel to your convenience and train you at your condo gym, fitness corner/park, stadium or beach. Subjected to the trainer's availability. \n \nWe do have female trainers as well! \n \nKindly connect with us to discuss rates, establish a goal setting. We are currently running a year end promotion so don't hesitate, reach us now! \nOff-peak rates avail as well. \n \nCheers! \n ",
        "title": "Fitness with you!"
    },
    {
        "postid": "5950291619",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello Folks \n \nOne of the elite photography studio is traveling to Singapore for a couple of days and would like to offer you our services with respect to Indoor/Outdoor Photography for Couples &amp; ;Aspiring Models. We are best in class when it comes to creative lighting at the best affordable costing in whole of Singapore... email us or call us to discuss further... hurry up folks book your slot  \n \n \nCheers  \nViki     ",
        "title": "Outdoor Modeling Photography - Best Offer in SG"
    },
    {
        "postid": "5957360470",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nNeed Help with Troubled Skin? \n \nMy Facial Room offers various Professional, Safe, Time-tested and Affordable facial treatments, customised to your skin care needs.  \n \nCall / SMS Wilson Lim @ 9225 9058 now to fix an appointment. Consultation is FREE.  \n \nOr, log on to http://facialroomsg.wixsite.com/myfacialroom for more details. \n \n \nLet My Facial Room help you achieve better skin health. Regain your confidence today! \n \n \n \nMy Facial Room -- Professional Home Skin Care Services that Work | Address : Block 154 Bishan Street 13 #07-02 Singapore 570154. | Tel : 9225 9058 ( By appointment only) | Web : http://facialroomsg.wixsite.com/myfacialroom | Blog : http://arieswilson.blogspot.sg | Facebook : http://facebook.com/facialroom.sg \n \nBusiness hours : 3pm to 9pm on weekdays, 5pm to 9pm on Saturdays, and 11am to 8pm on Sundays and Public Holidays. \n \n \n* Certified by ITEC - UK, with over 10 years of professional experience.  \n \n* Only premium quality beauty products, professional salon-grade machines and pure, energised water are used. \n \n* All equipment and instruments are sanitised to clinical standard.  \n \n* No GST.  \n \n* Both genders are welcome. \n \n* Mode of payment : Cash only.     ",
        "title": "My Facial Room - Your Answer to Clearer Skin in Only One Session."
    },
    {
        "postid": "5914439487",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty salon in Jurong East to provide you RF facial treatments to solve your troubles. We are not the ordinary home salon to provide normal face washing. We use advance machines to ensure the best result to let you gain confidence again in the shortest time. In J Studios, we guarantee your treatment will not be undercut. Because we are ethical and we want to truly solve your problem.  \n \nThis is a trial treatment for RF Face Rejuvenation. \n \nWe do have other RF services for other parts:  \n \nEye Bags  \nEye Wrinkles  \nNeck  \n \nThe treatment is highly personalized to suit your skin condition. Incorporate specialized skincare products from Japan to provide the best results. We offer attractive trial session for your first time experience.  \n \nFor female customers only.  \n \nPlease call/sms/whatsapp 91828565 to make appointment.  \nLike our facebook page: http://facebook.com/jstudios.com.sg  \nWebsite: https://www.jstudios.com.sg  \nFollow us on Twitter: http://twitter.com/JstudiosJerrie     ",
        "title": "Radio Frequency RF Face Rejuvenation Trial Treatment in Jurong"
    },
    {
        "postid": "5912215402",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe provide makeup and hairstyling services for bridal, pre wedding, mothers, bridesmaids, DND, events, etc.   \n \nPlease view my work at https://www.facebook.com/TiffanyBeautyUnveilMakeover/     ",
        "title": "Makeup and hairstyling services by Tiffany Beauty Unveil Makeover"
    },
    {
        "postid": "5915744132",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty studio in Jurong East to provide you facial and body treatments. We are not the ordinary home salon to provide those simple treatments. We use advance machines to ensure the best result to let you gain confidence again in the shortest time.  \n \nOur services: \n \n1. Signature Oxygen Deep Cleansing \n2. Acne Treatment \n3. IPL Photofacial \n4. RF Face Rejuvenation \n5. Fat Freeze Body Slimming \n6. Bust Enhancement Treatment \n7. Professional Makeup Services \n \nFor female customers only. \n \nPlease call/sms/whatsapp 91828565 to make appointment.  \nLike our facebook page: http://facebook.com/jstudios.com.sg \nWebsite: https://www.jstudios.com.sg \nFollow us on Twitter: jstudios jerrie@JstudiosJerrie \nEmail: \n  show contact info \n ",
        "title": "Good Beauty Salon in Jurong, Jurong East, Lakeside, Chinese Garden"
    },
    {
        "postid": "5929517082",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n3D Korean eyebrow embroidery service at S$399 nett per pax (inclusive of three touch-ups within 12 mths). \n \nCNY Promo:  \nPromo A: S$50 off per pax if service is booked via Facebook @ JMF Ultimately Korean 3D Eyebrow \nPromo B: Additional free touch-up (worth S$200) per pax for booking for two persons* \n(*Both persons must attend the same session together. Each person will enjoy 3 + 1 touch-ups within 12 mths.) \n \nPlease call for appointment :-) \n ",
        "title": "Korean Eyebrow Embroidery"
    },
    {
        "postid": "5946215672",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBelle Dona is best Singapore Escort Agency. We offer hot escort models of different countries like India, Asian, Russian and many more. See at http://www.belledonna.co/ \n ",
        "title": "Best Singapore Escort Agency"
    },
    {
        "postid": "5936984507",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI'm certified personal trainer, in fitness industry for 6 years. I provide home visit personal training service. Flexible arrangement to match your working schedule. \n \nMeet me and work together towards your goal: \nWeight loss/ building muscle/ toning/ Fitness \n \nFor Free try out session with me &amp; free fitness tip... \n \nPlease visit https://xercises.wordpress.com/     ",
        "title": "Training, slimming &amp; toning"
    },
    {
        "postid": "5931444451",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFreelance female photographer offers the following photography services: \n \n- portrait photography \n \n- female boudoir photography \n \n- model portfolio photography \n \n- lesbian couple photography \n \nSD memory card used to store the images will be given to the client right after the photo session. Please SMS 81159381 for details. I will call you within 24 hours. You may indicate what time to call you or what time not to call you.     ",
        "title": "Indoor/outdoor portrait photography services"
    },
    {
        "postid": "5908996937",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nProfessional Makeup  \n \nWhenever you need to attend an important event such as Dinner &amp;Dance, Wedding Banquet, Party, Function/Event and Occasion. You benefit from the professional fantastic creativity, knowledge and reputation from us for creating a truly personal look. We use premium cosmetic products to achieve exceptional results that make you look and feel beautiful on your special day.  \n \nSkin Treatment + Makeup  \n \nYou can also consider to have a skin treatment before the make up session or after your event as a post-event treatment or both. We give you the flexiblity at J Studios.  \n \nCheck out our website https://www.jstudios.com.sg or text to us 91828565 for more details and appointment.  \n \nDetail URL: http://www.jstudios.com.sg/index.php/en/our-services/professional-wedding-make-up     ",
        "title": "D&D; / Dinner &amp; Dance Makeup Service by J Studios"
    },
    {
        "postid": "5915776402",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty salon in Jurong East to provide you facial and body treatments.  \n \nTry our Fat Freeze body slimming treatment. The treatment can effectively destroy fat cells to reshape body contours. After the treatment, it takes a few weeks to shrink down the fat layers. \n \nVisit our website to learn more. \n \nhttp://www.jstudios.com.sg/index.php/en/our-servic... \n \nWe offer flat rate session, no package is required to match our own pace. \n \nFor female customers only. \n \nPlease call/sms/whatsapp 91828565 to make appointment. \n \nWebsite: https://www.jstudios.com.sg \n \nLike our facebook page: http://facebook.com/jstudios.com.sg     ",
        "title": "Good Body Slimming &amp; Body Shaping - Fat Freeze Treatment by J Studios"
    },
    {
        "postid": "5915895247",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nsemi-permanent makeup in Seoul  high quality services in their state-of-the-art facility and guarantee that you will be completely satisfied with your look.  \nhttp://wishandco.kr/semi-permanent-make-up/ \n ",
        "title": "Low Cost of Semi Permanent make up in Seoul"
    },
    {
        "postid": "5949082637",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAny women interested for cunnilingus     ",
        "title": "Man for women"
    },
    {
        "postid": "5947594214",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you paying too much for your facial IPL or RF treatments? Or waiting in line for too long? At Wellaholic, we offer Elight Facials for the full face at only S$59 nett. This is a skin treatment that uses intense pulsed light, or photo-dynamic therapy to treat skin conditions and remove effects of photo-ageing such as wrinkles, spots, and textures. The process induces controlled wounds on the skin with no downtime, prompting it to heal itself by creating new cells. This treatment can be purchased here online or directly at our facial studio. \n \n ",
        "title": "Full Elight Facial @ $59 nett"
    },
    {
        "postid": "5907481177",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAbout the Product \nNo unpleasant side effects! No more torturous cleanses or diet pills full of chemicals-these teas are 100% natural and great for promoting overall wellness Antioxidant-rich! Even more antioxidant than green tea, this tea blend helps strengthen your body's natural detox system, so you can flush out toxins quicker Reduce inflammation! Several of the teas are known for reducing inflammation and providing relief from headaches and menstrual pain. Get beautiful skin! This tea blend is known to promote clearer skin-another reason why it's popular with Brazilian models To enjoy the amazing health-boosting effects of the Brazilian Slimming Tea system, simply enjoy each tea at its designated time throughout the day. Each blend brings its own powerful benefits: \n- Assist in the detoxification of the blood and excrete waste products in the body. Improve health \n- Stimulates erythropoiesis. Dialysis to clean \n- Help restore liver function. \n- Skin inflammation, acne, freckles and dark spots. \n \nLine ID: thaibeautyskin \nWhatsapp: +\n  show contact info \n \nDelivery HotLine :96624244 \n \n$28 per Box for selfcollect. $4 per box for mail or delivery \n \nFor CREDIT CARD User please buy at www.thaibeautyskin.com \nThank you \nRin \n ",
        "title": "Colly Chlorophyll Plus Fiber"
    },
    {
        "postid": "5922752905",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFacial re-contouring Specialists, Experts in Dermal Filler procedures, Botox and Thread Lifting; Facial Rejuvenation with Cellular Therapy, IPL and new Thermage Total Tip. Unbeatable prices with one of the best Medical Team in Bangkok !! VIP Class Clinic with individual tracking systems for customized treatments, allowing quality reports and follow-ups for your doctor's convenience and efficiency.  Service minded operation for amazing results. \nBangkok Metro Clinic hires skilled practicians specializing in a full range of beauty enhancement treatments, using advanced medical equipment, modern technology and upholding to the highest standards of care. \nGet your consultation now! We have solutions for every patient. \n \n \"The beautification of our patients is our success\" \n \nInternational Care Manager: \n  show contact info \n \nwww.metrobangkokclinicmedicaltour.webnode.com \n \nContact in English and French, Mr Rano 0066(0)831898931 or in Thai 0066(0)850399997. \n ",
        "title": "Metro Bangkok Clinic"
    },
    {
        "postid": "5955826528",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIntro of me as below line.... \n Name -Thira \n Age-27 \n Gender&amp;race-Male&amp;Indian \n Experience-5years in the service line. \n Like&amp;dislike-social drinker &amp;hate smoking.. \n \n    Hi -to my dear friends here i am local boy early 27age years old...currentky doing full time as professional masseurs.. \nMy sevice will held in your planed places only...all service will be clean &amp; ckear cut service only..no dirty job or intimate desire request or etc -(Not will be entertained) \nMy price bot high as other personal thta requested in market nowdays.. \n \nI m currently located in Ang mo kio central area... so without countless of age ,race ,gender -male/female,relegiound &amp; all personal can contact me anytime from me now... \nI am will massages as your special request on it to.,&amp;basically my massage will relief your body pain and relax yiur massage..-will conduct massage for one to teo hours.. \nI well know &amp; studied in yoni massages, tantra massage,kamaa massages well..so , serious service needed personal plz do whatssApp ,direct call&amp;sms at - \n(+65-nine-six, one*two , four,eight , seven ^nine*-- \n \nThankYou..) \n \nThank you..     ",
        "title": "A Pro in sensual Massage is ready In Sg Wide-Call up !!!!"
    },
    {
        "postid": "5957269512",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe offer haircut service based on your request, time and location of your choice, be it in your house or office as we understand that haircut should be made convenient... \n \nWhether it's a last minute date, an important meeting or simply you feel lazy to get out from the comfort of your house, wecut is there to make sure you always look your very best from 8:00am - midnight, seven days a week... \n \n3 Steps to \"Quick\", \"Affordable\" &amp; \"Quality\" Haircut : \n \n#1 Contact us through whatsapp 85881115 \n#2 Tell us WHERE &amp; WHEN to book \n#3 Sit back &amp; relax \n \nVisit www.facebook.com/wecut.singapore for more details... \n \nWebsite : www.wecut.weebly.com \nWhatsapp : 85881115     ",
        "title": "Home-Service Haircut ($10)"
    },
    {
        "postid": "5921372874",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty salon in Jurong East to provide you effective IPL hair removal treatments. We use advance machines to ensure the best result to let you gain confidence again in the shortest time. \n \nServices include: \n \nLeg Hair Removal \nArm Hair Removal \nFace/Upper/Lower Lip Hair Removal \nBikini/Brazilian Hair Removal \nBack Hair Removal \n \nFor female customers only. \n \nPlease call/sms/whatsapp 91828565 to make appointment. \n \nLike our facebook page: http://facebook.com/jstudios.com.sg \n \nWebsite: https://www.jstudios.com.sg     ",
        "title": "No More Painful Waxing! Full Leg IPL Permanent Hair Removal"
    },
    {
        "postid": "5940881250",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe provide body massage, body scrub, and facial service at our quiet place. \nDone by local Malay lady \nPlease call for an appointment \nHana: 93581663 \nHani: 98655153 \nAngel: 81204398 \n ",
        "title": "Body massage and facial spa"
    },
    {
        "postid": "5907475160",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nANTI-AGING \nPROTECT SKIN FROM FUTURE DAMAGE \nSKIN TRANFORMS TO A MORE YOUTHFUL BEGINNING \nREDUCE FINE LINES &amp; WRINKLES, IMPROVE FIRMNESS. \nBRIGHTNESS &amp; REHYDRATING THE SKIN \nFOR PEOPLE THAT WANT TO HAVE YOUNGER AND WHITEING SKIN \n \nLine ID: Thaibeautyskin \nWhatsapp: +\n  show contact info \n \n \nFor CREDIT CARD User please buy at www.thaibeautyskin.com \nThank you \nRin \n ",
        "title": "SNAIL WHITE FILTRATE MOISTURE CREAM"
    },
    {
        "postid": "5932264127",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPersonal fitness training at your preferred location &amp; schedule. Cost effective training with a professional trainer in a fun, friendly and results-driven atmosphere. \n \n*Lose fat / gain muscle / shape up physique \n*Improve overall fitness or any specific aspects of fitness/athletic ability. \n*Suitable for anyone (athletes and non athletes alike) (Sedentary or active alike) \n \n-Trainer is qualified and experienced  \n-Cost effective rates:  \nSingle / Trial session for 1 hour: 1 person: $65  \n2 person: $90  \n(Trial session can be topped up into any package)  \n4 sessions package (1 hour per session): 1 person: $210  \n2 person: $290  \n8 sessions package (1 hour per session): 1 person: $400  \n2 person: $530  \n \nGlen is your neighborhood Personal Fitness Trainer of choice for someone who needs a trainer who is flexible in scheduling and of course - results driven. Experienced, friendly and personalized. Every person Glen trains, has a finely tailored training and diet program to follow. Price all inclusive of full guidance (self workout plans and complementary diet guidance).  \n \nContact Glen today to discuss or arrange for the Personal training! Contact (SMS/Call) Personal Trainer Glen @ 98450655 or email to \n  show contact info \n For more info, please visit http://www.trainingbyglen.com/fitness---athletic-training.html     ",
        "title": "Personal fitness training at your preferred location &amp; schedule"
    },
    {
        "postid": "5916166347",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nKangen water machines are getting popular in Singapore and the rest of the world too. And the reasons are the multiple benefits that come along with drinking this natural, pure water. There are numerous advantages of drinking Kangen water made by Kangen water machine. It is rich in antioxidants and the Kangen water machine gets rid of all the toxins and harmful chemicals present in the water. What you get is clean pure water that is healthy for your body and provides better hydration. It also helps in detoxifying the body and purifying the system. Medical professionals have tested the Kangen water and found it carrying multiple health benefits. \n \nThere is a great demand of Kangen water that put the drinking water under an ionization process that results in naturally ionized Kangen water. The harmful free radicals that are present in our body get neutralized by the active ingredient hydrogen present in the water created by Kangen water ionizer. The Kangen water machine have been awarded Gold Seal certification from the Water Quality Association (USA). It also have been awarded ISO 13485 as a medical machine.  \n \nThe Kangen water ionizer system has the capability of dispensing 5 different kinds of water and for different purpose. The electrode plates used in Kangen water machine is made entirely of pure solid medical grade titanium and platinum-coated plate and the flow-rate sensor equipped in the machine ensures only making quality water through the ionization process. You will find the power consumption a lot less as compared to other alkaline water ionizer. The solid medical grade titanium and platinum-coated plates are able to yield much cleaner and purer water in spite of having fewer electrode plates and lower consumption of water. The machine is a must have for all families. \n \nThus, we find a clear relationship between health and Kangen water and the positive impacts of water on our health. There are some very good reasons why every family should own a Kangen water machine. Already thousands of families are satisfied with the quality of the water and enjoying the health benefits. \n ",
        "title": "Drink Healthy Kangen Water And Stay Healthy"
    },
    {
        "postid": "5954340641",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking For Infection Control And BIO-Bio-Decontamination Services in Singapore.Utopia provides solution for Infection control and Decontamination through BioGienie.For more details on please be touch with us today onwards..! \n \n \nContact Us: \n \n7 Kaki Bukit Place, \nEunos TechPark,  \nSingapore 416185 \n \nTel : \n  show contact info \n \nFax: \n  show contact info \n \n \nEmail: \n  show contact info \n \nWeb : http://www.utopia.com.sg/ \n ",
        "title": "Infection Control"
    },
    {
        "postid": "5954441120",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExperienced female therapist available for home services - waxing (guys and gals) and pedicure and manicure.  Reasonable rates.  In the comfort of your home or hotel.  Strictly professional.     ",
        "title": "Home services available"
    },
    {
        "postid": "5910434286",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nim john, \nLooking for male bonding  \ncontact me @ 90373566 or 90160119     ",
        "title": "Meet for Male bonding"
    },
    {
        "postid": "5905748012",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLosing weight is not easy and losing weight so it stays off is even harder. \nHaving lost weight then regained weight back and forth for years , I have devised a totally efficient and sustainable method of losing weight and getting rid of the deadly fat around the tummy. \n \nStart the new year at the Belly boot camp learn how to lose the weight and have it stay off , individualised programmes with before and after measurement , photo's and guidance after the boot camp on a monthly basis. \n \nGet fit not fat and come lose the weight and keep it off get rid of the gargantuan gut and stay alive and feel alive. \n \nWe have maximum of 10 slots for 3 day boot camp SGD 2500 per person.inc accomodation \n \nPrice includes individual follow up for 1 year     ",
        "title": "Belly Boot Camp"
    },
    {
        "postid": "5936936093",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPersonal Training @ Your Doorstep \n \n2017 is just around the corner. Looking to start on that weight loss goal? Wanting to get started on that lifestyle change or simply to just get some motivation to move? \n \nProviding affordable personal training for everyone.  \n \nTraining at all Location. Quick and efficient. Best part is that we go to you.  \n \nCost : $80 for 45mins \n \nBuddy/Group sessions  \navailable.  \n \nWhat We Provide: \n- Weight Loss \n- Strength Training \n- Flexibility &amp; Mobility Training \n- High Intensity Interval Training \n- Outdoor Bootcamp \n- Nutrition/ Diet Advice \n- Corporate Classes \n \nPM/Email for more details. Up for negotiations.     ",
        "title": "Personal Training @ Your Doorstep"
    },
    {
        "postid": "5897287760",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWhat Have You Got To LOSE? \n \nThe Loser Is The Winner \n \nWondering how you're going to fit into those new clothes in your wardrobe and ready for the coming festive parties? \n \nSo now discover a fun way to do just that and manage your weight, through: \n \n&gt;&gt; Support from your own personal coach \n&gt;&gt; Education on nutrition and eating well, for long term weight management \n&gt;&gt; Opportunities to meet like-minded people every week \n&gt;&gt; Inspiration in a fun environment, to achieve healthy results \n \nJoin the Weight Loss Challenge, you can gain the knowledge and confidence, to achieve healthy lasting weight loss within short period of time. \n \nIt's a 'challenge' because you could even win a cash prize if you are one of the top achievers in your Weight Loss Challenge. \n \nTo know more SMS or Whatsapp 9226 9733 Simon for details     ",
        "title": "What Have You Got To LOSE?"
    },
    {
        "postid": "5946117645",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMalena Bridal is leading fashion online store in Singapore. We offer best bridal makeup services provider in Singapore. see at https://www.malenabridal.com/best-artist-bridal-makeup-service-singapore/ \n ",
        "title": "Hire best bridal makeup service in singapore"
    },
    {
        "postid": "5908996268",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty salon in Jurong East to provide you IPL hair removal treatments to solve your troubles. We are not the ordinary salon to provide waxing. We use advance machines to ensure the best result to let you gain confidence again in the shortest time.  \n \nOrdinary beauty salons charge low price and deliver insufficient IPL shots and the interval of treatment is long. That's why people who have signed up hair removal treatment complains on the effectiveness of the treatment. In J Studios, we guarantee your IPL shots; treatment interval will not be undercut. Because we are ethical and we want to truly solve your problem.  \n \nThis is a trial treatment for IPL Permanent Hair Removal for Brazilian.  \n \nWe do have other hair removal services for other parts:  \n \nUpper Lip/Chin Hair Removal  \nLeg Hair Removal  \nArm Hair Removal  \nFace Hair Removal  \nBikini Line Hair Removal  \nBack Hair Removal  \n \nThe treatment is highly personalized to suit your skin &amp; hair condition. Incorporate specialized skincare products from Japan to provide the best results. We offer attractive trial session for your first time experience.  \n \nFor female customers only.  \n \nPlease call/sms/whatsapp 91828565 to make appointment.  \nLike our facebook page: http://facebook.com/jstudios.com.sg  \nWebsite: https://www.jstudios.com.sg  \nFollow us on Twitter: http://twitter.com/JstudiosJerrie     ",
        "title": "Best in Town Brazilian IPL Permanent Hair Removal Treatment in Jurong"
    },
    {
        "postid": "5911880914",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#25105;&#20204;&#26469;&#33258;&#20110;&#20013;&#22269;, &#28418;&#20142;, &#39640;, &#30382;&#32932;&#30333;, &#36523;&#26448;&#28779;&#36771;, D&#32617;&#26479;&#12290;&#25105;&#20204;&#25552;&#20379;&#25353;&#25705;&#21644;&#20854;&#20182;&#26381;&#21153;, &#20215;&#38065;&#21512;&#29702;, &#26381;&#21153;&#22909;&#12290; \n \n&#25105;&#20204;&#30340;&#24215;&#22312;: Parklane Shopping Mall Cozy Slimming Centre #02-19 &#21644; #02-19B. \n \n&#23545;&#19981;&#36215;, &#25105;&#20204;&#19981;&#25552;&#20379;&#33080;&#29031;&#12290;&#31561;&#20182;&#20204;&#12290; \n \nAilin - 90601045 \nYing Ying - 98894765 \n ",
        "title": "2 beautiful ladies are waiting for you"
    },
    {
        "postid": "5915778232",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well established boutique beauty salon in Jurong East to provide you IPL permanent hair removal treatments to solve your troubles. We are not the ordinary home salon to provide waxing. We use advance machines to ensure the best result to let you gain confidence again in the shortest time. \n \nOur Hair Removal Services include: \n \nLeg Hair Removal \nArm Hair Removal \nFace/Upper/Lower Lip Hair Removal \nBikini/Brazilian Hair Removal \nBack Hair Removal \n \nFor female customers only. \n \nPlease call/sms/whatsapp 91828565 to make appointment. \n \nLike our facebook page: http://facebook.com/jstudios.com.sg \n \nWebsite: https://www.jstudios.com.sg     ",
        "title": "Best Bikini Line IPL Permanent Hair Removal Treatment in Jurong East"
    },
    {
        "postid": "5905996893",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBody Transformation Challenge \n \nCheck Out This Amazing Transformation. Thousands Of People Lose Weight By Following This Simple Plan Within Weeks...... \n \nTo Learn More SMS or Whatsapp Simon @ 92269733 For Details \n \nStop Thinking... Taking Action Now To Start Your Transformation.     ",
        "title": "Body Transformation Challenge"
    },
    {
        "postid": "5900251563",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEnhance your natural look and restore the skin's volume and youthfulness by our facial filler treatments. No Surgery, No Incision and No Downtime. Its time to look and feel young by our modern, safe and effective filler treatments.  Call us now to book your appointment. Visit http://www.cutislaserclinics.com/service/face/dermal-fillers to get more information about our treatments.     ",
        "title": "Fillers Clinic in Singapore"
    },
    {
        "postid": "5915952618",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDear All, \n \nFeel to have a personal massage inside your own home?  \n \nA specialist with experience in Yoni / Swedish / Balinese /Thai massage !  \n \nLet the fingers speak what I can  capable of !  \n \nTry an appointment with me and see how it goes !  \n \nOpen to all ages and races !! \n \nContact me with your number and we tell how to have the appointment ! \n \n ",
        "title": "Massage to Heal the body needs"
    }
]