[
    {
        "postid": "5901799846",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGREENCARE Pest Control \n \nOffers a comprehensive range of pest control services to customer across the island with quick and effective solutions to pest problems. We work with clients from large multinational companies and SME to local homeowners. We a licensed and experienced team who always go the extra mile for our customers. you can feel confident that you are working with the experts when you engage our services. \n \nOur Services: \n \nMosquito Control \nFlies Control \nRodents Control \nFleas Control \nCockroach Control \nTermites Control \nBed Bugs Control \nBees and Snake \n \nWhy choose GREENCARE? \n \nHigh service commitment \nQuick Response \n24 hour Active Assistance service \nCompetitive price \nQuality Service with experienced technician \nService Level Commitment \n \nAble to start work within 4 hrs after signing the contract (weekdays) \nAble to start work within 8 hrs after signing the contract (weekends) \nAble to provide ad-hoc services within 2 hrs (existing clients) \nAble to provide ad-hoc services within 4 hrs (new client) \nHot-line availabe 24/7 \nOur Promotional Package: \n \na) Pest control services for F&B; Outlets - $38 \n \nb) Pest control services for Residential - $60 \n \nTo book for an appointment for free site inspection, please contact Eddie @ 81453579     ",
        "title": "Pest Control Services @ $38"
    },
    {
        "postid": "5943188288",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCMS &amp; E-Commerce Website for as low as S$2K. \n \nOwn your All-In-One website inclusive of Content Management System (CMS), E-commerce, Social Media Integration and Responsive Design for different devices with full control of your contents at just only S$2K.  \n- No more yearly maintenance fee \n- No more expensive website \n- Posting of contents anytime, anywhere.  \n- Be in full control \nIsn't it wonderful to do it at a low cost? Talk to us now! We can get your ideas and products to your customers fast! \n--- \nOur Digital Services:  \nWebsite Design &amp; Development \nMobile Application Design &amp; Development \nAugmented &amp; Virtual Reality \nInternet of Things (Tracking Technology) \nE-Commerce \nDigital Marketing (SEO, SEM &amp; SMM) \nDomain Registration &amp; Hosting Service \nTalk to us now \n  show contact info \n.  \nRemember to enter the PROMO CODE 'tdiweb' for the promo package. We will also provide you with guides and free quotation! \nwww.facebook.com/thedesigniconstudio     ",
        "title": "CMS &amp; E-Commerce Website for as low as S$2K."
    },
    {
        "postid": "5937275531",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFast, Proffessional and Experienced. \nLogo, brochure, poster and creative branding.  \n ",
        "title": "Graphic Design / Logo Design"
    },
    {
        "postid": "5904655675",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   \nThis listing consists of a shipment of physical items of a METAPHYSICAL NATURE!  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n \n*READ THIS FIRST: If you don't understand this ad or any others, please ASK POLITELY OR LEAVE THIS SITE NOW. If you don't understand English or are not fluent in the English language, please don't buy anything from us. You will receive a physical item in the mail after your purchase. If you are a skeptic or are not a genuine seeker, please leave now. Thank you for your attention.  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n \nAre you or your house bothered by unwanted spirits of any kind?  Finally, you get real help from us!   Forces allied to White magic are here to help you.  \n \n Tell us your situation in clear detail.  We'll see what we can do.  \n \n Tell us your maximum budget and make a reasonable offer.   * Make us your best offer now. No limit to maximum offer. We will scale the items we send you accordingly. FYI, you're buying instructions and advice.  \n \n +  PHYSICAL ITEMS WILL BE SENT TO YOU IN THE MAIL! Use as instructed.   + \n \nAsking price (negotiable): SGD $3,300   \n \nItems sent to you will commensurate with your offer.  \n \n \nTerms of sale:    \n \nFor informational and/or entertainment purposes only, with no warranties implied.  \n \nSold \"as is\".  \n \nSold as a curio.  \n \nThis offer consist of printed and physical materials. You will receive this in the mail. No meetings.  \n \nWe are not responsible for any use or misuse of any information we send you.    \n \n ",
        "title": "Exorcism! Ghostbusters! Banish or Chase Away Ghosts, unwanted spirits"
    },
    {
        "postid": "5943241460",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHave you taken a look at your website from your mobile phone? \n \nDo you know YOUR customers are having a difficult time on your website on mobile devices? \n \nYou probably already know this, but over 70% of online searches are performed from mobile devices and standard / conventional websites just don't cut it.  \n \nWhat you should be doing is to allow your visitor who are using mobile phones ways to contact you asap. Your website should have only one goal and that is to convert! That is how your business will grow. \n \n \n \nIf you are interested in getting your own mobile website that converts, do drop us an email.  \ndo NOT contact me with unsolicited services or offers     ",
        "title": "Stop turning your customers away"
    },
    {
        "postid": "5946193529",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPromo: CMS &amp; E-Commerce Website for as low as S$2K. \nOwn your All-In-One website inclusive of Basic Content Management System (CMS) or Basic E-commerce Package, Social Media Integration and Responsive Design for different devices with full control of your contents for as low as S$2K.  \n- No more yearly maintenance fee \n- No more expensive website \n- Posting of contents anytime, anywhere.  \n- Be in full control \n- Suitable for Start-ups, Entrepreneurs, Freelancers, Small Medium Businesses &amp; even corporate organisations. \nIsn't it wonderful to do it at such a low cost? Talk to us now! We can provide suggestions and get your ideas &amp; products to your customers fast! \n--- \nOur Digital Services:  \nWebsite Design &amp; Development \nMobile Application Design &amp; Development \nAugmented &amp; Virtual Reality \nInternet of Things (Tracking Technology) \nE-Commerce \nDigital Marketing (SEO, SEM &amp; SMM) \nDomain Registration &amp; Hosting Service \nTalk to us now \n  show contact info \n.  \nRemember to enter the PROMO CODE 'tdiweb' for the promo package. We will also provide you with guides and free quotation! \nwww.facebook.com/thedesigniconstudio     ",
        "title": "Promo: CMS &amp; E-Commerce Website for as low as S$2K."
    },
    {
        "postid": "5952896568",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello, \n \nMy name is Kelvin. I'm a Personal Trainer, Amazon Author and Affiliate Marketer. \n \nChuck Norris Once Said, \"I was once bitten by a king cobra, and after 5 days of agonizing pain, the cobra died.\" \n \nJokes aside, I enjoy a great joke and consider myself ultra creative.  \n \nDid you know that you can get more Youtube channel views and video views for your own Youtube videos by using a bright, neon green profile picture and commenting on popular videos? \n \nI can help you with most of your creative projects: article writing, creating book covers, photoshop projects, writing a 20-page book etc etc etc...basically anything interesting. I'm really open-minded and do not judge. In fact, I really like the quirky projects. I've written a dating book entitled 'Win Women Over by Ignoring Them'. It's not meant to be rude, but to be attention-grabbing because 'boring' doesn't grab attention. \n \nJust drop me a quick message with your project and how much you're paying. Can be anything you can think of that you need done. Then we can discuss further. \n \nA survey among retirees showed that in their twilight years, people regret 80% of what they didn't do rather than what they did. \n \nIf you have nothing on hand, but you're a creative and open-minded person, \nyou can visit my site at  http://ad.trwv.net/t.pl/95597/407375 \n \nIt's just a great way to share ideas. \n \nCheers! \n \nKelvin     ",
        "title": "Looking for Interesting Projects"
    },
    {
        "postid": "5905908440",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe offer a range of signage services and products such as customised signboards, acrylic signages,  \nindoor &amp; outdoor signages, etc that we ensure to exceed your expectations. We also offer many other  \nprinting services. Check out us website http://www.printz.com.sg for more details.     ",
        "title": "Printz | Banner Printing Singapore | Printing Services"
    },
    {
        "postid": "5946091400",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for Palletizing System manufacturer in Singapore. Feigeasia technology is right choice for you. We can offer complete systems for fully automatic packaging processes through the combination of filling equipment with our conveyor and palletising system. \n \n \nContact Us: \n \n \nNo. 6 Loyang Lane #02-03 \nSingapore - 508920 \n \nTel : +\n  show contact info \n \nFax : +\n  show contact info \n \n \nEmail : \n  show contact info \n \nWeb   : http://www.feigeasia.com.sg/ \n ",
        "title": "Palletizing System"
    },
    {
        "postid": "5911877441",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFor individuals who wants an private photo album for own collection or companies printing calendars or for events. Do contact me for discussions. \n \nPlease note that prices are negotiable.  \n \nPlease also note that I am using a normal digital camera.  \n \nThanks     ",
        "title": "Freelance photographer"
    },
    {
        "postid": "5920031348",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFormer top British radio dj US \nPromoted Beatles,Stones,zeppelin,etc \nAvailable for talented,original band \nMust be financially inedependent ! \nOnly SERIOUS responses considered !     ",
        "title": "Promoter bands"
    },
    {
        "postid": "5936938878",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe provides best hr service in everywhere in Singapore like Global Mobility, Employee engagement, Diversity Singapore along best service and affordable price , Because Hrmasia is best business strategic company in Singapore, Also if you want more Information so call us- \n  show contact info \n \n \nWebsite : http://www.hrmasia.com/     ",
        "title": "Global Mobility"
    },
    {
        "postid": "5907281723",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n8CLICKS Pte Ltd \n \nAs a Singapore Agency, we offer (Affordable, Fresh and Substance filled) web services.  \nWith our experience and expertise, we aim to make your ideas into reality. \nNo point spending so much but no result mah. \n \nCome see below what we have to offer. -Leh Long Leh Long- \n \nContent Management System (CMS) \n- Wordpress based \n- Animated Slide Show (mobile friendly) \n- Services Showcase \n- Contact page with Google Map integrated \n- Mobile Responsiveness \n- Social Media Integration \n- Google Analytics Provided \n \neCommerce System \n- Opencart based  \n- 2 custom made designs for you to choose from \n- up to 1000 products and SKUs \n- Promotions and Coupons deals \n- Third party payment gateway (Paypal) \n- Mobile Responsiveness \n- Social Integration \n- Google Analytics Provided \n \nAdvise: Wooommerce - skip / saim (Wordpress is not meant for ecommerce period.) \n \nCustomer Relation Management \nContact us for a demo. \nConfirm promise no dragon/phoenix talk. Purely demo and share. \n \n \nNo harm to contact us at 6681 6721 or \n  show contact info \n and let's sit down for a cup of Kopi! \nby the way ah quote is free want! \n \nwww.8clicks.com.sg \n8clicks to your ideas coming true.     ",
        "title": "Rock Bottom Price - Web Design Services"
    },
    {
        "postid": "5886814088",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExperienced writer who has worked across multiple categories - airlines, automobiles, retail, beauty, travel, tourism, hospitality, fashion, residential properties, banking, insurance, OTC pharmaceuticals, and just about anything else that needs ideas, headlines and words.  \n \nOriginally from Australia and working remotely throughout Asia, I've lived and worked in Singapore three times. I work off-site and turn-around projects fast. Always willing to negotiate on fees. I have a Singapore DBS bank account which make payments easy.  \n \nThere's many benefits to hiring a digital nomad creative: \n \n1. I don't take up desk space. \n2. I don't drink all the office coffee. \n3. I often like to work at night so a briefing late in the day can be in your inbox first thing in the morning - without complaints.  \n \nI'm only ever an email, Whatsapp call/text (on my SG number), or Skype call away.  \n \nTo view samples of my work, just ask.  \n \nLooking forward to working with you.     ",
        "title": "Freelance Copywriter (English) Available - Negotiable Rates"
    },
    {
        "postid": "5934069300",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for a graphic designer to assist with small and large projects. \n \nProject Examples: Business cards, event flyers, website banners. \n \n**THIS WILL PAY PER DESIGN/PROJECT** \n \nPlease respond with sample design. \n \nBusiness cards design 242.44 php- 484.88 php \n \nWebsite Banners  484.88 php - 969.75 php \n \nFlyers 484.88 php - 1212.19 php \n \nBook Cover Design 727.31 php - 1212.19 php \n \nWebsite Design ( Using templates, 1-3 pages non- eCommerce) 2424.38 php \n(each additional page is 727.31 php) \n \n \n \n**Requirements** \n \n-Must Be CREATIVE \n-Proven graphic designing experience \n-Possession of creative flair, versatility, conceptual/visual ability and originality \n-Ability to interact, communicate and present ideas \n-Up to date with industry leading software and technologies (In Design, Illustrator, Dreamweaver, Photoshop etc) \n-Highly proficient in all design aspects \n-Professionalism  \n ",
        "title": "Graphic Designer (needed)"
    },
    {
        "postid": "5947518281",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThere are a load of IT Professional Services open doors out there for you to think. Whether you need electrical designing, PC building, or some other type of structure, it's a matter of figuring out what you need and what number of you need with a exact end goal to take care of business. For more info at http://www.skyandf.com/articles/it-outsourcing-services \n ",
        "title": "What You Should Know About IT Professional Services?"
    },
    {
        "postid": "5950286747",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello , \n \nThis is Oruphoto a leading photography services is travelling to Singapore for a couple of days and would like to offer you our services with respect to Indoor/Outdoor Photography for Couples, Portraits, Modelling, Conceptual, Food, Nude Art. We are best in class when it comes to creative lighting at beat affordable costing in whole of Singapore... email us at \n  show contact info \n or contact us at the number provided in the poster. Cheers  \nViki     ",
        "title": "Outdoor Photography - Best Offer in SG"
    },
    {
        "postid": "5951526388",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI'm a freelance photographer with a passion for capturing candid and memorable moments of those around me.  \n \nPhotography services: \n \n- Actual Day Wedding / Pre-Wedding  \n- ROM / Solemnisation  \n- Couple photoshoot /Family photoshoot  \n- Maternity / Newborn  \n- Birthday parties  \n- Corporate/private events  \n- Graduation ceremonies  \n- Blog, Blog Shop  \n \nContact Chlo at 96461011 or email \n  show contact info \n \n \nFacebook: www.facebook.com/ChlographySG     ",
        "title": "Chlography Photography Services (Wedding/Birthday/Events..)"
    },
    {
        "postid": "5951694805",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRELIABLE Web Design - Web Programming and Web Development - SEO - Internet Marketing - Graphics Design - &amp; MORE! \n \nI have 8+ years of experience working with small to fortune 500 sized companies. \n \nMy specialized skills are: Web Design, WordPress, Graphics Design, SEO, Internet Marketing and more! \n \nI promise you, my rates are extremely competitive. My work is top notch, you won't find better anywhere on Craigslist. \n \nIf you have a project, CALL ME FIRST or TEXT ME @ 9369 6788     ",
        "title": "RELIABLE Web Design - Web Programming and Web Development and More!"
    },
    {
        "postid": "5926478622",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you looking online football shop in singapore? \n \nThe Singapore largest online football store for football boots, football shirts &amp; kits, football equipment, goalkeeper gloves, base layer &amp; more. FREE shipping for all SG orders over $20. For more details visit our website. \nAddress:- \nWebsite:- https://www.fat.asia/ \nFacebook:- https://www.facebook.com/FATAsiaOfficial \nInstagram:-https://www.instagram.com/fat.asia/ \nCarousell:- https://carousell.com/fat.asia  \n \n ",
        "title": "Buy Football Equipment Online in Singapore at Fat.Asia"
    },
    {
        "postid": "5898768086",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you Looking the best commercial interior designers companies in Singapore? \n \nThe Interior Lab is one of the most renowned design firms in Singapore. Equipped with over 11 years of experience, our team of interior design specialists has carried out numerous transformations to reach the pinnacle of success. Call us +\n  show contact info \n \n \nAddress:- \n86 Joo Chiat Place, Singapore 427803 \nPhone No:- +\n  show contact info \n \nEmail id:- \n  show contact info \n \nWebsite:- www.theinteriorlab.com.sg \nFacebook:- https://www.facebook.com/theinteriorlab/ \n ",
        "title": "Commercial Interior Designer Company Singapore - The Interior Lab"
    },
    {
        "postid": "5946454255",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRELIABLE Web Design - Web Programming and Web Development - \nSEO - Internet Marketing - Graphics Design - &amp; MORE! \n \nI have 8+ years of experience working with small to fortune \n500 sized companies. \n \nMy specialized skills are: Web Design, WordPress, Graphics \nDesign, SEO, Internet Marketing and more! \n \nI promise you, my rates are extremely competitive. My work is \ntop notch, you won't find better anywhere on Craigslist. \n \nIf you have a project, contact me via email.     ",
        "title": "RELIABLE Web Design - Web Programming and Web Development &amp; MORE!"
    },
    {
        "postid": "5914546622",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDisruptive Digital is a full-service digital agency based in Singapore offering creative, innovative &amp; effective digital marketing campaigns that are driven by ROI. \n \nOur team of senior, experienced consultants and marketers utilize a unique blend of strategy, creative, technology, and data to help clients drive growth and competitive advantage. \n \nWe want to change the way businesses engage, listen and share online while also providing seamless, frictionless digital engagements that enhance and enrich the customer's world. \n \nFor more information, please call +\n  show contact info \nor visit www.disruptivedigital.co. \n \nConnect with Disruptive Digital:  \n================= \nfacebook.com/DisruptiveDigital \nlinkedin.com/company/disruptive-digital-singapore \ndisruptivedigital.co/blog/ \n \nSpecialties: \nWeb Design and Development, Mobile App Development, Content Marketing, Search Engine Marketing (SEM), Search Engine Optimization (SEO), Social Media Marketing, Email Marketing, Pay Per Click (PPC) Management, Conversion Rate Optimization (CRO), Web Analytics     ",
        "title": "Digital Marketing, SEO &amp; SEM Agency - Disruptive Digital"
    },
    {
        "postid": "5954252601",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi! Freelance Webmaster available to work \n \nBeen working for many years and offering affordable and professional services \n \nHi I can build different websites.... \n \nPersonal/ Business Website \n \nMedicine/ Health Related \nGallery/ Photography/ Portfolio \nPhoto Uploading \nMusic/ Blog/ Forum/ Recording \nDating/ Adult/ Escort \nSocial Network/ Membership \nEcommerce/ Oscommerce \nFashion/ Clothing Related/ Cosmetics \nAnimals \nLanding/ Sales Page \nFood/ Restaurant \nDirectory/ Bidding/ Auction/ Buy and Sell/ Classified \nMachinery/ Gadgets/ Equipment Related \nTravel Site \nPlease contact me know and let me know how may i help you with your website needs  \n \nThank you     ",
        "title": "AFFORDABLE WEB &amp; GRAPHIC DESIGN SERVICE"
    },
    {
        "postid": "5915555310",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are specialist in Food Photography &amp; Graphic Design for the past 10 years. \n \nFeel free to call 9151 1440 and find out more information if you need such services, no obligation. \n \nOr visit our website at www.heryhuang.com     ",
        "title": "Food photography &amp; Graphic design"
    },
    {
        "postid": "5923853991",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n\"We design and develop bespoke digital innovations crucial for your businesses\" \nEideas is a boutique software development company based in  Sri Lanka ,Singapore and Thailand that helps businesses design and develop the most effective and innovative digital solutions. \n \nInnovative with Ideas \nWWW.EIDEAS.LK     ",
        "title": "awesome designs for your business"
    },
    {
        "postid": "5954221284",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAffordable photography service in Singapore for: \n \n- Portrait \n \n- ROM \n \n- Lifestyle \n \n- Others \n \n&#8203;View my portfolio at : http://negativeslidephoto.wixsite.com/home \n \nRates starting from $70 / hr. Min. booking is 2 hrs. \n \nContact me for a quote depending on the nature of event, duration, and editing requirement. Discount available for longer duration. \n \nContact (SMS / Whatsapp): +\n  show contact info \n \n \nThank you \n ",
        "title": "Affordable Photography Service (Portrait / ROM / Lifestyle)"
    },
    {
        "postid": "5954273252",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLim Yong Kien Productions, Quality Assured - Don't trust my words, trust your eyes!  \n \nVisit my portfolio here: www.limyongkien.com (I do video too! Different rates, message me, I'll give you a quote!)  \n \n \n \nWhat you're getting out of hiring me: \nMOE Recognised and Appreciated photography skills \nPhotographer with multiple newspaper publications \n \n \nServices Offered: \nPhotography for EVENTS (Office party, Birthday Party, ROM, SD Wedding PG etc) \nVideography (Filmmaker, Director, Camera Operator, Script writing etc) \nCLASSICAL MUSIC STRINGS QUARTET @ 400SGD \n \n \n \nPricing/Rates: \n \nPhotography: \n \n1HR Event - 80 SGD/hr \n \n2HR Event - 75 SGD/hr \n \n3+HR Event - 70SGD/hr \n \n \nVideo: \n \n \nPer hour: 120SGD \nPer video: 100SGD \n \n \n \n \n \nUNLIMITED PHOTOS \n \nI take as many photos as possible/ as per instructed. \n \n \n \nDelivery of Photos \n \nDetails regarding the delivery of final compiled shots can be discussed, but usually it will be through cloud transfer/DVD. Photos will be edited within 3-4 DAYS from shoot. \n \nContact: \n \nphone -- 98243142 \n \nYou can leave me a message \n \n \nHumblest Regards, \n \nYong Kien     ",
        "title": "limyongkien.com - Affordable Photography"
    },
    {
        "postid": "5909023348",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nApppl Combine is one such leading Creative advertising agency in Singapore that can amaze you with their out of the box advertising solutions.This is a hybrid, Innovative &amp; fast growing multinational marketing communication agency, which operates on a border less front, having 100% owned subsidiaries in Singapore, UK, India and Hong Kong. We also provide creative brand design for anty product and services. \n \nVisit My website - http://apppl.sg     ",
        "title": "Advertising Services In Singapore"
    },
    {
        "postid": "5922769814",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFreelance 3D/2D Cad &amp; Renovation Interior Designer  \n \nHi, this is designer artist -- Edweiss.   \n \nI have 14 years experience in the all types of design aspect, different styles &amp; functionalities of residential - HDB, condo, apartment, bungalow, landed house &amp; commercial - retail, hospitality, exhibition, event, window display, furniture piece, F&B;, office, landscape, house or commercial building exterior façade etc. projects.  \n \nI do 2D/3D design, sales cum site coordination work for renovation projects.   \n \nIf you have drawing assignment or need my renovation service, please kindly contact my mobile at +\n  show contact info \n \n ",
        "title": "Freelance 3D/2D Cad &amp; Renovation Interior Designer"
    }
]