[
    {
        "postid": "5957236470",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusic Retail Shop Assistant \nNo experience required \nvery flexible working hours \nOnly candidate who send in proper CV will be considered \n ",
        "title": "Retail Shop Assistant"
    },
    {
        "postid": "5900390761",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for Customer &amp; Sales Service Interns to join our team! If you love working in a fast-paced rewarding environment, then we want to talk to you! \nInterested candidates, kindly send your updated resume to mgt()createtalentsandmodels.com \n \nYou can also view Job Application Link Online: \nhttp://siva-sg.jobstreet.com/_ads/sg/jobs/2016/4/default/20/5175939.htm?9165616 \n Or \nhttps://www.facebook.com/CreateTalentsandModelsSingapore/ \n \nJob Description &amp; Requirement: \n·         Orientation and familiarisation of the products and services of the company. \n·         Events management -- assist in the quotation, presentation (if any) and execution of trade shows and events. \n·         General administrative work, drafting of invoices, contracts, etc. \n·         Provide Helpdesk Support \n·         Work hand-in-hand with marketing team to maintain corporate website, increase reach of website and other digital/social mediums with up-to-date information and activities \n·         Administer incoming models requests over the phone/email for appointment booking, administrative follow up and referrals. \n·         Candidate must be currently pursuing at least a Diploma or Bachelor's Degree in Business Studies/Administration/Management, Human Resource Management, and Economics, Marketing, Commerce or equivalent. \n·         Internship position(s) for duration of 4 month(s).     ",
        "title": "Create Talents and Models Hiring Students"
    },
    {
        "postid": "5921235520",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJob description: \n \n- Handling of phone calls \n- Serving of walk in customers \n- General admin duties \n \nJob Requirements: \n \n- Experienced as Receptionist or customer service ground job. (Candidates who work at hotel industry or as Cabin Crew are welcome to apply) \n- Customer oriented with high level of service attitude \n- Hardworking, outgoing and enthusiastic \n- Able to commit on weekends and Public Holidays \n- Roster job + 5.5 working weeks \n \nInterested candidates, please send us your detailed resume in MS word format, attached with your recent photograph, stating your current/last drawn &amp; expected salary to \n  show contact info \n (EA Lic. 02C2819 / Reg No. R1658303)     ",
        "title": "Receptionist (5.5 Days)"
    },
    {
        "postid": "5954390013",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWelcome to Web Survey Asia \n \nWe offer a Starbucks or Paypal gift card, Bitcoin, or Paypal for people who are selected for a mailing list. \n \nLook us up online using #websurveyasia hashtag, especially Youtube videos. Our Youtube videos also explain our special 50 for US$50 offer for South East Asia.  \n \nThe form is for those who wish to sign up to participate in surveys and questionnaires. We get requests from all around the World. \n \nMost clients are companies looking to expand into foreign markets, or companies looking to improve products and services in Australia and Asia. \n \nAnyone can join up to these surveys. Please fill in this form and you will be contacted if a survey, product testing, or questionnaire opportunity that matches your profile becomes available.  \n \nPlease send to your friends as well. We do reward those who sign up their friends. \n \nDavid Robertson \nWeb Survey Asia \n show contact info \n ",
        "title": "Web Survey and Product Testing Work"
    },
    {
        "postid": "5897231995",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nretail assistant in music shop \nflexi hr part time \nno experience needed \nMust submit resume for consideration     ",
        "title": "retail assistant"
    },
    {
        "postid": "5911780150",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for Customer Service Coordinator to join our team! If you love working in a fast-paced rewarding environment, then we want to talk to you!  \nInterested candidates, kindly send your detailed CVs stating your salary expectations and availability to mgt()createtalentsandmodels.com \nJob Description &amp; Requirement: \n·  Perform administrative duties such as attending and receiving customers, answering phone calls, filing, office maintenance \n·  Handle all general office administrative functions \n·  Coordinate day-to-day staff operations and maintain records \n·  Data compilation and report generation \n·  Coordination of projects \n·  Laising clients and models \n·  Any other ad-hoc duties assigned \n·  Full-Time positions available \n·  Limitless initiative, drive and maturity \n·  Excellent Communication Skills \n·  At least a Diploma levels and above \n·  Willing to multi-task and meticulous with work \n·  Effectively bilingual \n·  Excellent spoken communication skills \n·  Dynamic personality \n·  Enjoy working with new people \nOther benefits: \n \n·  Excellent working environment. \n·  Significant career development. \n·  Wage system including basic commensurate with experience and productivity incentives. \n·  Training provided.     ",
        "title": "Create Talents Pte Ltd - Customer Service Coordinator"
    },
    {
        "postid": "5944750267",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRetail Shop Assistant wanted \nMusic Instrument Shop \nCentra Area \nFlexi hour part time \n$7/hr \nFull resume required for application     ",
        "title": "Retail Shop Assistant"
    },
    {
        "postid": "5938188820",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWork from Home. Flexible hours. Decide how much you want to earn by how much effort you put in. Please email your name and phone number and email address and we will arrange an interview. Singaporeans and PRs Residing in Singapore as interviews will be conducted in Singapore     ",
        "title": "Tution Coordinators In Singapore Wanted"
    },
    {
        "postid": "5958515116",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nADMIN CUM SALES COORDINATOR.  \n \nBUKIT MERAH \n \nBASIC BOOKKEEPING  \nFOLLOW UP WITH CLIENTS AND APPOINTMENTS  \n \nGOOD COMMUNICATION AND RELATIONSHIPS SKILLS WITH CLIENTS.  \n \nPREFER TAMIL SPEAKING  \n \nCALL 85530787  \nHELP ME SEND TO YOUR FRIENDS..THANK YOU..     ",
        "title": "Admin"
    },
    {
        "postid": "5943256377",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe Education Future Hub (TEFH) is currently looking for highly-motivated enthusiasts to join us as WSQ Diploma Course Consultant. We offer a platform to government approved courses that are subsidized under SkillsFuture Credit (SSG) for Individuals and Corporate level. We also offer a good career path for suitable candidates. At the same time, sign up and be awarded S$1,000 for completion of WSQ Diploma Course. \n \nRole: \nTo promote a Leadership Development/ People Management Diploma/ Certification Module course subsidized by WDA and SkillsFuture Credit (SSG) to Individuals and Corporate level. \nCompletion of course modules will aid Singaporeans to cope with the many changes in the years ahead, make learning and adapting \"a lifelong endeavour\". This is in line with the Singapore Government's initiative to encourage lifelong learning, increase productivity and to boost employability for employees. \nJoin our team of WSQ Leadership Course Consultants and spread the vision of cultivating lifelong learning mentality and enjoy a lucrative salary scheme. \n \nRequirements &amp; Benefits \n&#10149; Singaporeans \n&#10149; Age 21 above \n&#10149; Full-time/ Part-time/ Freelance Position \n&#10149; Attractive salary package for suitable candidates \n&#10149; Marketing/ Event experience preferred (e.g. real estate, insurance, telesales, etc.) \nThose who are highly motivated but with no Sales or Marketing experience are also welcome. \n \nEmail me if interested. Thanks!     ",
        "title": "WSQ Diploma Course Consultant (Part time/Full time)"
    },
    {
        "postid": "5904603493",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nretail shop assistant \nno experience required \n$7 /hr \nonly those who send in a CV will be considered \n \n ",
        "title": "retail shop assistant"
    },
    {
        "postid": "5949113652",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis job is strictly for the following people: \n1. NSFs \n2. Full-timers looking for a second source of income \n3. Undergraduates/schooling people who are above 18 years old \n4. Retirees \n5. Self-employed people like property agents \n \nWhat is this job about: \n1. This job is a supplement to your main source of income \n2. It is like a second source of income \n \nIf you are interested in this job, please Whatsapp me at 97859692 and state: \n1. name/age/craigslist01 \n2. valid questions. Note that I cannot answer all questions perfectly, however I will do my best.  \nThank you. \n ",
        "title": "Tuition coordinator needed"
    },
    {
        "postid": "5948961831",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nretail shop assistant for music products \npart time/flexi time \n \nonly candidate who send in CV will be considered     ",
        "title": "shop assistant"
    },
    {
        "postid": "5904833899",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI need someone to visit a hospital in Novena area, sit at the A&E; pretend to be waiting for a friend, and take a photo of someone working there. I will provide more details later on. \n \nDoesnt matter male or female, or how you look like. Anyone can walk into a A&E; and blend in as they see all kinds of patients. As long as you can do the job well and follow simple instructions.  \n \n$100 cash payment. If the photo is very clear and can see his face clearly, the payment will be bumped to $200.  \n \nI can meet you right after the job is done and when you send me the photos and delete them off your phone, I will do the transfer to you immediate at the ATM machine. So no worries of scam. \n \nGenuine offer. Nothing illegal, so no worries.     ",
        "title": "One pax required for simple task"
    }
]