[
    {
        "postid": "5917086647",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nInterior design director for Orange Hotel Group: www.orangehotel.com.cn \n \nMust be able to SPEAK Mandarin fluently.  \n \nResponsibilities:  \n \n-To meet set target and schedule by making plans for Interior Design line and ensure design works are carried out in order.  \n-Take charge of and manage design projects of different types of orange hotel in north China area.  \n-Coordinate Interior Design line and other departments and cities, ensure design works are done smoothly in quality.  \n-Take charge of performance assessment for your department.  \n-Know how to do creative design under limit budget  \n \nThe Successful Applicant:  \n \n-Interior Design or relative major required, Bachelor degree or above.  \n-Over 10 years experience in middle to large office design and management.  \n-Abundant experience in construction documentary, cost control and material setting, understand construction technology and joints well.  \n-A responsible person and communicate well, led a team before and have capability in management and coordination.  \n-Excellently creative with strong painting foundation and hand drawing ability, better from design company or design institute.  \n \nPlease send detailed resume and portfolio. \n \n \n ",
        "title": "Interior Design Director for Hotels in China"
    },
    {
        "postid": "5934154108",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSearch and apply for the latest FPSO (Floating Production Storage and Offloading) jobs on the world's largest oil and gas job search engine.  \nSign up now for FPSo jobs \nYou are just steps from finding new employment opportunities \nhttp://findfpsojobs.com/     ",
        "title": "Search and apply for the latest FPSO jobs"
    },
    {
        "postid": "5934143952",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAdvance your career in Oil and Gas. The right job for you is just a few keystrokes away You are just steps from finding new employment opportunities. Register here for free  \nhttp://findoilgasjobs.com/     ",
        "title": "Advance your career in Oil and Gas"
    }
]