[
    {
        "postid": "5936813181",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAchieve your 5Cs. Drove your dream car. Live in a beautiful home. Retire early. Pay off your debt. My company is making these dreams a reality for representative in a business with unlimited potential with no downside risk. Contact me now for more information and to set up an appointment \n•\tWhatsapp/text me at:- mobile - \n  show contact info \nor \n  show contact info \n \n•\tEmail - \n  show contact info \n    or    \n  show contact info \n \nAlso, there is an upcoming event on 11 Jan 2017 from 7:00pm-9:00pm \nLocation - less than 5 min walk from MRT station. \nI like to gift you with these very informative and useful ebooks below. Just send me an email to request and I will send them to you FREE! \n1. Ultimate Social Media Plan \n2. Tip &amp; Tricks for success for Young Entrepreneurship \n3. 55 graphics with health and fitness quotes for you to post in your social media \n ",
        "title": "Retire early, Pay off your debt, and Travel the world"
    },
    {
        "postid": "5737787916",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n#DMWF Singapore - Digital Marketing World Forum will be bringing together the worldwide marketing community for two days of thought leadership, insight and practical sessions. \n \n#DMWF Singapore will be bringing together the worldwide marketing community for two days of thought leadership, insight and practical sessions looking at the challenges the digital future presents - alongside a whole host of networking opportunities with the most dynamic marketing professionals.  \n \nThe digital and social marketing landscape is constantly evolving and we are looking to equip you with the skills and knowledge you need to address any challenges the digital marketing future presents by covering topics including;  \n \n- Forming a successful digital marketing strategy to optimise the use of your preferred channels \n- How to create dynamic, immersive content as part of your content marketing strategy \n- E-Commerce initiatives to build future growth \n- Actionable SEO techniques to increase traffic and build your customer base \n- How to leverage influencer relationships \n- The use of social media within your existing digital marketing strategy \n- Effective data driven marketing for personalisation and targeting \n \nEarly Bird pricing available until January 16th - save £200.  \n \n \nOn Monday February 13, 2017 at  8:00 am (ends Tuesday February 14, 2017 at  6:00 pm) \n \nCategory: Conferences - Business &amp; Economics - Marketing &amp; Sales \n \nPrice: \n \nTwo Day Pass (standard): GBP 599 \nOne Day Pass (standard): GBP 349 \n \nVenue: Marina Bay Sands, 10 Bayfront Ave, Singapore \n \nLinks:  \n \nWebsite:  https://go.evvnt.com/64830-0  \nTickets:  https://go.evvnt.com/64830-1  \nTwitter:  https://go.evvnt.com/64830-2   ",
        "title": "#DMWF Singapore - Digital Marketing World Forum"
    },
    {
        "postid": "5934667140",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you or your loved ones facing difficulty in your life \n- Physically, Spiritually or Financially? \n \nDo you need help in overcoming your emotional distress? \n- anger, anxiety, depression, grief &amp; loss, guilt &amp; shame \n- loneliness, sexuality, envy &amp; jealousy, and stress \n \nWe invite you to come and attend our  \nMiracle Healing Service every Tuesday at 7:30pm  \n \nVenue: 76 Playfair Road #08-04 LHK2 Building \n(Lift lobby 2) Singapore 367996.  \nNear to Tai Seng (circle line) Mrt Station \n \nIt's Free! All are invited regardless of your faith or religion. \n \nYou can be Blessed by God with just your Mustard Seed Faith \n- physically, spiritually, emotionally and even financially. \n \nNothing is too hard for the Lord! (Genesis 18:14) \nEverything is possible for him who believes (Mark 9:23) \n \nFor testimonials or information,  \nVisit website:  http://www.TheLivingStones.org  \n \nOr get your eBook on Divine Healing Success now  \nAt  http://www.DivineHealingSuccess.com  \n ",
        "title": "Miracle Healing Service"
    },
    {
        "postid": "5868274821",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Extra cash needed in Singapore?"
    },
    {
        "postid": "5890195873",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Extra cash needed in Singapore?"
    },
    {
        "postid": "5947591030",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWellaholic Carnival 2017 (Sat, 14 Jan, 11am to 6pm) \n \nStart your 2017 right! Let Wellaholic help you jump-start your New Year resolutions with our Health, Fitness and Beauty Carnival. \n \nBEAUTY \n&gt; Enjoy a FREE E-Light Facial (worth $80) if you are a first-timer. Book your slot via \"Book Treatment\" at www.wellaholic.com \n \nFITNESS  \n&gt; Join our KpopX® and NirvanaFitness® classes. Confirm your slots via \"Book Class/Event\" at www.wellaholic.com  \n&gt; KpopX®  https://www.facebook.com/events/1361280067236412/  \n&gt; NirvanaFitness®  https://www.facebook.com/events/1808070242744062/  \n \nHEALTH \n&gt; Attend our talks on \"Understanding Supplements and Body\" and \"Live Well, Eat Well\". \nAlso, for $100 spent on any Wellaholic products, services or packages during the Carnival, you get to enjoy a Sure Win Lucky Spin. Stand to receive the top prize of 1 Year Unlimited E-Light Treatment (valued at $3800). \n \n \n# A confirmation fee of $5 is required for all fitness and health events. In return, you get a $10 gift certificate upon your attendance! \n## Facial, Classes, Products and Lucky Draw prizes are valid while stocks lasts     ",
        "title": "Wellaholic Carnival 2017 (Sat, 14 Jan, 11am to 6pm)"
    },
    {
        "postid": "5824627274",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFinancial assistance for Singaporeans and PR only \n \nWe have an easy way to get you extra money to spend or to settle your debts ! \n \nNeed cash to pay off bills ? \nNeed cash to tide up for the month ? \nNeed cash urgently to settle your personal needs ? \nNeed ready cash to solve your financial status ? \nBut turned down by the bank, your relatives and friends? \n \nNo problem. \n \nWe provide totally LEGAL ways to help you get more money to spend or  \nto settle your outstanding debts.  \n \nMany people are already benefiting from this! \nThe solution to your problem. \n \nCall 9392 6324 NOW  \nto see if you are eligible ! \n \nOnly Singaporeans and PRs may apply \nAge 24 and above.     ",
        "title": "Want some quick and legal cash urgently?"
    },
    {
        "postid": "5868281254",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Singaporeans needing cash right now?"
    },
    {
        "postid": "5835664179",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nNeed some spare quick cash to offset outstanding bills? \n \nOr you may need cash to clear loans with banks and moneylenders ? \n \nTroubled by your weekly payments or installments? \nNeed to avoid late payments ? \n \nNo where to turn to? \nNeed ready cash to solve your financial status ? \nBut turned down by the bank, your relatives and friends? \n \nNo problem. \n \nWe have totally LEGAL ways to help you get more money to spend or  \nto settle your outstanding bills/debts.  \n \nMany people are already benefiting from this! \nWe are just a phone call away. \n \nCall Today @ 939 26324 NOW  \nto see if you can apply !     ",
        "title": "Need money to clear debt urgently?"
    },
    {
        "postid": "5860431593",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nASVAC 2017 is the regional platform where all stakeholders and advocates for wider immunization coverage gather to find comprehensive solutions for the for the introduction of new vaccines. \n \nThe 6th Asian Vaccine Conference (ASVAC 2017), to take place in Singapore on 27-29 April 2017, is the regional platform where all stakeholders and advocates for wider immunization coverage gather to find comprehensive solutions for the introduction of new vaccines and programmes to eradicate illness, including: \n \nPublic and Private Donors &amp; Health Organisations \nVaccine Manufacturers, National Immunization Programme Managers &amp; Government Policymakers \nSenior-Level Pediatricians, Infectious Disease &amp; Tropical Medicine Specialists \nTogether, we will work with Immunization Partners of Asia Pacific (IPAP) to realise the conference theme of '#YOLO: Let #VaccinesProtect You', sharing our knowledge, experience and strategies for the cost-effective introduction of new vaccines. \n \nHigh on the agenda for new vaccine introduction at the conference will be such crucial topics as: \n \nJustification, goals and objectives, and anticipated impact on the immunization programme and health system \nSpecific target populations, phased vs. nationwide introduction, and delivery strategies \nCoordination mechanisms and key partnerships \nOpportunities, key issues and weaknesses to be addressed \nMajor activities - expanding health worker capacity, reaching the hard-to-reach, improving cold chain and logistics systems \n \nOur shared belief that a healthy life is a basic human right drew hundreds of the best and brightest to previous conferences, and we expect the turnout at ASVAC 2017 to be even more impressive in terms of numbers and results. \n \nOn Thursday April 27, 2017 at  9:00 am (ends Saturday April 29, 2017 at  5:00 pm) \n \nCategory: Conferences - Science, Health &amp; Medicine \n \nPrice: \n \nplease refer to website : USD 0 \n \nVenue: Concorde Hotel, Singapore, 100 Orchard Rd, Singapore, 238840 \n \nLinks:  \n \nWebsite:  https://go.evvnt.com/73513-0   ",
        "title": "WELCOME TO SINGAPORE AND ASVAC 2017 The 6th Asian Vaccine Conference"
    },
    {
        "postid": "5715649226",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe goal of the conference is to bring together active researchers from the various disciplines to showcase their state-of-the-art research results and hopefully to forge new cross-disciplinary interactions among the participants. The conference provides a unique opportunity for in-depth technical discussions and exchange of ideas in mathematical and computational sciences, as well as explores the potential of their applications in natural and social sciences, engineering and technology and industry and finance. \n \nUrl: \nInquiries:  https://go.evvnt.com/50110-0  \n \nPrices: \nEarly bird registration: USD 850 \nLate registration: USD 1100 \n \nCategory: Other \n \nVenue Details: Hotel Fort Canning, 11 Canning Walk, Singapore, 178881, Singapore \n \nDate and Time: On Monday January 16, 2017 at 5:00 pm (ends Wednesday January 18, 2017 at 2:00 am)     ",
        "title": "6th Annual International Conference on Computational Mathematics"
    },
    {
        "postid": "5919827273",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDear Friends, \nHave you ever stopped to dream about how great it would be to enjoy wealth and financial security?  Of course you have, we all have!  Getting from the dreaming part to the real life enjoying part is hard, though, or at least it used to seem hard.  I'm excited to share with you a proven opportunity which make use of the 5 latest trends, which are; Social Media, Online Shopping, Technology or Internet Automation, Working from Home and Anti-Aging Or Wellness Industry.  \nIt's simple.  The path to wealth is made easier when you get into these 5 trends. If you are not into these and getting same outcome of not getting nearer to your dream of wealth and financial security, don't spend another minute of your valuable time doing what you're already doing. Because you're simply going to keep getting the same results over and over again.  Instead, with a bit of time and effort to understand what I am offering you here, can get you excited and optimistic to work on your financial dream.  \nIt's okay if you doubt what I am saying, because I had my doubts the first time I heard about this opportunity myself. But once I understand these trends and the company, science and financial opportunity behind it, I am confidence.  \nStop worrying about how to pay your bills and start living your life of wealth and financial security.  Find out everything you need to know by visiting this website: \n•\t https://elegantforhealth.jeunesseglobal.com/  \n•\t http://graceforhealth.jeunesseglobal.com/  \nFurther by clicking the links below; you can sign up straight away with your dedicate website to begin immediately \n•\t https://joffice.jeunesseglobal.com/signup.asp?locale=en-SG&siteurl;=elegantforhealth  \n•\t https://joffice.jeunesseglobal.com/signup.asp?locale=en-SG&siteurl;=graceforhealth  \nP.S.  Stop worrying about paying your bills each month!!  Click above to get started. \nYou can also contact us to meet on a 1-to-1 sessions.  \nWe have weekly ongoing events to personalise and meeting your own goal and need.  \nWhatsapp/text me at:- mobile - \n  show contact info \nor \n  show contact info \nor  \nemail - \n  show contact info \n    or    \n  show contact info \n \n ",
        "title": "Would you believe it? Getting these 5 .."
    },
    {
        "postid": "5943269047",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCREATIVE DESIGN, COOL APPEARANCE. A 0.86\" OLED display screen with 96x32 pixels allows you to check time, date, steps, calories, walking distance anytime. \nDYNAMIC HEART RATE MONITORING: While a Static Heart Rate Monitor can record every beating when you stay in relative calm such as working, sleeping and living, the H09 with Dynamic Heart Rate Monitor still could record extreme HR change accurately when you fall in love or in fitness routine such as gym work, athletics. \nWATERPROOF IP67: take it to swim, but not in the sea, not for diving. \nALL DAY TRACKING: step counting, distance tracking, calorie tracker, Sleep monitor, alarm clock and etc.; Incoming call notice, remote camera, lost warning, out of range alarm. Compatible with Bluetooth 4.0 Android 4.3 or later smartphones, and IOS 7.1 or later iPhone smartphones, such us Samsung Galaxy S5/S4/ S3/ Note 4/3; LG G2/3, HTC one; IOS 7.0 or Above/Apple iPhone(iPhone 6(4.7)/6 Plus (5.5)/ 5s/ 5c/4s/4), etc. \nThe product would calculate the data when your arms or legs move even though you did not walk or do sports, so the step counting and calorie data is not 100% exact sometimes; Please keep the APP open so that it can sync with the bracelet or the BT will be disconnected; The charging slot is on the device, please take off the bracelet when charging it. If you want then visit the link:  http://ithealthfitness.com/innkoo-h09-waterproof-wristband-fitness-tracker.dit  \n ",
        "title": "InnKoo H09 Waterproof Wristband Fitness Tracker"
    },
    {
        "postid": "5868027217",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Need financial help in Singapore?"
    },
    {
        "postid": "5848181276",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSmart Manufacturing Asia 2017 conference is going to feature 3 full day tracks dedicated to Industry 4.0, Automation and Additive Manufacturing technologies. \n \nMore than 30 speakers will present most updated technology highlights, ROI Case studies and integration best practices. \n \nAttend to Learn About \n1. Overcoming Integration Challenges of Industry 4.0 in Running Factories \n2. New Asset Monitoring and Predictive Maintenance Techniques \n3. Changing Supply Chain, Inventorying and Logistics in Manufacturing \n4. AR and VR in Manufacturing Simulation \n5. M2M and Artificial Intelligence for Improved Productivity \n6. Additive Manufacturing in Oil &amp; Gas, Offshore &amp; Marine Manufacturing Industries \n \nOn Tuesday April 4, 2017 at  4:00 pm (ends Friday April 7, 2017 at  2:00 am) \n \nCategory: Conferences - Engineering &amp; Technology - Manufacturing \n \nPrice: \n \n3-Day Conference Pass (Overseas Delegate): SGD 900 \n3-Day Conference Pass (Singapore Delegate): SGD 963 \n \nVenue: Singapore Expo, 1 Expo Drive, Singapore, 486150 \n \nLinks:  \n \nWebsite:  https://go.evvnt.com/72519-0   ",
        "title": "Smart Manufacturing Asia 2017"
    },
    {
        "postid": "5914536069",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDate/Time \nDate(s) - 25/02/2017 \n4:00 pm - 10:00 pm \n \nLocation: The Blue Lotus \n \nCategories: workshop \n \nDo you feel lost when it comes to love, sex and relationships? \n \nDo you wonder why you keep making the same mistakes when it comes to your relationships? \n \nDo you want heard from real people who are willing to be vulnerable and share everything they know with you? \n \nThere is so much secrecy and shame when it comes to love, sex and relationship. We do not want to admit our insecurities, fears and failings, insecurities for fear of being judged, misunderstood, or worse, not be able to pick ourselves up afterwards. \n \nIn this curated event by Clinical Sexologist Dr. Martha Tara Lee of Eros Coaching and author of the book Love, Sex and Everything In-Between, Martha brings together real people who will be baring all for your benefit. Shorten your learning curve, and suffer not in silence -- or better yet, no more -- when it comes to matters of your heart! \n \nI Love You Key Shows Loving Or Romance  \nDating in modern times aren't quite the same anymore! We now have apps from Tinder, OkC, Bumble, and the like! Does dating feel like treading on eggshells at times? What should, could or must one do when it comes to dating? Is it still possible to find your one true love? \n \nIn this panel, we have three brave souls who are rooting for love, sharing their dating experiences and misadventures, and dishing their advice. Ask your pressing questions, and let's get answers. \n \nDate: Sat 25 Feb 2017 \n \nTime: 4:00 -- 6:30p.m. \n \nPanel 2 \nNobody ever told me that I need to put work into my relationship! As work pressures, infidelity and divorce rates increase, we have unhappy people. The cost of divorce and relationship break-ups can be costly, not to mention, traumatic. Are we meant to stay together? \n \nWhat happens after happily ever after? What happens to relationship when the Honeymoon phase is over? How do modern-day couples keep love, romance and passion going, if at all? Our panel will be sharing their stories, lessons and advice. \n \nTime: 7:30 -- 10p.m. \n \nFood: Inclusive of dinner for all attendees \n \nVenue: The Blue Lotus. 39 Tembeling Road, Singapore 423582 \n \nDirections: Bus 33. If coming by cab (advisable), you may wish to tell the cab driver that it is a shophouse, diagionally opposite Kuam Im Tng Temple, and at the cross-junction of Joo Chiat Place. \n \nI'm in! I am signing up for both panels! S$88 per person.     ",
        "title": "A Belated V-Day Special: Navigating Love, Sex and Relationships"
    },
    {
        "postid": "5953339756",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAnirudh Live Concert In Singapore \nLowest in town 5% + discount kindly WhatsApp for tickets +6581683552 cash,account transfer , online instructions will be given through WhatsApp \n ",
        "title": "Anirudh Live Concert In Singapore"
    },
    {
        "postid": "5941757884",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCome celebrate the Year of the Rooster with your family at PlayLAH! Let's Celebrate Chinese New Year 2017, and indulge in a festivity of fun with a line-up of activities that everybody can participate in. \n \nOrganised by SingEx, PlayLAH! promises to be a carnival for the senses, where children of all ages can shout their favourite seasonal greeting as they slide down a thrilling 9 metre-high rooster slide or challenge themselves as they make their way through an 18-metre long bouncy obstacle course. There will be daily live performances on stage as well, which will introduce traditional performance arts such as Nanyin and Chinese dance to a whole new generation of Singaporeans. \n \nVisitors will also have the opportunity to learn more about the holiday, its traditions and customs, and discover how Chinese New Year is celebrated differently by people from different dialect groups. And if that is not their cup of tea, they may be interested in learning how to fly a drone or even create their very own 3D hologram! \n \nDesigned with the family in mind, PlayLAH! Let's Celebrate Chinese New Year 2017 will have workshops that both parent and child can participate in, working hand in hand to create their very own zodiac ang pows and bookmarks, or even a coin bank to store all their any pow money.  \n \nWith so much to see and do, you will be guaranteed a fun-filled day of excitement for the whole family. Admission to PlayLAH! Let's Celebrate Chinese New Year 2017 is free, and members of the public are encouraged to pre-register their attendance at www.playlah.sg to receive S$5 worth of credits for use at the event. \n ",
        "title": "PlayLAH! Let's Celebrate Chinese New Year 2017"
    },
    {
        "postid": "5869451409",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFinancial assistance for Singaporeans and PR only \n \nWe have an easy way to get you extra money to spend or to settle your debts ! \n \nNeed cash to pay off bills ? \nNeed cash to tide up for the month ? \nNeed cash urgently to settle your personal needs ? \nNeed ready cash to solve your financial status ? \nBut turned down by the bank, your relatives and friends? \n \nNo problem. \n \nWe provide totally LEGAL ways to help you get more money to spend or  \nto settle your outstanding debts.  \n \nMany people are already benefiting from this! \nThe solution to your problem. \n \nCall 9392 6324 NOW  \nto see if you are eligible ! \n \nOnly Singaporeans and PRs may apply \nAge 24 and above.     ",
        "title": "Want some quick and legal cash urgently?"
    },
    {
        "postid": "5753963810",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDatacloud Asia 2017 is the premier conference for data centre and cloud players to network, meet industry leaders and do deals. \n \nDatacloud Asia and a new annual Awards ceremony will take place in Singapore 20 February 2017 \n \nWith a powerful agenda covering cloud challenges and data center infrastructure it attracts investors, financiers, business leaders and their customers who use this annual meeting in the stunning backdrop set above the South China Sea to do deals that influence outcomes for the next 12 months and beyond. \n \nAsia's premier networking and business deal making forum for data center and cloud \n50+ Expert Speaker Academy providing an Enterprise driven programme with the latest Cloud and Data Center hot topics.  \n \nNew research findings by BroadGroup \nPrivate networking events \nFirst ever Datacloud Awards dinner and ceremony \nOutstanding Asia and international networking opportunity \nSupported by industry exhibition \nData Center tours in Singapore and regionally. \n \nOn Thursday February 23, 2017 at  9:00 am (ends  7:00 pm) \n \nCategory: Conferences - Engineering &amp; Technology - Technology \n \nPrice: \n \nEarly Bird Gold Level Ticket : USD 500 \n \nVenue: Capella Hotel, 1 The Knolls, Sentosa Island, Singapore, 098297 \n \nLinks:  \n \nInquiries:  https://go.evvnt.com/65231-1  \nWebsite:  https://go.evvnt.com/65231-2  \nYouTube:  https://go.evvnt.com/65231-3  \nTwitter:  https://go.evvnt.com/65231-4  \nBooking:  https://go.evvnt.com/65231-5   ",
        "title": "Datacloud Asia 2017"
    },
    {
        "postid": "5868028684",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Extra cash needed in Singapore?"
    },
    {
        "postid": "5933993858",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAs a responsible person who support yourself and loved ones, you want to be able to continue to provide the finance and support needed. To ensure that, you need to have relevant skills and capability and health too.  This is a pressure on you if one day you cannot do that. So, today, you must get prepare, to find a way to continue to have income and stay healthy.  \nWhat if I showed you how to do both? What if I told you it worked? What if I gave you a guarantee it will work for you? \n \nPlease attend an event on 11 Jan 2016 from 7:00pm-9:30pm  \nLocation is just less than 5 min walk from MRT station \n \nAnd contact me to find out more:- \n•\tWhatsapp/text me at:- mobile - \n  show contact info \nor \n  show contact info \nor  \n•\tEmail - \n  show contact info \n    or    \n  show contact info \n \n \nWhy not take advantage of this opportunity right now? I'll provide you a system with all the material, information &amp; supports for you to be successful. It is an absolutely free and proven system. Take up this chance right away, you really have nothing to lose and a great deal to gain.  \nP.S.  You can enjoy the wealth and comfort you deserve. It's just waiting for you to take action. Act now! \nI like to gift you with these very informative and useful ebooks below. Just send me an email to request and I will send them to you FREE! \n1. Ultimate Social Media Plan \n2. How to Sell Anything to Anyone \n3. Tip &amp; Tricks for success for Young Entrepreneurship \n ",
        "title": "More income and stay healthy, It's Free and Cost you nothing"
    },
    {
        "postid": "5869462128",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFinancial assistance for Singaporeans and PR only \n \nWe have an easy way to get you extra money to spend or to settle your debts ! \n \nNeed cash to pay off bills ? \nNeed cash to tide up for the month ? \nNeed cash urgently to settle your personal needs ? \nNeed ready cash to solve your financial status ? \nBut turned down by the bank, your relatives and friends? \n \nNo problem. \n \nWe provide totally LEGAL ways to help you get more money to spend or  \nto settle your outstanding debts.  \n \nMany people are already benefiting from this! \nThe solution to your problem. \n \nCall 9392 6324 NOW  \nto see if you are eligible ! \n \nOnly Singaporeans and PRs may apply \nAge 24 and above.     ",
        "title": "Do you need urgent cash today?"
    },
    {
        "postid": "5841836017",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSG-ANZICS 2017 will focus on improving Intensive Care Medicine in developing Asia-Pacific countries.  \n \nThe 4th SG-ANZICS Intensive Care Forum (SG-ANZICS 2017) will be held from 20-24 April 2017 at the Suntec Singapore Convention &amp; Exhibition Centre. In this edition, we are focused on improving Intensive Care Medicine in developing Asia-Pacific countries. We will be introducing special concessionary pricing and hope to raise funds for sponsorship of participants from these countries. \n \nSG-ANZICS 2017 will offer a comprehensive programme of plenary lectures, breakfast and lunch symposia, pre-conference workshops, poster presentations and exhibitions from leading suppliers. Learn the latest and greatest developments in the field from top notch speakers and catch up with friends and colleagues at the many social events on offer.  \n \nMark your calendar and come together in Singapore in April 2017. \n \n \nOn Thursday April 20, 2017 at  9:00 am (ends Monday April 24, 2017 at  5:00 pm) \n \nCategory: Conferences - Science, Health &amp; Medicine \n \nPrice: \n \nPlease refer to  http://sg-anzics.com/registration/registration/:  SGD 0 \n \nVenue: Suntec Singapore Convention &amp; Exhibition Centre, 1 Raffles Boulevard, Suntec City, Singapore, 039593 \n \nLinks:  \n \nWebsite:  https://go.evvnt.com/60641-0   ",
        "title": "The 4th SG-ANZICS Intensive Care (SG-AZNICS 2017)"
    },
    {
        "postid": "5869495601",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt's time to clear your debts or get some extra money easily. \n \nFinally there's a better way. \nOur solution to your problem ! \n \nDon't you wish financial problems can be solved in an hour ? \nTired to be rejected due to poor credit? \nBelieve it or not, we approve bad credit in an hour. \nSay 'YES' to offset your bills today and call us. \n \nImagine solving your problem within an hour? \n \nWe're ready to prove everything we claim. \nSimply call to ask and believe. \nDon't just take our word for it, find out yourself ! \n \nReserve your appointment NOW !  \nLimited appointments per day. \n \nCALL US TO HELP YOU ! \n \nFor immediate enquires, CALL US @ *939 26 324.     ",
        "title": "Want some quick and legal cash urgently?"
    },
    {
        "postid": "5850232497",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOur 2017 Asia-Pacific Oil &amp; Gas Assembly will be our largest event ever in Asia. It is recognised as Asia's most influential corporate development, strategy, finance and investment gathering. \n \nWe are now confirming speakers, sponsors and exhibitors. If you working in Asian-Pacific's upstream, midstream/LNG, downstream, offshore, energy trading, finance, investment or petroleum services sectors, or looking to access the Asian-Pacific marketplace, this Assembly is a must attend event for thought leadership, business development, financing, market intelligence and CEO-level networking. Please contact us today if you are interested in speaking, sponsoring, exhibiting and/or attending. \n \nPricing for a 2 day pass begins at 3,000 (SGD$).  \n \n1,000 executives will meet, identify and discuss (i) new corporate development opportunities in Asia-Pacific and internationally, (ii) new investment opportunities across the Asian-Pacific energy landscape, (iii) deal flow and capital emanating to and from the region, (iv) effective management strategies and practices and (v) how to access Asia-Pacific's capital markets and active investment community. We will reflect on all that has happened in 2016 as our industry recovers, strengthens and in time grows once more. We look forward to speaking with you and securing your involvement at this leading Asia oil conference. \n \nOn Wednesday January 18, 2017 at  8:00 am (ends Thursday January 19, 2017 at  5:00 pm) \n \nCategory: Conferences - Energy &amp; Environment - Oil &amp; Gas \n \nPrice: \n \nEarly Bird before 30 Nov 2016: SGD 3395 \nStandard: SGD 3995 \n \nVenue: Raffles City Convention Centre, Singapore, 80 Bras Basah Road, Singapore, 189560 \n \nLinks:  \n \nWebsite:  https://go.evvnt.com/72682-1   ",
        "title": "2017 Asia Pacific Assembly &amp; Dinner"
    },
    {
        "postid": "5917284088",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDiscover the Proven Road to 1 million \n \nWould you like to have a bright and rich future? If so, is it a high paying job or your own business? Or how much wealth would you like to have for a rich future?  \n \nOf course you'd like to have a bright and rich future and you certainly want to have the kind of wealth that allows you to live a lifestyle of comfort and leisure. But if you're like the vast majority of people you've never quite made it past dreaming, wishing, and hoping for this kind of bright future and wealth to arrive. So, do not be like the vast majority, you are better than them. \n \nEverybody wants to fill their bank accounts with cash, but wanting this to happen and actually making this happen are two entirely different things. I'm here to tell you that there is no short cut to a bright and rich future but there definitely real opportunities available.  \n \nCome to attend \"The Proven Road to 1 million\". It guarantees to work! This is no scam and it is real. If you get into the most profitable sectors and harness on the trends, your success is greater and I will show you how to get into them. \n \nNothing for you to lose if this is not suitable for you.  \nIf this works for you, this will transform your dreams of a bright and rich future into actual reality.  \n \nLet's get started! It's just a quick click away, text/ WhatsApp's me for confirmation at \nMobile - 97927309 \nEmail: \n  show contact info \n \n \nEvent Details: \n \nEvent: The Proven Road to $1 Million \nDate: 11 Jan 2017 \nTime: 7:00 - 9:00pm \nLocation: Junction 10 Mall \nNearest MRT is Bukit Panjang MRT (DT1) \nLess than 5 min walk to Junction 10 Mall \n ",
        "title": "Discover the Proven Road to 1 Million"
    }
]