[
    {
        "postid": "5951087606",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for qualified nurses to work at the Medical Facilities in the State of Florida. NCLEX REQUIRED. \nApply on line : www.milleniahealthservices.com  \nSubmit all requirements to qualify to work in the USA.     ",
        "title": "FILIPINO NURSES WANTED"
    },
    {
        "postid": "5955774057",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDo you have time to develop these aspects in your life -- HEALTH, FAMILY, TIME &amp; FINANCIAL FREEDOM? \nDo you have a burning desire to achieve what you really want in your life? \nBe sincere, be committed, have a caring &amp; sharing heart and strong belief in yourself and you can do it with the proven business opportunity! \nUnderstanding the business + Philosophy &amp; principles founded + Commitment is the Key to YOUR Success with guidance! \nText/ WhatsApp's -- 97927309 or 93976700 \nEmail: \n  show contact info \n \nEvent: The Proven Road to $1 Million -- Ready to take charge your life? \nDate: 22 Feb 2017 Time: 8:00 - 9:15pm \nLocation: TBA  Less than 5 min walk from MRT station \nStop worrying about how to pay your bills and start living your life. Check out the below website: \n•\thttps://elegantforhealth.jeunesseglobal.com/ \n•\thttp://graceforhealth.jeunesseglobal.com/ \nFurther, you can sign up straight away with your dedicate website to begin immediately \n•\thttps://joffice.jeunesseglobal.com/signup.asp?locale=en-SG&amp;siteurl=elegantforhealth \n•\thttps://joffice.jeunesseglobal.com/signup.asp?locale=en-SG&amp;siteurl=graceforhealth \nP.S.  Stop worrying about paying your bills each month!!  Click above to get started. \nYou can also contact us to meet on a 1-to-1 session.  \n ",
        "title": "Live &amp; Lead Your Life with Pride to Retire early, Pay off debt, and Mo"
    },
    {
        "postid": "5930748487",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello: \n \nWe are currently recruiting a Nurse Practitioner to join a dynamic team in Guam! New grads are welcome! .This position Modern state-of-the-art with attached acute care facility will give applicant a challenge to use all her/his skills and learn at same time to evaluate and treat chronically and acutely ill patients. Extensive training in oncological diseases and modern therapies will be given on job and oncologist always available to discuss problems. A very fulfilling position for the right person. Position offers a competitive salary with full benefit package Guam is a US Territory in the Pacific close to Asia giving a great opportunity to visit all Asian cities. Climate is tropical so throw away winter clothes except for skiing in northern Japan. Please forward an updated resume for immediate consideration and additional information.  \nThank you! \n \n ",
        "title": "Nurse Practitioner"
    },
    {
        "postid": "5916992805",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you working averagely 50 hours a week? \n \nYou work for enough income to get by in life and maybe make a difference in the lives of others. Are you trading your time for money? This is termed as Linear Income or Work Income (there is nothing wrong with that, many people are on this income). You receive a paycheck based on how much work or time you put in.  Linear Income requires continued work. When you stop working, your income stops. \n \nLet me introduce you Passive or Residual Income. This is a better option; the income of the rich.  It is the most powerful and profitable source of income that keeps coming in on a regular basis, from the result of the work you did in the beginning -- meaning even when you are not working. \n \nResidual Income is not about \"get rich quick\" -- the concept very much misunderstood by many people. It requires effort, determination, especially in the beginning but your life will change. . . \"Right now, you can take advantage of the internet to create wealth by having your own e-Commerce business right away.\" \n \nOn 28 Oct, an exclusive meet and greet with President of Asia Pacific, Middle East &amp; Africa had been conducted at the Ballroom JW Marriott Hotel in New Delhi India. It was an overwhelming and excitement event that raised much anticipation about the upcoming launch of the India market. The 1st ever new launch to India market is scheduled on February 2016. More updates and news will be releasing following a planned and appropriate timeline. Stay-tuned.  \n \nIndia Market is going to launch real soon! We are looking for right business partner to expand the business tapping on the 1st mover advantage of new launch vast market in India and expand together globally. \n \nIf you are keen and open to new ideas, friendship, and possibly business partnership, whatsapp me at:- mobile - \n  show contact info \nor email - \n  show contact info \n ",
        "title": "Regional E-commerce Business Distributor"
    },
    {
        "postid": "5920051196",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIf you're a healthcare Professional (Nutritionists/Doctors/Nurses/Dietitian) \n \nLooking for a complementary option that can help your patients, families members, friends or even yourself achieved good health and long term financial independent in this complex and merciless market, build your future through handwork and a revolutionary business concept and achieved a reality that feels &amp; looks like a dream. \n \nOpen minded individuals willing to commit some hours per week to explore as a parter, drop a note of interest to the email address.     ",
        "title": "Healthcare Professionals/Nutritionists"
    }
]