[
    {
        "postid": "5947594983",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nREGISTRATION OPENED FOR 2017 YISHUN PRI - SEC TUITION CLASSES \n \n The Learning Verve Knowledge Hub \n \nPre School, Primary &amp; Sec tuition @Yishun \nthelearningverve.blogspot.com.sg \nthelearningverve.weebly.com \n 9379 4744 \n \n \n \nACE YOUR EXAMS AND SEE IMPROVEMENTS!!! \nOurs students have benefited from our classes. So why wait? \n \n \n \n 9 REASONS WHY YOU SHOULD CHOOSE US \n \n \n \n 1. Our commited and caring tutors are diploma - degree holders. We have Ex NIE teachers and Full Time Tutors with proven track records. With classroom teaching experience in government schools, education centres, language schools, community clubs and one to one classes. \n \n  We hope to impart exam learning and solving technique to our students.We are more than just tutors. We mentor our students. We understand each child is unique and learn at different pace and with different style.  \n \n \n \n  2. Reasonable fees. We understand that parents want to maximize their investment on their children's education. Hence, our fees are competitive yet reasonable.  \n \n \n \n  3. A small class size and teacher : student ratio allows tutor to devote more attention and time to each student and group ensuring optimum performance.  \n \n \n \n  4. Regular update to parents via tutor and parents meeting session and sms broadcast. We believe in a clear line of communication with parents. Our customers are the most important people. \n \n \n \n 5. There will be tuition tests in Feb, Apr, Aug and Oct. This allows us to effectively evaluate student's strengths / weaknesses and to work on them.This also allows students to put into practice what has been taught and \"warm up\" for coming exams. A feedback report will be issued.We also conduct FREE MOTIVATIONAL WORKSHOPS FOR ALL OUR STUDENTS TO BUILD THEIR SELF ESTEEM AND SET GOALS.  \n \n \n \n 6. We have 4 systematic and successsful approaches termed the:-\" clockwork apporoach\"\"carrot apporach\"\"story telling approach \" Goal setting approach\" which have benefited our students. Fast and easy technique to tackle exam questions are taught. All while adhering to MOE syllabus.  \n \n \n \n  7. We provide challenging in - house worksheet materials prepared by our experienced tutors which mirrors exam based questions to supplement our use of popular assessment books. \n \n \n \n \n 8. Our parents and students have given us favourable testimonials and the \"thumbs up\". Our student's 2013 and 2014 results and achievements have been very encouraging and a success. They also pick up other intangible skills during our lessons such as being responsible and being discipline. \n \n \n 9. We believe in ' SCR\"- sincerity, commitment and being responsible     ",
        "title": "SCORE A. YISHUN TUITION. EXCELLENT PSLE PASS RECORD. 12 YEARS EXP"
    },
    {
        "postid": "5947495060",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGet free credit and study Korean!! \nwww.tutor-k.com  \n \n (Event1) 10 FREE Koins  \n Refer friends and family! Once they sign up, you will receive 10 Koins for each person. \n They must enter your user ID in the self-introduction box when signing up. \n \n (Event2) 100 FREE Koins  \n Tutor-K is giving away 100 FREE Koins to all new members who complete his or her first lesson.  \n Good news is your first lesson can be one of our free trial lessons ;) \n You will receive 100 Koins after completing a lesson AND leaving a comment about your tutor. \n Once you recieve the 100Koins, you can use them to take any lessons on Tutor-K.  \n Koins remaining after Jan.31, 2017 will disappear automatically, so don't forget to use them all! \n \n (Event3) 1000 FREE Koins  \n Tutor-K will give 1,000 Koins to a member who takes the most lessons this month. To be considered, you must \"complete\" each session (30min.). You can do this by going to My Session and clicking on Session Evaluation. There, you will see small Evaluation buttons next to all the lessons you've finished. Please click on them to rate your tutors and leave comments. (Each session has to be evaluated in order to be considered \"complete\")  \n \n Please note that free trials are not counted toward total number of 30min. sessions for winning the 1,000 Koin prize. \n \n \n Thank you for your interests in Tutor-K this year.  \n We are committed to continue offering the best online learning experience to our valued members. \n \n www.tutor-k.com \n \n ",
        "title": "Get free credit and study Korean!!"
    },
    {
        "postid": "5954353241",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAreas of service: \n Bedok,  Geylang,  Kallang,  Marine Parade,  Paya Lebar,  Tampines,  Toa Payoh \n \nPreferred Subjects: \n    English Second Language for all ages \n    English Language Arts (for both second and first language) for all years/grades \n    Math for years 1-8* \n    Science for years 1-8* \n \nYou'll get exceptional service if you hire me for these subjects. \n \nI am energetic and excited about learning. I truly believe that everything is interesting and everyone is capable of learning. I will listen to you deeply about your struggles and/or goals.  \n \nThe first session with me is always fully refundable if we decide it's not a good fit. \n \nContact:  \nPlease call/SMS me at +\n  show contact info \nor email \n  show contact info \n to arrange an initial session. \n \n* If you'd like to learn more about me as an educator, please visit marjorielafrance.com \n \nEducation: \nI graduated from my provincial university in Canada with two Bachelors degrees: \nBachelor of Arts: double major in English and French with a minor in History \nBachelor of Education: focus on Elementary and Middle levels (that means from Year 1 to Year 9)  \n\tI have attended numerous professional development courses since graduating to help keep my teaching relevant. Everything from how to help kids focus to how to apply sign language techniques when learning new languages! \n \nExperience: \nI have been working in Education since graduating in 2010, from private tutoring in Canada to teaching in England. Teaching is my calling and what I love most! My most recent job experience was working at an all-girls charter school in Alberta, Canada, where I taught for four amazing years. \n \nAbout me: \nI love sports, music, reading and nature. You can often find me on the volleyball court, singing in a choir, reading a novel, or trying out a new experience just for fun! I have recently moved to Singapore after travelling for four months around Canada, then visiting Hong Kong, Malaysia, Thailand, Laos, Cambodia and Vietnam.     ",
        "title": "Primary Math and Science tutor available - 5 years teaching experience"
    },
    {
        "postid": "5955554498",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello, my name is Yejie and I  am a Singaporean. I have experience teaching French to secondary school students who study French as a third language. If you child is keen to study French, contact me today.     ",
        "title": "Singaporean tutor offering secondary school level French lessons"
    },
    {
        "postid": "5946361893",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nNi hao! My name is Sara Zhao, and I am originally from China. I have passed my O Levels and I am a part-time Mandarin Language tutor in Singapore. My rates are SGD40 per hour.     ",
        "title": "Part-time Mandarin tutor from China"
    },
    {
        "postid": "5947571263",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you looking to Excel at MS Excel? \n \nInspizone is here to help you! \n \nWe have MS Excel courses available for you!  \n \nIts a 3 days course comprised by 3 levels the Basic, Intermediate, and Advance. you can choose which level you feel will be appropriate for you or you make take the 3 days for a formal training. \n \nIf you wish to take it on January our available dates are January 14-16 and January 24 and 25 2017. \nFor more info please visit our website http://www.inspizone.com/ \nAlternatively, You may email us at \n  show contact info \n or \n  show contact info \n \n \nCall 9899 4477 if you wish to speak with a training specialist.     ",
        "title": "Microsoft Excel Course"
    },
    {
        "postid": "5952998558",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nREVISION FOCUS TUITION FOR O/N LEVEL COM SCI PHY CHEM MATHS ALL AREAS  \n \nThoroughly revise for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "REVISION FOCUS TUITION FOR O/N LEVEL COM SCI PHY CHEM MATHS ALL AREAS"
    },
    {
        "postid": "5954351865",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEnglish Second Language tutoring available. \n \nAreas of service: \n Bedok,  Geylang,  Kallang,  Marine Parade,  Paya Lebar,  Tampines,  Toa Payoh \n \nPreferred Subjects: \n    English Second Language for all ages \n    English Language Arts (for both second and first language) for all years/grades \n    French Language Arts for all years/grades \n    Social Studies and History for all years/grades \n    Math for years 1-8 \n    Science for years 1-8 \n \nYou'll get exceptional service if you hire me for these subjects. \n \nI am energetic and excited about learning. I truly believe that everything is interesting and everyone is capable of learning. I will listen to you deeply about your struggles and/or goals.  \n \nThe first session with me is always fully refundable if we decide it's not a good fit. \n \nContact:  \nPlease call/SMS me at +\n  show contact info \nor email \n  show contact info \n to arrange an initial session. \n \n* If you'd like to learn more about me as an educator, please visit marjorielafrance.com \n \nEducation: \nI graduated from my provincial university in Canada with two Bachelors degrees: \nBachelor of Arts: double major in English and French with a minor in History \nBachelor of Education: focus on Elementary and Middle levels (that means from Year 1 to Year 9)  \n\tI have attended numerous professional development courses since graduating to help keep my teaching relevant. Everything from how to help kids focus to how to apply sign language techniques when learning new languages! \n \nExperience: \nI have been working in Education since graduating in 2010, from private tutoring in Canada to teaching in England. Teaching is my calling and what I love most! My most recent job experience was working at an all-girls charter school in Alberta, Canada, where I taught for four amazing years. \n \nAbout me: \nI love sports, music, reading and nature. You can often find me on the volleyball court, singing in a choir, reading a novel, or trying out a new experience just for fun! I have recently moved to Singapore after travelling for four months around Canada, then visiting Hong Kong, Malaysia, Thailand, Laos, Cambodia and Vietnam.     ",
        "title": "ESL Tutor: Native English Speaker with English and Education Degrees"
    },
    {
        "postid": "5957536656",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Karizza and I have been working in Singapore for 2 years in the field of Early Childhood Education. I also have experience in working with children with Special Needs. \nI have taught English to primary school children and kindergarten. My rate starts from SG$40 per hour. Feel free to reach out to me now if you want to inquire about my classes. My Singapore WhatsApp number is +\n  show contact info \n \n \nHave a nice day! \nKarizza     ",
        "title": "English tutor from Philippines"
    },
    {
        "postid": "5956001310",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBonjour. My name is Guillaume. I am a French tutor with experience in teaching a group of students aged 15-20 in Maths, Physics and Chemistry in France. I have also worked with younger children. \n \n \nI'll be happy to work with your children to help them in their school subjects.     ",
        "title": "French tutor - experienced teaching children"
    },
    {
        "postid": "5948912915",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJoyce Music Studio (JMS) -- The Piano, Keyboard &amp; Music Theory Lesson Specialist.  \nOur Mission : A private piano studio that aims to provide a holistic and individualised piano and keyboard lessons for all students in a friendly and well equipped environment with fully accredited piano teachers. \nDescription : Joyce Music Studio (JMS) is a privately run piano studio for discerning talent, young or old, beginner, advanced or diploma level, to discover your hidden musical prowess. Our mission is to simply provide a holistic and individualized piano and keyboard lessons in a friendly and well equipped environment. We conduct individual/group lessons for all ages and experience levels.  JMS is staffed only by full-time professional piano teachers. Come and join us for interesting and creative piano/music lessons.  \nLocation : Centrally located at 502 Ang Mio Kio Ave 5. Only 2 km from The French &amp; Australian International schools,  withineasy reach of Singapore American School, Toa Payoh, Braddell, Bishan, Upper Thomson, Yishun, Yio Chu Kang, Hougang, Sengkang, Serangoon North, Serangoon Gardens, Li Hwan or Lorong Ah Soo. Contact : Please call 64552116.   \nReviews : http://pianoteachersingaporejms.wordpress.com/ \n \nThank you for teaching me. I enjoy your lessons and have learned much. You are a wonderful teacher! -- Audrey Lo 2014 \nIt has been a wonderful year learning the piano with you as my teacher. Thank you for all your patience and advice and for the knowledge you are imparting to me which is making my dreams come true. -- Kathryn Clarke 2014 \nDear Ms Lo \nThank you for a job well done. You had boost up Jervis's self esteem. He was feeling rather important about himself. I really appreciate your effort. . .. . .. . .. . ...   Serena Kang, Jervis's mother    \nDear Ms Lo \nYour special once-a-month group lesson is an excellent idea. It gives children an opportunity to showcase their talent, develop self-belief, confidence and improve social interactive skills. Outsantanding!............................ Ronda McMahon, Australian International School.   \nDear  Ms Lo, \nThank you for being such a blessing...for being so tolerant...thank you for believing in me when I was about to give up....for pushing me when I thought I could go no further. Above all, thank you for being my teacher! You are truly a wonderful piano teacher! Happy Teachers' Day!!   . . .. . .. . .. . .  Andrew Ng \nDear Ms Lo, \nWe wish to express our heartfelt gratitude and thanks for your teaching, care and guidance you had given our daughters for the past 9 years. Under your guidance, Li Lian's interest in piano and music had developed beyond our expectation. With your encouragement she has grown from an introvert child into a confident and musically creative teenager. My hushand, Peter and I would like to say A BIG THANK YOU for all the wonderful things you had done for Li Lian. . ...  Peter &amp; Wee Lee Koh \nDear Ms Lo, \nThanks for your feedback.Your advice is noted. We will ensure Amanda spends more time to practise piano pieces. For your information, she was applauded and commended for her fine impromptu performance during the holiday with a chance to demonstrate her piano skill in a birthday banquet held for her grandparents in Shanghai. Many guests asked how and where we could find such a good piano teacher.\" Regards. . ... LK - Jan                                                    \nDear Ms Lo, \nSeason Greetings.Just  like to thank you for your effort in enhancing learning and creativity in your lessons. We believe that the change will definitely go a long way in enabling our girls to be more aware of their potentials. We appreciate your varied teaching methods that is aimed to enrich their learning experience. . .. . .  Mrs June Wong \nDear Ms Lo, \nThank you for coaching our son, Aidon. We have seen him gained much confidence while playing on his keyboard. Besides, he no longer finds practicing a chore but enjoys doing it to refine his skills. In the past, we used to see him getting frustrated whenever he's unsure about the pieces he's handling. Yet as parents, we are not able to coach him much as we do not have prior piano experience. We are relieved to see that Aidan is guided closely by you so much so that whenever he's home practicing, he knows exactly what to do, We are very blessed and grateful that Aidan has such a patient and motivating piano teacher like you. We look forword to Aidan taking his Grade 1 piano exam under your professional guidance. Thank again. Regards. . .. . .. . .. . .. . ...Geraldine, 7th Aug 2012 \n ",
        "title": "Joyce Music Studio - The Piano, Keyboard &amp; Music Theory Specialisy"
    },
    {
        "postid": "5946376543",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Bai xiaoru - ni hao! \n \nI am originally from China and have passed the O Levels examination. I currently teach part time Mandarin lessons in Singapore and my rates are fixed at SGD40 per hour.     ",
        "title": "Mandarin lessons - native Chinese tutor"
    },
    {
        "postid": "5958468656",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nArt of Love  \nLove failure? Dumped ?? Rejected ???  \nDon't worry!!!!!!!!  \nI will give you solutions!!!!!!!! \nI will train you and make you a master in love, any gender you desire will fall in love with you. \nAssessment will be done on appointments only \n100 % guaranteed success. \nDo Not Delay The Matter  \nBe a champ NOT a looser \nSchedule an appointment immediately  \n \n \n ",
        "title": "Love Success"
    },
    {
        "postid": "5950414606",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBEGINNER - Never played before? Want to learn the true and correct fundamentals with good solid technique? INTERMEDIATE -- Able to play social tennis? Played before but really have no idea on how to move on. Want to learn more about match play? Want to learn about shot selection? Do join us! Tennis Coaching Services is set up to provide professionally run tennis lessons by highly qualified and internationally accredited coaches for students of all ages and levels.We are well known for tailoring our lessons to the needs of individuals. Lessons are conducted on one to one basis but small group can also be considered. Our rates are highly competitive and extremely afforded. All you need is to decide that you want to learn and play or improve your skills further, choose a day and a time and a venue of your choice and convenience, we will be there. Call Hd Coach (See Wai) @ 9 021 7831 now.       \nhttp://tenniscoachingservicessingapore.wordpress.com/ \n ",
        "title": "Tennis Lessons for All Ages &amp; Levels with Private Tennis Coach"
    },
    {
        "postid": "5954229788",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nREGISTRATION OPENED FOR 2017 YISHUN PRI - SEC TUITION CLASSES \n \n The Learning Verve Knowledge Hub \n \n Pre School, Primary &amp; Sec tuition @Yishun \nthelearningverve.blogspot.sg \nthelearningverve.weebly.com \n  9379 4744 \n \n \n \nACE YOUR EXAMS AND SEE IMPROVEMENTS!!! \nOurs students have benefited from our classes. So why wait? \n \n \n \n 9 REASONS WHY YOU SHOULD CHOOSE US \n \n \n \n \n 1. Our commited and caring tutors are diploma - degree holders. We have Ex NIE teachers and Full Time Tutors with proven track records. With classroom teaching experience in government schools, education centres, language schools, community clubs and one to one classes. \n \n  We hope to impart exam learning and solving technique to our students.We are more than just tutors. We mentor our students. We understand each child is unique and learn at different pace and with different style.  \n \n \n \n  2. Reasonable fees. We understand that parents want to maximize their investment on their children's education. Hence, our fees are competitive yet reasonable.  \n \n \n \n  3. A small class size and teacher : student ratio allows tutor to devote more attention and time to each student and group ensuring optimum performance.  \n \n \n \n  4. Regular update to parents via tutor and parents meeting session and sms broadcast. We believe in a clear line of communication with parents. Our customers are the most important people. \n \n \n \n 5. There will be tuition tests in Feb, Apr, Aug and Oct. This allows us to effectively evaluate student's strengths / weaknesses and to work on them.This also allows students to put into practice what has been taught and \"warm up\" for coming exams. A feedback report will be issued.We also conduct FREE MOTIVATIONAL WORKSHOPS FOR ALL OUR STUDENTS TO BUILD THEIR SELF ESTEEM AND SET GOALS.  \n \n \n \n 6. We have 4 systematic and successsful approaches termed the:-\" clockwork apporoach\"\"carrot apporach\"\"story telling approach \" Goal setting approach\" which have benefited our students. Fast and easy technique to tackle exam questions are taught. All while adhering to MOE syllabus.  \n \n \n \n  7. We provide challenging in - house worksheet materials prepared by our experienced tutors which mirrors exam based questions to supplement our use of popular assessment books. \n \n \n \n \n 8. Our parents and students have given us favourable testimonials and the \"thumbs up\". Our student's 2013 and 2014 results and achievements have been very encouraging and a success. They also pick up other intangible skills during our lessons such as being responsible and being discipline. \n \n \n 9. We believe in ' SCR\"- sincerity, commitment and being responsible     ",
        "title": "SCORE A. YISHUN TUITION. EXCELLENT PSLE PASS RECORD. 12 YEARS EXPERIEN"
    },
    {
        "postid": "5954350042",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMarjorie LaFrance - Tutor/Teacher \n \nAreas of service: \n Bedok,  Geylang,  Kallang,  Marine Parade,  Paya Lebar,  Tampines,  Toa Payoh \n \nPreferred Subjects: \n    English Second Language for all ages \n    English Language Arts (for both second and first language) for all years/grades \n    French Language Arts for all years/grades \n    Social Studies and History for all years/grades \n    Math for years 1-8 \n    Science for years 1-8 \n \nYou'll get exceptional service if you hire me for these subjects. \n \nI am energetic and excited about learning. I truly believe that everything is interesting and everyone is capable of learning. I will listen to you deeply about your struggles and/or goals.  \n \nThe first session with me is always fully refundable if we decide it's not a good fit. \n \nContact:  \nPlease call/SMS me at +\n  show contact info \nor email \n  show contact info \n to arrange an initial session. \n \n* If you'd like to learn more about me as an educator, please visit marjorielafrance.com \n \nEducation: \nI graduated from my provincial university in Canada with two Bachelors degrees: \nBachelor of Arts: double major in English and French with a minor in History \nBachelor of Education: focus on Elementary and Middle levels (that means from Year 1 to Year 9)  \n\tI have attended numerous professional development courses since graduating to help keep my teaching relevant. Everything from how to help kids focus to how to apply sign language techniques when learning new languages! \n \nExperience: \nI have been working in Education since graduating in 2010, from private tutoring in Canada to teaching in England. Teaching is my calling and what I love most! My most recent job experience was working at an all-girls charter school in Alberta, Canada, where I taught for four amazing years. \n \nAbout me: \nI love sports, music, reading and nature. You can often find me on the volleyball court, singing in a choir, reading a novel, or trying out a new experience just for fun! I have recently moved to Singapore after travelling for four months around Canada, then visiting Hong Kong, Malaysia, Thailand, Laos, Cambodia and Vietnam.  \n ",
        "title": "Experienced Primary Teacher available for Reading, Writing and Grammar"
    },
    {
        "postid": "5950871412",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre your language skills, accent or communication, holding you back from reaching the next level in your personal life or from having more success in your business career? Communication without language barriers, translates into success in your life and your business.  \n \nI founded ESL Language Coach to empower my students to achieve their life goals, while learning English. I started teaching English as a Second Language over 20 years ago in Beijing, China.\n \n \n ESL Language Coach  is now accepting new students for the Intensive Program, One-on-One. Helping you to improve your English language skills, so you will achieve the most effective communication possible, without any language barrier. \n \n Services:  \n \nEditing (books, websites, presentations, speeches) \n \nPublic Speaking / Acting (Accent and Vocabulary) \n \nBusiness English Language Class - Private \n \nBusiness English Language Class -- Group  \n \nFeel free to contact me with any questions and sign up now before all the spots are taken: \n \n  \nwww.ESLlanguagecoach.com \n \n \nAmerican, CELTA, Cambridge University, English Class, ESL, English Tutor, TOEFL, English Teacher, \nEnglish as a Second Language, Language Coach, Life Coach, Business Coach, Grammar, Prepositions, \nConversation, Pronunciation, Web Content Editor, Communications Specialist, Editor, ESL Curriculum, Artist, Filmmaker, Finance, Photographer, Documentary films, Comedy, Peace, Presentation Practice, Language, Rhythm, Artist Statement, English Editor, Content Editor, Foreign Language, Writing your Business Proposal in English, Learning New Technology and Apps in English, Designing your own website, English for Techies, English Creative Writing, Improving your American English Accent, Acting, Business English, Singing in English, Acting, Modeling , Actors, Models, Singers, Comedians, Public Speaking, Audition, Casting, Blogger, Speaker, Natural Health, Empowered Speech, Actor, Life Coach, Wellness, photography, film, social media, Global Vision Life Coach, Movement Makers, Diplomats, Speech Writers, Journalists, Scriptwriters, Book Editor, Writer\n     ",
        "title": "Boost your career: Study English - Learning English Online -"
    },
    {
        "postid": "5927860291",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTeaches Computers / Internet / Notebook \n \n- Over 15 years of working experience in IT / design as Support, Consultant, System Analyst and Project Manager \n- For student / teachers/ retirees / anyone who wants to learn about computers / internet / ipad / Microsoft Office (Word/Excel/Powerpoint) \n- SGD35 per hour (min 5 hours ) / negotiable depends on situations   \n- Home or Starbucks / McDonalds / Coffee House at Novena, Orchard, Sommerset, Dhoby Ghaut area only.  \n- Thank you     ",
        "title": "Teaches Computers / Internet / Notebook"
    },
    {
        "postid": "5958570635",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n121 INDIVIDUAL KEYPOINT O/N LEVEL TUITION COM SCI PHY CHEM MATHS ALL AREAS  \n \nPrepare for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concept, exam question trend for combined science physics chemistry and mathematics for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "121 INDIVIDUAL KEYPOINT O/N LEVEL TUITION COM SCI PHY CHEM MATHS"
    },
    {
        "postid": "5958441783",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPRIVATE HOME TUITION 1-TO-1 \n \nPhysics, Chemistry, A Maths, E Maths. \n \nSec 3 / Sec 4 -- O Level. \n \nI am a full-time professional graduate tutor offering private home tuition on a 1-to-1 basis. \n \nI have 28 years of teaching experience specialising in the O Level syllabus. \n \nLocation coverage: All areas in Singapore. \n \nI can conduct the private lesson at the student's home on a 1-to-1 basis in any area in Singapore. \n \nCall 67263003.     ",
        "title": "PHYSICS, CHEMISTRY, A MATHS, E MATHS: SEC 3 / 4 -- O LEVEL"
    },
    {
        "postid": "5955556268",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi, my name is Robert, I am Australian and I have been a private English teacher here in Singapore for several years. I can help you with conversational English, business English, presentation, reading comprehension and business writing as well. I offer home tutoring to teenagers and to adults. I am an author of Berlitz textbook on business writing with 5 years experience in teaching English to non-native speakers. I offer personal training to IELTS and TOEIC students too. \n \nI am quite flexible for the hours and I can meet anywhere in Singapore. We can meet somewhere in a coffee shop, at your home or at your office. My rate is flexible and is depending on the location of your classes and their frequency. My rate ranges from 70 to 100 SGD per hour.  \n \nContact me through WhatsApp at +\n  show contact info \ndirectly. I now work with www.singapore-english-teacher.com and I will introduce you to another reliable native tutor I work with if my availabilities do not match yours. \n \nPlease WhatsApp me now to get the best possible rate at +\n  show contact info \n Satisfaction is guaranteed. \n \nRobert  \nhttp://www.singapore-english-teacher.com/     ",
        "title": "Qualified IELTS and TOIEC English tutor"
    },
    {
        "postid": "5951418310",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \n \n \nHello, \n \n Are you looking for a tutor to help you practice your Korean and forming sentences?  \n \n \n \n \nOr practicing your Korean fluently? \n \n \n \n \nYou can meet me through Skype, and you can book my lesson at your convenience through www.tutor-k.com. \n \n \n \n \nI offer customized curriculum based on what you tell me which subject or part you would like to work on. \n \n \n \n \nWe will discuss about business and social manners that are required in Korea as well during session.  \n \n \n \n \n \n You can schedule a Korean lesson with me through below link. \n \nhttp://www.tutor-k.com/profile/view_profile.php?lmn=120 \n \n You can book me for a trial session or regular session which is for 30 minutes. \n \n \n \n \n \n \nMy rates are $7-$13 for 30 minutes.  \n \n \n \n \nGroup lesson rates are cheaper than private lesson rates. \n \n \n \n \n(Book group lesson with your sister, brother, friend, or family. More people more fun!) \n \n \n \n \n \n Contact me if you have any questions. \n \n ",
        "title": "Are you looking for a tutor to help you practice your Korean ?"
    },
    {
        "postid": "5954250188",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPRE SCHOOL, PRIMARY &amp; SECONDARY TUITION CLASSES @ YISHUN. \n \n The Learning Verve Knowledge Hub \n \nTEACHER WITH 12 YEARS INVALUABLE EXPERIENCE IN THE EDUCATION INDUSTRY. HAS RENDERED TEACHING SERVICE AT PRIMARY SCHOOL, SECONDARY SCHOOL, COMMUNITY CLUBS, NON PROFIT ORANIZATION. \n \nPOSITIVE TESTIMONIAL &amp; FEEDBACK FROM STUDENTS &amp; PARENTS. \n \nGENERAL IMPROVEMENT IN STUDENTS'S MARKS CAN BE SEEN AFTER THE THIRD MONTH. \n \nEXCELLENT RESULTS PRODUCED BY STUDENTS FOR PSLE 2013 - 2016. HIGHEST AGGREGATE OF 250. MORE THAN 6O % QUALIFIED FOR EXPRESS STREAM. \n \n \n \nPre School, Primary &amp; Sec tuition @Yishun \nthelearningverve.blogspot.sg \nthelearningverve.weebly.com \n  9379 4744 \n \n ",
        "title": "12 YRS EXP 7 VERY COMMITTED TCR. PROVEN RESULTS. IMPROVEMENTS"
    },
    {
        "postid": "5953145376",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Sonia and I am a Singaporean. \n \nI teach English and have experience in providing English tuition from 2007 to 2012. My students ranged from primary level to JUNIOR college to Senior school. I have also taught students from International schools.  I graduated with a Bachelor (Hons) Degree majoring in English from Singapore NTU. I  can teach also teach the IB Syllabus. \n \nFor further inquiries, please Whatsapp me at +\n  show contact info \nand I will be happy to arrange a class with you. My rate starts from SGD40 per hour, but may vary according to the location and frequency of the class. \n \nHave a nice day. \nSonia     ",
        "title": "Local English Tutor - IB Syllabus"
    },
    {
        "postid": "5932001021",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you in place  in which you've enrolled in a GMAT prep class but nonetheless feel less than prepared for your exam? I can help. Unlike your GMAT prep course, I provide: \n \n- customized tutoring sessions tailored around your requirements, rather than around the needs of an entire class. \n \n- My own GMAT curriculum that contains more than 2,500 practice GMAT math questions. This program enables us to study each topic at length, not only during every lesson but also  for homework enabling you to move forward in between lessons. \n \n- Access to meet for a session at whatever time is most convenient for you. If you want to meet in the morning I'll be able to meet. However, if you want to meet on the weekends , I am also able to meet. \n \n- Experience as a GMAT coach. I have been tutoring the GMAT full-time for over a decade. Over that time  I have tutored over 10,000 hours for the GMAT. You will get the chance to be taught by a legitimate GMAT professional. \n \nPlease reach out to me today, so we can talk further and schedule a free session.     ",
        "title": "Holistic GMAT Coaching"
    },
    {
        "postid": "5955988769",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusical Art Studio ( www.musicalartstudio.info ) is registered as a private music school with MOE, Singapore. Currently, we have availability on weekdays and weekend. \n \nWe offer courses in: \n \n- Violin (1-on-1 or Group classes),  \n- Piano (1-on-1 classes), \n- Guitar (1-on-1 classes), \n- Music Theory (1-on-1 or Group classes),  \n- Kids' Musicianship (Group classes), \n \nas well as PIANO ACCOMPANIMENT for various exams (Grade 1 to Diploma level).  \n \nThe courses are conducted by dedicated teachers and musicians, who have obtained high qualification and possess extensive experience. The courses at the Musical Art Studio (from beginners to advanced levels) aim to develop the students' technical skills for playing of the respective instrument as well as to prepare them for various exams, auditions, performances, music competitions etc. The essence of the teachers' pursuits is to expose the students to the beauty of the Music, as well as to enable them to understand and perform it as an actual Art.  \n \nContact us: \n \nMUSICAL ART STUDIO \n \nAddress: 462 Crawford Lane, #02-59 Singapore 190462 \n \nPhone: 63382469 \ne-mail: \n  show contact info \n \n \nwww.musicalartstudio.info     ",
        "title": "PIANO, VIOLIN, GUITAR, MUSIC THEORY, KIDS' MUSICIANSHIP LESSONS"
    },
    {
        "postid": "5949232253",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHighly educated Piano teacher with experience more then 20 years , winner of International piano competition in Italy ,is giving lessons of Music for exams, concerts of for leisure..Brilliant results. Annually 2 concerts for students. For all levels or ages. Can come to your home.call  Elina 96424115 \nAlso accompany for another musical instruments for any Grade exams or recordings     ",
        "title": "PIANO LESSONS"
    },
    {
        "postid": "5957552235",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Jon and I used to be a tutor for Math and for English before I started to teach Spanish with Tutoroo. I am now teaching Spanish as a part-time tutor to beginner and intermediate levels (up to B1) students. I have been tutoring students at Yale-NUS for a year now. I am a final year student at Yale-NUS, majoring in philosophy and political science. I am also the captain of the school handball team! Contact me to ask about my availabilities. My rate starts from SG$40 per hour.     ",
        "title": "Part-Time Spanish tutor"
    },
    {
        "postid": "5949954169",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nO/N LEVEL TUITION, PREPARE FOR COM SCI PHY CHEM MATHS ALL AREAS \n \nSchool exam focus revision, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "O/N LEVEL TUITION, PREPARE FOR COM SCI PHY CHEM MATHS ALL AREAS"
    },
    {
        "postid": "5947611174",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for qualified home tuition and courses for your child and studies \n \n(K1 &amp; K2/Pri 1- Pri 6/Sec 1-Sec 5/JC (All or Single Subject) Languages, Sports, Dance, Music etc) \n \nCurrent promotions:  \n \n- Free Online E-learning and top school examinations papers \n(Worth $50/month) \n- Discount rates for EPB assessment books \n- Accumulate points for every dollar spent to redeem a shipping voucher \n \nAll Areas in Singapore are available! \n \nCall/Sms 96747118 for more information \n ",
        "title": "K1 &amp; K2/Pri 1- Pri 6/ Sec 1-Sec 5/JC (All or Single Subject) Languages"
    },
    {
        "postid": "5950236972",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n121, O/N LEVEL SIMPLIFIED TUITION, PREPARE FOR COM SCI PHY CHEM MATHS ALL AREAS  \n \nSchool exam focus revision, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "121, O/N LEVEL SIMPLIFIED TUITION, PREPARE FOR COM SCI PHY CHEM MATHS"
    },
    {
        "postid": "5957554126",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Maria. I am originally from Russia and now live in Singapore. I graduated in French as a foreign language at the Sorbonne-Nouvelle University in Paris in 2000. After having taught in France for several years, I moved abroad and lived and worked in various countries, including Russia, Australia and Romania. I have more than 15 years of experience teaching adults and children. I also hold a Master in Translation and Conference Interpretation from ESIT and ITI-RI in Paris and Strasbourg. I speak French, English, Russian, German and Romanian. I am now teaching these languages to both children and adults with Tutoroo. Contact me to verify my availabilities. \n \n \nMaria \n ",
        "title": "I can teach you French, Russian or English"
    },
    {
        "postid": "5943132722",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTurkish lessons for any level from Native Speaker. Holding Public Relations degree and worked as a kindergarten teacher for 1,5 years. I am good with children also with adults.  \n \n50 SGD for an hour \n75 SGD for 2 hours     ",
        "title": "Turkish Lessons from Native Speaker"
    },
    {
        "postid": "5954199557",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExcellence Academy tuition centre: \n \nLatest result: \nFu Haoyu,scholar from Nan Hua High School, achieved 925 upon 1000 marks for 10 subject in the Year-end Exam.The highest score in the whole cohort! \n \n-EA tuition centre all O-level subject tuition class. \n \n-Strictly limit the number of students in a group, 8 students in a group. \n \n-Taught by former experienced government school teachers(Head of Department) \n \n-FREE books and comprehensive notes (Composed by our lecturer that is only available in EA tuition centre) \n \n-Reasonable tuition fees \n \n*1-3 aggregate increment within 3 months. \n \nOther levels subject include: \n- Secondary 1 \n- English &amp; Math \n \n- Secondary 2 \n- English &amp; Math \n \n- Secondary 3 \n- English Language \n- A Math \n- E Math \n- Humanities (Geography, Literature, History) \n- Sciences (Biology, Chemistry, Physics) \n \nFan Jihao, from China, was enrolled in Damai Secondary School in 2014, with B4 , a weak foundation in speaking, eventually achieved A1 for English for the O level in 2016 ,benefited from our exclusive strategy and accurate prediction on the topic by the professional teacher in Excellence Academy which appeared in the exam questions. \n \nPrior to the 2015 O level, we accurately predicted these 3 topics, and arranged intense exercise for the students regarding the upcoming topics: \n \n1: \"The world would be a very dull place without music.' what are your views? \" \n \n2: \"Shoppers have too much choice, from chocolate bars to jeans'. What are the advantages and disadvantages of having too many things to choose from? \" \n \n3: \"Do electronic devices, such as tablets and smartphones, help or hinder students in their studies?\" \n \nBased on the feedback from the students, most of them chose this topic, since it was particularly studied with model essays and notes. Our teacher has done massive research on the usage and addiction of smartphones and he has shown the result of his research to students. Thus, we predicted the topic with pertinent content, enabling the students to be extremely prepared for the examinations. \n \nContact us for more information:  \n \n83100425 (English) \n \n90014055 87096129 (Chinese) \n \nWeChat: 469014182 843248622     ",
        "title": "Top Tuition O Level Results Guaranteed A!"
    },
    {
        "postid": "5957290108",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTennis Your Way To Better Health &amp; Fitness. \nInterested in picking up tennis but unsure of where to find qualified professional tennis coaches? Feeling lethargic and needing a good workout? Wanna improve your fitness and health but don't know how? Try Tennis! Tennis Coaching Services is set up to provide professionally run tennis lessons by highly qualified and internationally accredited coaches for students of all ages and levels.We tailor our lessons to the needs of individuals. Lessons are conducted on one to one basis but small group can also be considered. Our rates are highly competitive and extremely afforded. All you need is to decide that you want to learn and play or improve your skills further, choose a day and a time and a venue of your choice and convenience, we will be there. Call Hd Coach (See Wai) @ 9 021 7831 now.       \nhttp://tenniscoachingservicessingapore.wordpress.com/ \nWhat Others Say : \n\"I can't say enough about the professionalism and skill he shows. . .. . .he was very accomodating and spot-on with helpful instruction for both of us. . .....P. Ray &amp; Jane. \n\"Attending his clinics/camps is one of the best bargains for improving your tennis. He is accessible, friendly, and have  incredible drills (fresh and new drills each time you go). They know how to make the experience fun and inclusive for all the players -- Kobayashi. \n\"My two children received unsurpassed expertise . They had a lot of fun while at the same time gaining significant tennis knowledge. . .. . .. . ... Celia &amp; Ray Chow  \n\"He is an exceptional teaching pros, with years of experience showed on court by every drill. He focus on details, but also create a friendly and enjoyable atmosphere during the clinics and private classes. . .. . ... Sharon. Bard  \n\"His tennis instruction was poised, deliberate, and intense. I had specific goals set to accomplish, met and exceeded my expectations. My level of play has raised since ........John.Bey \n\"Our group has been taking clinics from C.Y  for years, he has so much energy it's contagious. Every session has a positive outcome. . .......Jerald Ee.  \nMore reviews : https://tenniscoachingservicessingapore.wordpress.com/ \n ",
        "title": "Tennis Your Way to Better Health &amp; Fitness with Private Tennis Coach"
    },
    {
        "postid": "5957290581",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJoyce Music Studio (JMS) is a private piano studio that aims to provide a holistic and individualized piano and keyboard lessons in a friendly and well equipped environment. We provide piano lessons for discerning talent, young or not so young, beginners, intermediate or advanced level, to discover your hidden musical prowess. Established since 1980s, JMS conducting piano lessons leading to Associated Board of the Royal Schools of Music (ABRSM) examinations, Trinity College, and the like.  Or you could do it for leisure. We conduct classes from beginner to diploma levels. Come and join us for an interesting and creative piano/music lessons in a conducive setting. Lessons are conducted individually and in group for all ages and experience levels. For a comprehensive tour of our services, just call us at 6455 2116 for more information. Our studio is located at 502, Ang Mo Kio Ave 5. Please call to make an appointment. Tel: 64552116.    \n \nhttp://pianoteachersingaporejms.wordpress.com/ \n \nA Handful of Reviews from Students &amp; Parents \nThank you for teaching me. I enjoy your lessons and have learned much. You are a wonderful teacher! -- Audrey Lo 2014 \nIt has been a wonderful year learning the piano with you as my teacher. Thank you for all your patience and advice and for the knowledge you are imparting to me which is making my dreams come true. -- Kathryn Clarke 2014 \nDear Ms Lo \nThank you for a job well done. You had boost up Jervis's self esteem. He was feeling rather important about himself. I really appreciate your effort. . .. . .. . .. . ...   Serena Kang, Jervis's mother    \nDear Ms Lo \nYour special once-a-month group lesson is an excellent idea. It gives children an opportunity to showcase their talent, develop self-belief, confidence and improve social interactive skills. Outsantanding!............................ Ronda McMahon, Australian International School.   \nDear  Ms Lo, \nThank you for being such a blessing...for being so tolerant...thank you for believing in me when I was about to give up....for pushing me when I thought I could go no further. Above all, thank you for being my teacher! You are truly a wonderful piano teacher! Happy Teachers' Day!!   . . .. . .. . .. . .. . .. . .. . .  Andrew Ng \nDear Ms Lo, \nWe wish to express our heartfelt gratitude and thanks for your teaching, care and guidance you had given our daughters for the past 9 years. Under your guidance, Li Lian's interest in piano and music had developed beyond our expectation. With your encouragement she has grown from an introvert child into a confident and musically creative teenager. My hushand, Peter and I would like to say A BIG THANK YOU for all the wonderful things you had done for Li Lian. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . ...  Peter &amp; Wee Lee Koh \nDear Ms Lo, \nThanks for your feedback.Your advice is noted. We will ensure Amanda spends more time to practise piano pieces. For your information, she was applauded and commended for her fine impromptu performance during the holiday with a chance to demonstrate her piano skill in a birthday banquet held for her grandparents in Shanghai. Many guests asked how and where we could find such a good piano teacher.\" Regards. . ... LK - Jan                                                    \nDear Ms Lo, \nSeason Greetings.Just  like to thank you for your effort in enhancing learning and creativity in your lessons. We believe that the change will definitely go a long way in enabling our girls to be more aware of their potentials. We appreciate your varied teaching methods that is aimed to enrich their learning experience. . .. . .  Mrs June Wong \nDear Ms Lo, \nThank you for coaching our son, Aidon. We have seen him gained much confidence while playing on his keyboard. Besides, he no longer finds practicing a chore but enjoys doing it to refine his skills. In the past, we used to see him getting frustrated whenever he's unsure about the pieces he's handling. Yet as parents, we are not able to coach him much as we do not have prior piano experience. We are relieved to see that Aidan is guided closely by you so much so that whenever he's home practicing, he knows exactly what to do, We are very blessed and grateful that Aidan has such a patient and motivating piano teacher like you. We look forword to Aidan taking his Grade 1 piano exam under your professional guidance. Thank again. Regards. . .. . .. . .. . .. . ...Geraldine, 7th Aug 2012 \n ",
        "title": "Music Education : Piano Teachers. Piano Lessons. Piano Classes"
    },
    {
        "postid": "5951477635",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nKEYPOINT TUITION  O/N LEVEL FOR COM SCI PHY CHEM MATHS ALL AREAS  \n \nExam focus revision, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "KEYPOINT TUITION  O/N LEVEL FOR COM SCI PHY CHEM MATHS ALL AREAS"
    },
    {
        "postid": "5954574988",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nREGISTRATION OPENED FOR 2017 YISHUN  PRE SCHOOL, PRIMARY &amp; SECONDARY TUITION CLASSES @ YISHUN. \n \n \n \nThe Learning Verve Knowledge Hub \n \nPre School, Primary &amp; Sec tuition @Yishun \nthelearningverve.blogspot.sg \nthelearningverve.weebly.com \n9379 4744 \n \nTHE OWNER &amp; MAIN TEACHER HAS ACQUIRED 12 INVALUABLE YYEARS OF EXPERIENCE IN THE EDUCATION INDUSTRY. HAS RENDERED HIS PROFESSIONAL TEACHING SERVICE AT PRIMARY SCHOOLS, SECONDARY SCHOOL,S COMMUNITY CLUBS AND NON PROFIT ORANIZATION. \n \n100 % PASSES FOR ALL OF HIS PSLE BATCH OF STUDENTS FROM 201*** \n \nPOSITIVE TESTIMONIAL &amp; FEEDBACK FROM STUDENTS &amp; PARENTS. \n \nGENERAL IMPROVEMENT IN STUDENTS'S MARKS CAN BE SEEN AFTER THE THIRD MONTH. \n \nEXCELLENT RESULTS PRODUCED BY STUDENTS FOR PSLE 201***. HIGHEST AGGREGATE OF 250. MORE THAN 6O % QUALIFIED FOR EXPRESS STREAM. \n \n \n \n \nA small class size and teacher : student ratio allows tutor to devote more attention and time to each student and group ensuring optimum performance.  \n \n \n \nRegular update to parents via tutor and parents meeting session and sms broadcast. We believe in a clear line of communication with parents. Our customers are the most important people. \n \n \nThere will be tuition tests in Feb, Apr, Aug and Oct. This allows us to effectively evaluate student's strengths / weaknesses and to work on them.This also allows students to put into practice what has been taught and \"warm up\" for coming exams. A feedback report will be issued.We also conduct FREE MOTIVATIONAL WORKSHOPS FOR ALL OUR STUDENTS TO BUILD THEIR SELF ESTEEM AND SET GOALS.  \n \n \n Fast and easy technique to tackle exam questions are taught. All while adhering to MOE syllabus.  \n \n \nWe believe in ' SCR\"- sincerity, commitment and being responsible     ",
        "title": "RESULT ORIENTED &amp; PROVEN IMPROVEMENTS. TUITION CLASSES @ YISHUN."
    },
    {
        "postid": "5954152472",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExcellence Academy  \n \nSecondary /O level Maths Tuition \n \n \nKiruthika Vinaya (Outram Secondary School) scored 97% for her secondary 2 SA2 examination. \n90% of our students get  A for their exam! \nTaught by former Secondary School Subject head! \nJoin us now to get a tremendous improvement! \n \nContact us: \n83100425 (English) \n90014055 87096129(Chinese)  \nWeChat: 469014182 843248622     ",
        "title": "Secondary /O level Maths Tuition guaranteed A by Subject Head!"
    },
    {
        "postid": "5922083478",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDid you recently walk out of the GMAT in surprise because your score was nowhere close to your target? Were you amazed by the difficulty of the exam? You are not alone. For the past eight years I have been coaching students in  your exact situation. Just like you, they did not know what to expect on their GMAT and found that their planning was absolutely inadequate. Whether it was a class that didn't teach with enough detail, a tutor who didn't give them 100% commitment, or a self-study course that simply didn't help, these students had to take the GMAT an additional time. \n \nLike those same students, you should not quit! And like those students, you've found the right teacher that will help you defeat the GMAT once and for all. \n \nI understand the GMAT better than most people in the world. I have taken it numerous times and have been a GMAT coach for the better part of the last decade. Over that period I've  numerous students and helped them attain what they assumed was impossible....a high GMAT score. \n \nLike you, I was once a GMAT student without a extensive quantitative background. Nevertheless, with hard work and commitment I was able to attain GMAT mastery. I understand that math is burdensome for most students, which is why I am an excellent teacher -  because above all else I can teach you the GMAT in the same manner that I once taught myself. \n \nFollow up with me today so we can chat about a personalized plan for you.     ",
        "title": "Professional GMAT Teaching -- Promised To Produce Results!"
    },
    {
        "postid": "5950342234",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI have 10 years' art education experience in the US and Singapore. \n \nNow opening small group sketching and drawing classes to children above 8 as well as adults. Class sizes are capped at 6 per session.  \n \nYou will be learning various drawing techniques and the classes will be fun and interactive.  \n \nClass fees are $200 for one month. Course materials are not provided (and at a fee on demand). You are welcome to do a one time trial at $50 (materials provided). \n \nTwo slots are available: Saturday 9:30 - 11: 30am, and 3:30 - 5:30 pm.  \n \nIf interested, please contact me by sms: 83749819.     ",
        "title": "Art classes at home studio for children and adults"
    },
    {
        "postid": "5957538090",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello - my name is Monika and I am a French tutor who is originally from France. I am currently studying at ESSEC Business School, one of France top business School andI have graduated from Sorbonne University.  \n \nI can teach French to beginners or advanced students. I have delivered lessons at Prepaya, a private insitute for students in Universities who are preparing for exam for French top business Schools. I also help student prepare the \"Tage Mage\" and simulate interviews in French. \n \nMy rate starts from SGD 40 but may increase depending on location of the class. If you need my help to improve your French, Whatsapp me at +\n  show contact info \n \n \nMonika     ",
        "title": "Improve your French with native French tutor."
    },
    {
        "postid": "5957539069",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Carolina , and I come  from Colombia. I have studied and lived in France and Spain. I have two Masters Degrees in Political sciences and International Cooperation for Development. I am currently doing another Masters in Spanish language. \nI have over 8 years experience teaching at international schools. I am very motivated and passionate in teaching  the Spanish language to my students. \n \nMy rate starts from SGD40 but may vary according to the location and frequency of the class. I can meet you at any location convenient to you. \n \nWant to learn Spanish? Whatsapp me at +\n  show contact info \nnow  :-) \n \n \nCarolina     ",
        "title": "Private Spanish lessons from a qualified tutor - rates from SGD 40"
    },
    {
        "postid": "5948913398",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTennis Coaching Services In singapore \nInterested to pick up tennis and unsure where to find qualified coaches? You are at the right place. Learnt tennis previously but still not playing it well? Let our pro guide you to proper techniques and skills to enhance your game. Or do you just need a good sparring partner? We promise you a good workout at level that you are comfortable with. At Tennis Coaching Services (Singapore), we have the expertise and personnel to provide the necessary training to suit your need regardless of age or skill levels. It is personalized one-to-one tennis lessons or group tennis coaching lessons with your friends. Our philosophy is simply - learn tennis the optimal way through proper tactical instructions and structured coaching with one of our many professional tennis coaches here in Singapore. Call now to find out more Ã&#131;Â¢Ã¢‚Â¬\" your personal tennis coach  See Wai  90217831.  \n \nWhat others sayÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦... \n \nÃ&#131;Â¢Ã¢‚Â¬Ã&#133;\"Our group has been taking clinics from C.Y  for years, he has so much energy it's contagious. Every session has a positive outcomeÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦Ã&#131;Â¢Ã¢‚Â¬\" J.Ee. December 2009 \n \n\"I can't say enough about the professionalism and skill he showsÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦Ã&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦he was very accomodating and spot-on with helpful instruction for both of usÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦ Ã&#131;Â¢Ã¢‚Â¬\"P.Ray. November 2008 \n \nÃ&#131;Â¢Ã¢‚Â¬Ã&#133;\"Attending his clinics/camps is one of the best bargains for improving your tennis. He is accessible, friendly, and have incredible drills (fresh and new drills each time you go). They know how to make the experience fun and inclusive for all the players Ã&#131;Â¢Ã¢‚Â¬\" KOR.Oct 2007  \n \n\"My two children received unsurpassed expertise . They had a lot of fun while at the same time gaining significant tennis knowledgeÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦Ã&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦Ã&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦.. Ray.Chow September 2006 \n \n Ã&#131;Â¢Ã¢‚Â¬Ã&#133;\"He is an exceptional teaching pros, with years of experience showed on court by every drill. He  focus on details, but also create a friendly and enjoyable atmosphere during the clinics and private classesÃ&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦Ã&#131;Â¢Ã¢‚Â¬Ã&#130;Â¦.. S.Bard , November 2005 \n \nÃ&#131;Â¢Ã¢‚Â¬Ã&#133;\"His tennis instruction was poised, deliberate, and intense. I had specific goals set to accomplish, met and exceeded my expectations. My level of play has raised Ã&#131;Â¢Ã¢‚Â¬\"John.Bey Jan 2004  \n ",
        "title": "Tennis Lessons By Professional Coaches"
    },
    {
        "postid": "5955646194",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGMAT got you down|? Do you approach every review   period with trepidation, convinced that it's maybe  not worth it to work so hard, not really knowing if you're preparing effectively or if you'll eventually receive the GMAT score you want? \n \nWorry no more! I'm the solution to your issue. I understand more about the GMAT than about 99.999% of individuals on earth, and I can help you manage your study efforts, tutor you through the tough spots, and keep you encouraged to achieve your GMAT goal. \n \nI have been a GMAT tutor for pretty much a decade, so I am able to guide you through the intricacies of the exam. I will assist you to decide your GMAT target goal and create a study plan that'll efficiently and effectively get you to that goal. I understand the content inside and out, and therefore I can provide teaching sessions which are centered on the material that you need to perfect. I will be your coach, your advisor, along with being your supporter! \n \nThe GMAT is a hard examination. You will be tougher! With my support, you will be ready and assured on examination day.  Contact me today to get going!     ",
        "title": "I Beat The GMAT -- Let Me Show You How It Is Possible To Do The Same"
    },
    {
        "postid": "5955554058",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Guadalupe and I am originally from Argentina. I have been a student in a bilingual school in English and Spanish and I'm absolutely fluent in both languages. I have been giving Spanish lessons for beginners in college and before coming to Singapore. I also have experience in tutoring English to kids. I am also able to communicate in Chinese :)     ",
        "title": "Argentinian teacher - proficient in English and Spanish"
    },
    {
        "postid": "5953645946",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusical Art Studio ( www.musicalartstudio.info ) is registered as a private music school with MOE, Singapore. Currently, we have availability on weekdays and weekend. \n \nWe offer courses in: \n \n- Violin (1-on-1 or Group classes),  \n- Piano (1-on-1 classes), \n- Cello (1-on-1 classes), \n- Guitar (1-on-1 classes), \n- Music Theory (1-on-1 or Group classes),  \n-Kids' Musicianship (Group classes), \n \nas well as PIANO ACCOMPANIMENT for various exams (Grade 1 to Diploma level).  \n \nThe courses are conducted by dedicated teachers and musicians, who have obtained high qualification and possess extensive experience. The courses at the Musical Art Studio (from beginners to advanced levels) aim to develop the students' technical skills for playing of the respective instrument as well as to prepare them for various exams, auditions, performances, music competitions etc. The essence of the teachers' pursuits is to expose the students to the beauty of the Music, as well as to enable them to understand and perform it as an actual Art.  \n \nContact us: \n \nMUSICAL ART STUDIO \n \nAddress: 462 Crawford Lane, #02-59 Singapore 190462 \n \nPhone: 63382469 \ne-mail: \n  show contact info \n \n \nwww.musicalartstudio.info     ",
        "title": "Learn Musical instruments at Musical Art Studio"
    },
    {
        "postid": "5953644970",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusical Art Studio ( www.musicalartstudio.info ) is registered as a private music school with MOE, Singapore. Currently, we have availability on weekdays and weekend. \n \nWe offer courses in: \n \n- Violin (1-on-1 or Group classes),  \n- Piano (1-on-1 classes), \n- Cello (1-on-1 classes), \n- Guitar (1-on-1 classes), \n- Music Theory (1-on-1 or Group classes),  \n- Kids' Musicianship (Group classes), \n \nas well as PIANO ACCOMPANIMENT for various exams (Grade 1 to Diploma level).  \n \nThe courses are conducted by dedicated teachers and musicians, who have obtained high qualification and possess extensive experience. The courses at the Musical Art Studio (from beginners to advanced levels) aim to develop the students' technical skills for playing of the respective instrument as well as to prepare them for various exams, auditions, performances, music competitions etc. The essence of the teachers' pursuits is to expose the students to the beauty of the Music, as well as to enable them to understand and perform it as an actual Art.  \n \nContact us: \n \nMUSICAL ART STUDIO \n \nAddress: 462 Crawford Lane, #02-59 Singapore 190462 \n \nPhone: 63382469 \ne-mail: \n  show contact info \n \n \nwww.musicalartstudio.info     ",
        "title": "PIANO, VIOLIN, GUITAR, MUSIC THEORY, KIDS' MUSICIANSHIP LESSONS"
    },
    {
        "postid": "5955995261",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Fabrizio and I am originally from Italy. I'm an MOE Educator and L2D trainer, with SkillsFuture. I can teach Italian, Latin, Ancient Greek (Language and Culture) as a qualified teacher. \n \n \nVisit http://singapore-italian-tutor.com/ to know more about me.     ",
        "title": "Qualified tutor from Italy - Italian, Latin, Ancient Greek"
    },
    {
        "postid": "5947626541",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nENGLISH LANGUAGE, LITERATURE &amp; GENERAL PAPER TUITION BY EXPERIENCED TEACHER. \n25 YEARS OF TEACHING EXPERIENCE. \nLESSONS CONDUCTED AT STUDENT'S HOME. \nALL AREAS IN SINGAPORE. \nCALL: 98214669 \n \n ",
        "title": "ENGLISH/ LITERATURE/ GENERAL PAPER TUITION"
    },
    {
        "postid": "5949002342",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe Learning Verve Knowledge Hub \n \nPre school, Pri- Sec tuition @ Yishun  \nthelearningverve.blogspot.sg \nthelearningverve.weebly.com \n9379 4744 \n \n \n \nACE YOUR EXAMS AND SEE IMPROVEMENTS!!! \n \nOurs students have benefited from our classes. So why wait. \n \n \n \n \n9 REASONS WHY YOU SHOULD CHOOSE US \n \n \n \n1. Our commited and caring tutors are diploma - degree holders. We have Ex NIE teachers and Full Time Tutors with proven track records. With classroom teaching experience in government schools, education centres, language schools, community clubs and one to one classes. \n \nWe hope to impart exam learning and solving technique to our students.We are more than just tutors. We mentor our students. We understand each child is unique and learn at different pace and with different style.  \n \n \n \n2. Reasonable fees. We understand that parents want to maximize their investment on their children's education. Hence, our fees are competitive yet reasonable.  \n \n \n \n3. A small class size and teacher : student ratio allows tutor to devote more attention and time to each student and group ensuring optimum performance.  \n \n \n \n4. Regular update to parents via tutor and parents meeting session and sms broadcast. We believe in a clear line of communication with parents. Our customers are the most important people. \n \n \n5. There will be tuition tests in Feb, Apr, Aug and Oct. This allows us to effectively evaluate student's strengths / weaknesses and to work on them.This also allows students to put into practice what has been taught and \"warm up\" for coming exams. A feedback report will be issued.We also conduct FREE MOTIVATIONAL WORKSHOPS FOR ALL OUR STUDENTS TO BUILD THEIR SELF ESTEEM AND SET GOALS.  \n \n \n \n6. We have 4 systematic and successsful approaches termed the:-\" clockwork apporoach\"\"carrot apporach\"\"story telling approach \" Goal setting approach\" which have benefited our students. Fast and easy technique to tackle exam questions are taught. All while adhering to MOE syllabus.  \n \n \n \n7. We provide challenging in - house worksheet materials prepared by our experienced tutors which mirrors exam based queestions to supplement our use of popular assessment books. \n \n \n \n \n8. Our parents and students have given us favourable testimonials and the \"thumbs up\". Our student's 2013 and 2014 results and achievements have been very encouraging and a success. They also pick up other intangible skills during our lessons such as being responsible and being discipline. \n \n \n9. We believe in ' SCR\"- sincerity, commitment and being responsible     ",
        "title": "YISHUN PRI - SEC TUITION. COMMITTED TCR WITH 12 YRS TEACHING EXP,"
    },
    {
        "postid": "5956007939",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello, my name is Eduardo.  \nI am currently an undergraduate at the University of Manchester and I am completing my exchange year at Singapore Management University. \n \nI have taught tuition to various levels (Beginners to Proficiency Level in UK  for 2 years. I  am a teacher for both English and Spanish language. Overall, I have  been teaching for 4 years now in Spain, Manchester and Vietnam.  \n \n \n ",
        "title": "Spanish native offering English and Spanish lessons."
    },
    {
        "postid": "5956005928",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBackground: \n- I was head of the tutoring program of the National Honors Society at my High School in the US. I was in charge of the language program and I developed lesson plans and assigned tutors for Spanish and English classes. \n \n \nExperience: \n- I have tutored English as a Second Language (ESL) students within and outside my high School for about two years. \n- taught English at a school in Thailand for about two months last summer (1st to 8th grade) . \n- I have done a three-month photography project in which I took the opportunity to tutor vulnerable populations in Latin American on Photography and writing skills. \n \n \nFeel free to contact me for inquiries. \n \n \nSebastian \n \n \n ",
        "title": "Experienced English teacher"
    },
    {
        "postid": "5948445196",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi there! I'm Jay, a 24 years old South Korean. I am here to help you learning Korean! \n \nI am a native Korean speaker and I believe that having conversation with a native speaker is crucial for learning naturally.  \nI want you to feel comfortable and practice the language through casual conversation with a friend. \n(U can try a trial lesson with me to discuss what u are focusing on, looking for, and how I would lead lesson based on your preference. ) \n \nI lived in the US for 4 years (attended High school and University of Miami for a semester), so communicating in English will also not be a problem. \n \nIn addition, I have been teaching more than 9 foreigner students since I started online lesson in 2015 Summer . \n \nFor $13 per an hour, lessons can be taught via skype phone call or video call (kakaotalk as well) \n \nIf you are interested or would like to ask any questions then please feel free to message me at kakaotalk 'jayjjangjjang' or skype 'jayy7878'.  \n \nHave a good day!     ",
        "title": "Learn Korean from a native via Skype! (&#54620;&#44397;&#50612; &#44284;&#50808;"
    },
    {
        "postid": "5950861420",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWelcome to Online Spanish Lessons By The San Cristobal Language School  \n \nWelcome to Online Spanish Lessons \n \nThe San Cristobal Language School specializes in teaching high quality Online Spanish lessons over the internet via Skype and also in our school in San Cristobal de las Casas, Chiapas Mexico. \n \nWe are the Only Language School Owned and Operated by Professional Language Teachers. \n \nOur native-professional Spanish-speaking instructors are experienced teachers who make your Online Spanish lessons interesting and fun with interactive classes. \n \nWe are focused on making your Online Spanish classes experience at the Online-Spanish-Lessons.com a rewarding and fun adventure! Please welcome to explore Online-Spanish-Lessons.com! And we will be glad if you contact us with your questions about your Online-Spanish-Lessons.com. \n \nWe have a wide variety of Online-Spanish-Lessons.com designed to focus on the personal needs of each of our students. We also have Online Spanish lessons for those who have specific-personal needs. And if you are in San Cristobal de las Casas, Chiapas, Mexico and want to take Spanish-Lessons please come to San Cristobal Language School, where all our Online-Spanish-Teachers also teach.  \n \nMuchas gracias y bienvenidos! \n \nProfessor Luis Sarinana \nDirector  \nSkype LuisSarinana \nOnline-Spanish-Lessons///com \n ",
        "title": "Skype Spanish Lessons Online Native Teachers $ 9.99 US"
    },
    {
        "postid": "5950385652",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe offer professional yoga/pilates services to individuals and small groups across Singapore. Our qualified/experienced instructors come to your home or private space to conduct the classes.  \n \n \n \nCheck out www.vpsports.sg for more information     ",
        "title": "Yoga/Pilates Instructor - Comes to your home"
    },
    {
        "postid": "5946374576",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBonjour everyone! I am Vanessa and I am a French language tutor originally from France. My rates are SGD40 per hour and I am available to teach beginners and advanced levels. \n \nPlease click on Reply to find out more details.     ",
        "title": "French language tutor from France"
    },
    {
        "postid": "5950300711",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nACROBATICS - GYMNASTICS \n \nLESSONS FOR BEGINNERS AND ALL AGES \n \nMORE INFO &amp; CONTACT: \n \n show contact info \n \n \n ",
        "title": "ACROBATICS / GYMNASTICS LESSONS FOR BEGINNERS"
    },
    {
        "postid": "5955770762",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nINDIVIDUAL KEYPOINT O/N LEVEL TUITION COM SCI PHY CHEM MATHS ALL AREAS  \n \nTuition and revise thoroughly for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "INDIVIDUAL KEYPOINT O/N LEVEL TUITION COM SCI PHY CHEM MATHS ALL AREAS"
    },
    {
        "postid": "5947333985",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for reliable Piano Teacher for your child/children or yourself? Always wanted to play the Piano but don't know? We will make your dreams come true! If you have the will and desire, we have the expertise. Joyce Music Studio (JMS) is a privately run piano studio for discerning talent, young or not so young, beginner or advanced level, to discover your hidden musical prowess. Our mission is to simply provide a holistic and individualized piano or keyboard lessons in a friendly and well equipped environment. We conduct individual or group lessons for all ages and experience levels.  JMS is staffed only by full-time professionally accredited piano teachers only. Come and join us for interesting and creative piano/music lessons. We are located at Blk 502 Ang Mio Kio Ave 5 / Street 53, opposite the rear- gate of  Nanyang Polytechnic at the junction of AMK Ave 5 and Street 53. Across the road from Anderson Sec School. For a comprehensive tour of our services, please go to our web page or just call us at 6455 2116 for more information.  \n \nCtrl+Click to follow link - http://pianoteachersingaporejms.wordpress.com/ \n \nTeachers' Day Tribute to a Piano Teacher \n Dear Ms Lo, \n\" The Good Teacher explains, the Superior Teacher demonstrates, the GREAT Teacher inspires.\" My 10+ years of learning music from you has been filled with ups and downs and I definitely was not the best of students. But thank you for persevering and never giving up on me, always encouraging me along the way. In these 10 years you have taught me more than just music and have been more than just a teacher to me. So THANK YOU FOR THE MUSIC, THE BARE NECESSITIES OF LIFE     . . .. . .. . .. . ...Your inspired student, Chen Weiyi.  1st Sept 2011  \n \nCtrl+Click to follow link - http://joycemusicstudio.wordpress.com/ \n ",
        "title": "Piano Teacher. Piano Lessons. Keyboard Classes. Music Theory Revision"
    },
    {
        "postid": "5955556093",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Norah and I am a private English teacher. I am a native and experienced tutor with international experience, and I teach languages in Singapore to both kids and adults.  \n \nI am quite flexible for the hours and I can meet anywhere in Singapore. We can meet somewhere in a coffee shop, at your home or at your office. My rate is flexible and is depending on the location of your classes and their frequency. It ranges between 40 and 60 SGD per hour.  \n \nContact me through WhatsApp at +\n  show contact info \ndirectly. I now work with www.singapore-english-teacher.com and I will introduce you to another reliable native tutor I work with if my availabilities do not match yours. \n \nPlease WhatsApp me now to get the best possible rate at +\n  show contact info \n Satisfaction is guaranteed! \n \nThank you! \nNorah \nhttp://www.singapore-english-teacher.com/     ",
        "title": "Private English tutor from $40 per hour"
    },
    {
        "postid": "5953147799",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBonjour! My name is Haroun and I am from Tunisia. I am currently studying at Yale-NUS college. \n \nI have experience providing French lesson tuition to elementary school students. Please contact me to check my rates and availability. I am ready to meet up for classes anywhere in Singapore.     ",
        "title": "French lessons for primary school students"
    },
    {
        "postid": "5958504013",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nArt of Love \nLove failure? Dumped ?? Rejected ???  \nDon't worry!!!!!!!!  \nI will give you solutions!!!!!!!! \nI will train you and make you a master in love, any gender you desire will fall in love with you. \nAssessment will be done on appointments only \n \n100 % guaranteed success. \n \nDo Not Delay The Matter  \nSchedule an appointment immediately  \n ",
        "title": "Win Back your Love"
    },
    {
        "postid": "5957553171",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Alice Man and I am an English tutor from UK, in Singapore. \nI have experience in teaching basic and conversational English to individuals and to small groups. I have also taught English to children in Thailand. Contact me now to learn more about me and let's get introduced in order to improve your English! My rate starts from SG$40 per hour for private home classes. \n \n \nThank you. \nAlice Man \n ",
        "title": "Learn English with a UK tutor from SGD40 per hour"
    },
    {
        "postid": "5958549656",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTennis Coaches At A Venue Of Near You \nLooking for a Tennis Coach near you? Tennis Coaches that make house calls? Always wanted to play tennis but don't know how to get started? We will make your dreams come true. Singapore Tennis Coaching Services (STCS) is set up to provide professionally run tennis lessons by qualified and accredited tennis coaches for students and players of all ages and levels. Our lessons are tailored to the needs of each individual. Lessons are conducted on 1 to 1 basis but small group can also be considered. SCTS is staff with fulltime trainers with professional accreditation. With our rates are competitive and affordable. All you need is to pick a suitable day and a time, a venue of your choice and convenience, and we will be there. Call SCTS now @9 021 7831 \nhttp://tenniscoachingservicessingapore.wordpress.com/ \nAssorted Brands Pre-owned (used but like new)Tennis Balls For Sale \nPre-owned assorted brands tennis balls, as good as new,  suitable for friendly games and training purposes going for only as little as 60 cents each cash and carry. Call See Wai @ 90217831. Pick up at AMK Ave 5 Blk 502 Lift Lobby \"B\" directly opposite Nanyang Polytechnic in front of Anderson Sec School \nWhat Others Say - http://tenniscoachingservicessingapore.wordpress.com/  \n\"I can't say enough about the professionalism and skill he shows. . .. . .he was very accomodating and spot-on with helpful instruction for both of us. . .....P. Ray &amp; Jane. \n\"Attending his clinics/camps is one of the best bargains for improving your tennis. He is accessible, friendly, and have  incredible drills (fresh and new drills each time you go). They know how to make the experience fun and inclusive for all the players -- Kobayashi. \n\"My two children received unsurpassed expertise . They had a lot of fun while at the same time gaining significant tennis knowledge. . .. . .. . ... Celia &amp; Ray Chow  \n\"He is an exceptional teaching pros, with years of experience showed on court by every drill. He focus on details, but also create a friendly and enjoyable atmosphere during the clinics and private classes. . .. . ... Sharon. Bard  \n\"His tennis instruction was poised, deliberate, and intense. I had specific goals set to accomplish, met and exceeded my expectations. My level of play has raised since ........John.Bey \n\"Our group has been taking clinics from C.Y  for years, he has so much energy it's contagious. Every session has a positive outcome. . .......Jerald Ee.  \nMore reviews : https://tenniscoachingservicessingapore.wordpress.com/ \n ",
        "title": "Tennis Coaches. Tennis Lessons. Private Tennis Classes Avail islandwid"
    },
    {
        "postid": "5952983275",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJoyce Music Studio (JMS) -- The Piano/keyboard specialist \n(JMS) is a privately run studio (piano) for discerning talent, young or not so young, beginner or advance level, to discover their hidden musical prowess. Established since the mid 1970s, JMS have been conducting piano lessons leading to London's Associate Board of Royal Schools of Music (ABRSM) examinations or Trinity College. Or you could do it simply for leisure. Our curriculum covers beginner to diploma levels. We conduct individual/group lessons for all ages and experience levels, practical as well theory Come and join us for interesting and creative piano/music lessons in a comfortable home-based setting.. Centrally located in 502 Ang Mio Kio Ave 5, its within easy reach of  Toa Payoh, Braddell, Bishan, Upper Thomson, Yishun, Yio Chu Kang, Kovan, Hougang, Sengkang, Serangoon North, Serangoon Gardens , Lorong Ah Soo,  The French,  Australian  and American International Schools. Call us at 6455 2116. \nReviews - http://pianoteachersingaporejms.wordpress.com/ \nTeachers' Day Tribute to a Piano Teacher \nDear Ms Lo \n \"The Good Teacher explains, the Superior Teacher demonstrates, the GREAT Teacher inspires.\" My 10+ years of learning music from you has been filled with ups and downs and I definitely was not the best of students. But thank you for persevering and never giving up on me, always encouraging me along the way. In these 10 or more years you have taught me more than just music and have been more than just a teacher to me. So THANK YOU FOR THE MUSIC, THE BARE NECESSITIES OF LIFE. . .. . .. . .. . ...Your inspired student, Chen Weiyi.   \nI am thankful to you Ms Lo. You taught me how to focus and be disciplined. Thru your encouragement, I have done well not only in music but in school and daily life as well. Wonderful to have you as my music teacher all these years - Karan Lau  \nThank you for teaching me. I enjoy your lessons and have learned much. You are a wonderful teacher! -- Audrey Lo  \nIt has been a wonderful year learning the piano with you as my teacher. Thank you for all your patience and advice and for the knowledge you are imparting to me which is making my dreams come true. -- Kathryn Clarke  \n Thank you for a job well done. You had boost up Jervis's self esteem. He was feeling rather important about himself. I really appreciate your effort. . .. . . Serena Kang, Jervis's mother    \n Your special once-a-month group lesson is an excellent idea. It gives children an opportunity to showcase their talent, develop self-belief, confidence and improve social interactive skills. Outstanding!................. Ronda McMahon, Australian International School.   \nThank you for being such a blessing...for being so tolerant...thank you for believing in me when I was about to give up....for pushing me when I thought I could go no further. Above all, thank you for being my teacher! You are truly a wonderful piano teacher! Happy Teachers' Day!!   . . .. . .. . .. . .. . .. . .. . .  Andrew Ng \nWe wish to express our heartfelt gratitude and thanks for your teaching, care and guidance you had given our daughters for the past 9 years. Under your guidance, Li Lian's interest in piano and music had developed beyond our expectation. With your encouragement she has grown from an introvert child into a confident and musically creative teenager. My hushand, Peter and I would like to say A BIG THANK YOU for all the wonderful things you had done for Li Lia. . ...  Peter &amp; Wee Lee Koh \nThanks for your feedback. Your advice is noted. We will ensure Amanda spends more time to practise piano pieces. For your information, she was applauded and commended for her fine impromptu performance during the holiday with a chance to demonstrate her piano skill in a birthday banquet held for her grandparents in Shanghai. Many guests asked how and where we could find such a good piano teacher.\" Regards. . ... LK - Jan                                                    \nSeason Greetings. Just  like to thank you for your effort in enhancing learning and creativity in your lessons. We believe that the change will definitely go a long way in enabling our girls to be more aware of their potentials. We appreciate your varied teaching methods that is aimed to enrich their learning experience. . .. . .  Mrs June Wong \nThank you for coaching our son, Aidon. We have seen him gained much confidence while playing on his keyboard. Besides, he no longer finds practicing a chore but enjoys doing it to refine his skills. In the past, we used to see him getting frustrated whenever he's unsure about the pieces he's handling. Yet as parents, we are not able to coach him much as we do not have prior piano experience. We are relieved to see that Aidan is guided closely by you so much so that whenever he's home practicing, he knows exactly what to do. We are very blessed and grateful that Aidan has such a patient and motivating piano teacher like you. We look forward to Aidan taking his grraded piano exams under your professional guidance. Thank again. Regards. . .. . .. . .. . .. . ...Gerald \nMore reviews - http://pianoteachersingaporejms.wordpress.com/ \n ",
        "title": "Joyce Music Studio (JMS) -- The Piano/keyboard specialist"
    },
    {
        "postid": "5958549191",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for a #Piano Teacher near you? Scouting for a reliable and dependable Piano Teacher? Bitten by foreign nationals claiming to be piano teachers that are untrained, unreliable, with no work permits nor teaching credentials visiting Singapore on social pass ? You are safe with us, guaranteed! If you have the will and desire, we have the expertise. Joyce Music Studio (JMS) is a privately run piano studio for discerning talent, young or not so young, beginner or advanced level, to discover your hidden musical prowess. Our mission is to provide a holistic and individualized #piano lessons in a friendly and well equipped environment. We conduct #piano classes for all ages and experience levels. JMS is staffed with full-time professionally accredited #piano teachers. If you are residing in Bishan, Upper Thomson, Yio Chu Kang, Seletar, Kovan, Yishun, Hougang, Sengkang, Serangoon North, Braddell or Serangoon Gardens, we are within easy reach from you. Centrally located at Blk 502 Ang Mio Kio Ave 5 / Street 53 junction, opposite the rear- gate of  Nanyang Polytechnic. Or across the road from Anderson Sec Sch on Street 53. Contact us at 6455 2116.  \n http://pianoteachersingaporejms.wordpress.com/ \n \nTeachers' Day Tribute to a Piano Teacher \n Dear Ms Lo : Thank you for a job well done. You had boost up Jervis's self esteem. He was feeling rather important about himself. I really appreciate your effort. . .. . .. . .. . ...   Serena Kang, Jervis's mother    \nDear Ms Lo: Your special once-a-month group lesson is an excellent idea. It gives children an opportunity to showcase their talent, develop self-belief, confidence and improve social interactive skills. Outsantanding!............................ Ronda McMahon, Australian International School.   \nDear  Ms Lo : Thank you for being such a blessing...for being so tolerant...thank you for believing in me when I was about to give up....for pushing me when I thought I could go no further. Above all, thank you for being my teacher! You are truly a wonderful piano teacher! Happy Teachers' Day!!   . . .. . .. . .. . .. . .. . .. . .  Andrew Ng \nDear Ms Lo : We wish to express our heartfelt gratitude and thanks for your teaching, care and guidance you had given our daughters for the past 9 years. Under your guidance, Li Lian's interest in piano and music had developed beyond our expectation. With your encouragement she has grown from an introvert child into a confident and musically creative teenager. My hushand, Peter and I would like to say A BIG THANK YOU for all the wonderful things you had done for Li Lian. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . .. . ...  Peter &amp; Wee Lee Koh \nDear Ms Lo: Thanks for your feedback. Your advice is noted. We will ensure Amanda spends more time to practise her piano pieces. For your information, she was applauded and commended for her fine impromptu performance during the holiday with a chance to demonstrate her piano skills in a birthday banquet held for her grandparents in Shanghai. Many guests asked how and where we could find such a good piano teacher.\" Regards. . ... LK - Jan                                                    \nDear Ms Lo : Season Greetings. Just  like to thank you for your effort in enhancing learning and creativity in your lessons. We believe that the change will definitely go a long way in enabling our girls to be more aware of their potentials. We appreciate your varied teaching methods that is aimed to enrich their learning experience. . .. . .  Mrs June Wong \nDear Ms Lo: Thank you for coaching our son, Aidon. We have seen him gained much confidence while playing on his keyboard. Besides, he no longer finds practicing a chore but enjoys doing it to refine his skills. In the past, we used to see him getting frustrated whenever he's unsure about the pieces he's handling. Yet as parents, we are not able to coach him much as we do not have prior piano experience. We are relieved to see that Aidan is guided closely by you so much so that whenever he's home practicing, he knows exactly what to do, We are very blessed and grateful that Aidan has such a patient and motivating piano teacher like you. We look forword to Aidan taking his Grade 1 piano exam under your professional guidance. Thank again. Regards .Geraldine. \nDear Ms Lo: The Good Teacher explains, the Superior Teacher demonstrates, the GREAT Teacher inspires. My 10+ years of learning music from you has been filled with ups and downs and I definitely was not the best of students. But thank you for persevering and never giving up on me, always encouraging me along the way. In these 10 years you have taught me more than just music and have been more than just a teacher to me. So THANK YOU FOR THE MUSIC, THE BARE NECESSITIES OF LIFE. . .. . .. . .. . ...Your inspired student, Chen Weiyi  \n ",
        "title": "Piano teacher, piano lessons, piano classes"
    },
    {
        "postid": "5954418239",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nO/N LEVEL EXAM PREPARATION 121 TUITION COM SCI PHY CHEM MATHS ALL AREAS  \n \nProgressively prepare for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "O/N LEVEL EXAM PREPARATION 121 TUITION COM SCI PHY CHEM MATHS ALL AREA"
    },
    {
        "postid": "5953146181",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nNi hao! My name is Nicole Li and I am from mainland China. I have been tutoring since my university days and I was also a part time teacher for primary school. My specialty is the Chinese subject. \n \nI can help both adults and kids practice their Chinese - in writing and in speech. Contact me so that we can discuss the time and location for the classes. \n \nI look forward to hear from you.  \n \n \n \n \nNicole Li \n ",
        "title": "Chinese lessons with native Chinese teacher"
    },
    {
        "postid": "5947333053",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTennis Coaching Services In Singapore \n \nLooking for professional tennis coaches for tennis lessons? You are at the right place. Home Of The Professional Tennis Coaches In Singapore, Tennis Coaching Services Singapore is set up to provide private tennis lessons by licensed full-time professional, personal and private tennis coaches for students of all ages and at all levels. We are well known for tailoring our lessons to the needs of private individuals. All lessons are conducted on one to one basis but small groups can also be considered. Our rates are highly competitive and extremely affordable. All you need is to decide that you want to learn to play tennis or improve your tennis skills further, choose a day, a time and a venue of your choice and convenience, and we will be there. If you need more info, please do not hesitate to call your personal tennis instructor, See Wai @ 9 021 7831 now with no obligation. \n \nWhat others say    . . ....   \"Our group has been taking clinics from C.Y for years, he has so much energy it's contagious. Every session has a positive outcome. . .-- John Ee  \n \nFor more reviews plse go to :  \n \nPhoto Gallery - http://tenniscoachingservicessingapore.wordpress.com/ \nWhat Other Say - http://www.flickr.com/photos/tenniscoachessingapore/show/ \n \n\"I can't say enough about the professionalism and skill he shows. . .. . .he was very accomodating and spot-on with helpful instruction for both of us. . . --P.Ray. November 2008 \n \n\"Attending his clinics/camps is one of the best bargains for improving your tennis. He is accessible, friendly, and have incredible drills (fresh and new drills each time you go). They know how to make the experience fun and inclusive for all the players -- KOR.Oct 2007 \n \n\"My two children received unsurpassed expertise . They had a lot of fun while at the same time gaining significant tennis knowledge. . .. . .. . ... Ray.Chow September 2006 \n \n\"He is an exceptional teaching pros, with years of experience showed on court by every drill. He focus on details, but also create a friendly and enjoyable atmosphere during the clinics and private classes. . .. . ... S.Bard , November 2005 \n \n\"His tennis instruction was poised, deliberate, and intense. I had specific goals set to accomplish, met and exceeded my expectations. My level of play has raised --John.Bey Jan 2004 \n ",
        "title": "Tennis Coaching Services In SIngapore"
    },
    {
        "postid": "5950414042",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJoyce Music Studio (JMS) -- The Piano/keyboard specialist \n(JMS) is a privately run studio (piano) for discerning talent, young or not so young, beginner or advance level, to discover their hidden musical prowess. Established since the mid 1970s, JMS have been conducting piano lessons leading to London's Associate Board of Royal Schools of Music (ABRSM) examinations or Trinity College. Or you could do it simply for leisure. Our curriculum covers beginner to diploma levels. We conduct individual/group lessons for all ages and experience levels, practical as well theory Come and join us for interesting and creative piano/music lessons in a comfortable home-based setting.. Centrally located in 502 Ang Mio Kio Ave 5, its within easy reach of  Toa Payoh, Braddell, Bishan, Upper Thomson, Yishun, Yio Chu Kang, Kovan, Hougang, Sengkang, Serangoon North, Serangoon Gardens , Lorong Ah Soo,  The French,  Australian  and American International Schools. Call us at 6455 2116. \nReviews - http://pianoteachersingaporejms.wordpress.com/ \nTeachers' Day Tribute to a Piano Teacher \nDear Ms Lo \n \"The Good Teacher explains, the Superior Teacher demonstrates, the GREAT Teacher inspires.\" My 10+ years of learning music from you has been filled with ups and downs and I definitely was not the best of students. But thank you for persevering and never giving up on me, always encouraging me along the way. In these 10 or more years you have taught me more than just music and have been more than just a teacher to me. So THANK YOU FOR THE MUSIC, THE BARE NECESSITIES OF LIFE. . .. . .. . .. . ...Your inspired student, Chen Weiyi.   \nI am thankful to you Ms Lo. You taught me how to focus and be disciplined. Thru your encouragement, I have done well not only in music but in school and daily life as well. Wonderful to have you as my music teacher all these years - Karan Lau  \nThank you for teaching me. I enjoy your lessons and have learned much. You are a wonderful teacher! -- Audrey Lo  \nIt has been a wonderful year learning the piano with you as my teacher. Thank you for all your patience and advice and for the knowledge you are imparting to me which is making my dreams come true. -- Kathryn Clarke  \n Thank you for a job well done. You had boost up Jervis's self esteem. He was feeling rather important about himself. I really appreciate your effort. . .. . . Serena Kang, Jervis's mother    \n Your special once-a-month group lesson is an excellent idea. It gives children an opportunity to showcase their talent, develop self-belief, confidence and improve social interactive skills. Outstanding!................. Ronda McMahon, Australian International School.   \nThank you for being such a blessing...for being so tolerant...thank you for believing in me when I was about to give up....for pushing me when I thought I could go no further. Above all, thank you for being my teacher! You are truly a wonderful piano teacher! Happy Teachers' Day!!   . . .. . .. . .. . .. . .. . .. . .  Andrew Ng \nWe wish to express our heartfelt gratitude and thanks for your teaching, care and guidance you had given our daughters for the past 9 years. Under your guidance, Li Lian's interest in piano and music had developed beyond our expectation. With your encouragement she has grown from an introvert child into a confident and musically creative teenager. My hushand, Peter and I would like to say A BIG THANK YOU for all the wonderful things you had done for Li Lia. . ...  Peter &amp; Wee Lee Koh \nThanks for your feedback. Your advice is noted. We will ensure Amanda spends more time to practise piano pieces. For your information, she was applauded and commended for her fine impromptu performance during the holiday with a chance to demonstrate her piano skill in a birthday banquet held for her grandparents in Shanghai. Many guests asked how and where we could find such a good piano teacher.\" Regards. . ... LK - Jan                                                    \nSeason Greetings. Just  like to thank you for your effort in enhancing learning and creativity in your lessons. We believe that the change will definitely go a long way in enabling our girls to be more aware of their potentials. We appreciate your varied teaching methods that is aimed to enrich their learning experience. . .. . .  Mrs June Wong \nThank you for coaching our son, Aidon. We have seen him gained much confidence while playing on his keyboard. Besides, he no longer finds practicing a chore but enjoys doing it to refine his skills. In the past, we used to see him getting frustrated whenever he's unsure about the pieces he's handling. Yet as parents, we are not able to coach him much as we do not have prior piano experience. We are relieved to see that Aidan is guided closely by you so much so that whenever he's home practicing, he knows exactly what to do. We are very blessed and grateful that Aidan has such a patient and motivating piano teacher like you. We look forward to Aidan taking his grraded piano exams under your professional guidance. Thank again. Regards. . .. . .. . .. . .. . ...Gerald \nMore reviews - http://pianoteachersingaporejms.wordpress.com/ \n ",
        "title": "Joyce Music Studio (JMS) -- The Piano/keyboard specialist"
    },
    {
        "postid": "5957457507",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nKEYPOINT EXAM SIMPLIFIED  O/N LEVEL TUITION COM SCI PHY CHEM MATHS ALL AREAS  \n \nPrepare for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concept, exam question trend for combined science physics chemistry and mathematics for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "KEYPOINT EXAM SIMPLIFIED  O/N LEVEL TUITION COM SCI PHY CHEM MATHS"
    },
    {
        "postid": "5956000016",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi there. My name is Rod Brown. I have been teaching for 20 years and I have a BA and Dip. Ed from Monash University \n \nI like to work on phonics, pronunciation, enunciation &amp; creative writing to help my students improve their English. \n \nTo know more about me, click Reply or visit http://www.singapore-english-teacher.com/     ",
        "title": "English lessons by Australian teacher"
    },
    {
        "postid": "5953136307",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Sabiana and I am an independent native Italian tutor in Singapore. I am from Florence, Italy. I have experience in tutoring &amp; in teaching Italian to all ages from kids to adults. I can meet you at your home, at your office or in a coffee shop for the classes.  \n \nPlease send a WhatsApp message directly at +\n  show contact info \nwith your name, preferred location and availabilities for the Italian classes to get a preferred rate. I now work with several reliable female and male Italian tutors in Singapore, so it is possible that I will introduce you to one of them if my availabilities do not match yours. :-) \n \nI can teach Italian to kids and adults. All ages. All levels. The hourly rate range from 50 to 70 dollars, depending on your availabilities and frequency of the Italian lessons. Best rate guaranteed in Singapore for private Italian lessons. \n \nCiao! \n ",
        "title": "Private Native Italian Teacher in Singapore"
    },
    {
        "postid": "5953142066",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Nadine. I am originally from Germany.  \n \nI am a teacher in a language school. I love teaching the German language and culture. &#8288;&#8288;&#8288;&#8288;If you have a passion to learn about my country and our beautiful German language, I will be very happy to help you! \n \nPlease contact me via Whatsapp on +\n  show contact info \nor visit http://learn-german-singapore.com/ for more information.     ",
        "title": "Learn German language with a native speaker"
    },
    {
        "postid": "5955555744",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Shu and I have been living in Singapore for the past 6yrs. I am very fluent in English and I have some experience of tutoring small groups the Hindi language.     ",
        "title": "Language Tutor from UK"
    },
    {
        "postid": "5953099068",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi!  \nMy name is Raul. I am a DELE CERTIFIED Spanish teacher and have been teaching Spanish (DELE A1-A2, B1-B2, C1-C2 and IB Spanish) for more than 10 years. During all these years I have taught Spanish to students from USA, Japan, China, Indonesia, Australia, UK, Italy, Malaysia, Saudi Arabia, Qatar, India, Czech Republic and Indonesia. \n \nI enjoy teaching Spanish and love to see how my students are able to achieve their goals and become fluent in Spanish.  \nIf you wish to take the DELE or IB Spanish exams, I am the right person for you.  \nI have been helping many students to prepare for their exams specially at Advanced levels (DELE C1-C2 and IB Spanish HL) as well as professionals who wanted to improve their Spanish business skills with satisfactory results. \n \nYou can take a look at my profile on https://www.linkedin.com/vsearch/p?orig=SEO_SN&amp;firstName=Raul&amp;lastName=Barrera&amp;trk=SEO_SN \n \nI only teach Spanish online. \n \nCheers, \n \nRaul     ",
        "title": "SPANISH: IB/IGCSE/GCSE AND DELE TUTOR (A1-A2, B1-B2, C1-C2)"
    },
    {
        "postid": "5954405987",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBonjour ! \n \nI am a native French speaking certified teacher with international experience, offering private lessons online for adults and children. Individuals or small groups. \nMy classes can be designed to prepare students for high school and university exams as well as DELF and DALF exams. \nI also specialize in teaching business French to professionals. \nFor more information or to book an introductory class, please visit my website www.frenchviaskype.com \n \nÃ&#128; bientot ! \n \nLaure     ",
        "title": "French via Skype"
    },
    {
        "postid": "5949053246",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMaster Guitarist  \nstudied with Pepe Romero and Andres Segovia \nto name a few. \n \nwww.guitarkenbrown.com \n \nusing skype and a webcam \nI've taught students from China \nto London and beyond. \n \nLet me know if you have any interest \nand I will get back to you. \n \nCheers, \nKen     ",
        "title": "Classical Guitar Lessons"
    },
    {
        "postid": "5958530035",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am an experienced teacher, currently working at one of the bigger international schools. \nI can provide personalized help for students - understanding of concepts, problem solving and internal assessment. Contact me at 91360889.     ",
        "title": "IB Physics, IGCSE/MYP Sciences tutor"
    },
    {
        "postid": "5954332152",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDedicated, reliable, results driven tuition     ",
        "title": "Tuition"
    },
    {
        "postid": "5956007226",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nVanakam! I am Sripad and even though English is my  first language, I am also fluent in Telugu and Tamil. I have excellent communication skills. \nI am a senior robotics tutor having conducted 10+ workshops and trained over 1500+ students in India in robotics. Being good in electronics, I can help students with their projects and teach microcontrollers and programming languages like C++ and Matlab coding also.     ",
        "title": "Tamil/Telugu language tutor - also fluent in English"
    },
    {
        "postid": "5957260043",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for an affordable art class to improve your basic art skills? Enroll today: http://skl.sh/2ilRIjb new members pay only $0.99 for the first 3 months on Skillshare!  \n \nThis class is for beginners in art who have very little to no art foundation. I have carefully created a detailed series to help students who are not confident with their drawing skills to improve slowly on their foundations skills. \n \nEach lesson will feature a class exercise which will be the assignment, and I encourage students to share your work each time you finish it, or even if it is in the work-in-progress stage. \n \nExcited to get started on this class? Enroll today: http://skl.sh/2ilRIjb \n \nThe class is designed for students who have no art foundation and are looking to gradually improve over time at their own pace. If that sounds like you, then sign up! \nEach class is only about 15 to 20 miuntes long and it's broken up into 5 minutes segments. I also provide assignments so that I can help you improve as we go along. \n \nI believe strongly that practise makes things better, perhaps not perfect, and I hope to be able provide that help and support that beginner students need to flourish.  \n \nIf you have any questions about the class, feel free to email me :)     ",
        "title": "Art Fundamental Class"
    },
    {
        "postid": "5947622737",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEXAM PRACTICE REVISION TUITION, COM SCI PHY CHEM MATHS ALL AREAS \n \nExam focus revision, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "EXAM PRACTICE REVISION TUITION, COM SCI PHY CHEM MATHS ALL AREAS"
    },
    {
        "postid": "5957598380",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGuardianship, airport transfer, laundry service, tuitions &amp; meals.  \n \nComfort bedroom with aircon &amp; free Wi-Fi.  \n \n3 mins walk to Mrt, shopping Mall, food court, fast food restaurants &amp;  coffee shops. Opp. Sports hall with Badminton courts &amp; gym. Swimming pool &amp; stadium opposite too.     ",
        "title": "Homestay for foreign students"
    },
    {
        "postid": "5947476677",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nInvest in yourself! A top tier GMAT score could be the greatest investment in yourself you will ever make. An MBA from a highly ranked business school shoud give you the edge you'll need to be competitive in hiring and career progression. Obtaining an amazing GMAT score is not simple though; getting a high score takes work, commitment, and determination. \n \nI understand the GMAT. I can assist you to learn it, as I did. I'm professional GMAT tutor, and I can make certain that every second spent preparing will undoubtedly be beneficial and present you a good return on your investment. We will first determine your GMAT goal score, then examine the things you need to accomplish to obtain it, and we'll devise a study plan based on your strengths and weaknesses. Subsequently, when the actual work begins, I will be there to coach you through any rough spots you have, keep you on course, and  help you stay motivated to make that investment pay large returns. \n \nContact me today to so we can set up a plan.     ",
        "title": "Climb the GMAT Mountain and Seize The Day"
    },
    {
        "postid": "5955554515",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi, my name is Jeremy. I am originally from France. I used to be a tutor in a high school for disabled students for 1 year. I am able to reach out to special children and help them improve their English. \n \nIf you need my assistance, contact me today and I shall be happy to answer any questions. \n \n \nHave a good day, \nJeremy     ",
        "title": "English tutor - experience with disabled children"
    },
    {
        "postid": "5955985307",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusical Art Studio offers courses (group or individual) for ABRSM Music Theory Grade 5 exam preparation. \n \nPlease, contact the Musical Art Studio at 63382469 or send an e-mail to: \n  show contact info \n if you need more details.  \n \nMeanwhile, you may look through the studio website:  \nwww.musicalartstudio.info     ",
        "title": "Music Theory Course for Grade 5 exam"
    },
    {
        "postid": "5946364062",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMy name is Morgan. Bonjour! \nI am from France and I am a native French speaker. \n \nMy rate starts at SGD40 so do contact me for other details.     ",
        "title": "French language tutor (Native speaker)"
    },
    {
        "postid": "5953641066",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMusical Art Studio offers a course for ABRSM Music Theory Grade 5 exam preparation. The nearest exam date is 25 March 2017 \n \nPlease, contact the Musical Art Studio at 63382469 or send an e-mail to: \n  show contact info \n if you need more details.  \n \nMeanwhile, you may look through the studio website:  \nwww.musicalartstudio.info     ",
        "title": "Music Theory Course for Grade 5 exam"
    },
    {
        "postid": "5947591127",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWant to expand you knowledge and skills? \n \nWant to add abilities and positive details to boost your resume? \n \nThis is a chance of a lifetime! \n \nInspizone is conducting Accounting for Non-Financial Professional this coming February 9 and 10 2017. \nIt is SkillsFuture, SDF, or PIC claimable, There's a chance you can join the course with no upfront payment. email us at \n  show contact info \n or \n  show contact info \n for more details! \n \nyou can visit our website too at http://www.inspizone.com/     ",
        "title": "Accounting for Non-Financial Professional"
    },
    {
        "postid": "5910408084",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are one of the best music school in Singapore, based in the West region of the country.  \nStarted out in 2008, Doreimi Music School has expanded since then and we now have a total of 2 branches catering to both the East and West region estates across Singapore.  \n \nOur school offers a range of music courses, ranging from exam based structured learning to Leisure based classes.   \n \nOur Specialization: Piano, Violin, Flute, Acoustic Guitar, Ukulele and Music Theory.  \n \nCourses offered are suitable for both children and adults, and lessons are conducted on 1 to 1 basis - paced according to each and every individual's learning capability.  \n \nDoreimi also offers opportunities for students to engage in various activities, participating in school internal and external events of performing nature.  \n \nFor more information on students' achievements and upcoming performances, please refer to our school website: http://www.doreimi.com.sg or reach us at facebook: https://www.facebook.com/Doreimi-Music-School-175273695816734/ \n \nOur Location: Blk 342 Jurong East St 31 #03-01, Singapore 600342 \n \nContact: 6560 0190 / 9089 0926 \n \nOperating Hours: Tues - Fri - 3pm to 9pm &amp; Sat, Sun - 9am to 5pm. \nClosed on Public Holidays &amp; Doreimi School Holidays!     ",
        "title": "Violin Lessons(Exam/Leisure) for Kids/Adults in Singapore, Jurong"
    },
    {
        "postid": "5953135400",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI have been giving private French tuition lessons and helping youngsters from 12 years old to 18 years old for 5 years. I mostly teach mathematics and French and my students enjoy my classes very much. \n \nIf you have children who will need my assistance, do contact me. All inquiries are welcomed. \n \n \n \n \nPauline \nwww.singapore-french-teacher.com     ",
        "title": "French tutor with experience teaching children"
    },
    {
        "postid": "5952691369",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPrivate Tennis Lessons, Tennis Classes Is The Way To Go \nWorried about it being your first time on the court? Whether you are a beginner or advanced tennis player, taking a private lesson is the best way to learn the correct basic strokes, identify bad habits, improve current strengths, or expand your overall tennis skill. It's the quickest way to improve allowing you to find your comfort zone. Private lessons are more interactive and mentally challenging but extremely rewarding. Instructions are more personalized and skill specific. Lessons are more detailed and are tailored to your level, work-ethic and personality. What better way to \"fast track\" your improvement than through a private lesson? We offer lessons seven days a week with our highly experienced coaches who have a sharp eye for detecting problems. They will find ways to improve your game quickly. Private lessons are suited to all ages and abilities. Call your personal tennis instructor and Hd Coach, See Wai @ 9 021 7831 now.  \nReviews - http://tenniscoachingservicessingapore.wordpress.com/ \nThe difference is one on one coaching!!!! Try It And It Will Become Obvious.  \n ",
        "title": "Tennis Coaches, Tennis Lessons, Tennis Classes"
    },
    {
        "postid": "5929266722",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n- First FREE trial lesson without commitment. \n \n- Try a new way to learn Spanish, wherever you want and whenever you want. We're flexible to your timetable. \n \n- Native and experienced teachers from Spain and Latin America. \n \n- Tailored Spanish lessons as low as $10 USD. Discover our great packages! \n \n- Whatever you need: Spanish for different levels, Spanish survival, Spanish for children, for specific purposes... \n \nDiscover the most fun and effective way to learn Spanish! \n \nVisit our website: www.spanishskype.org \nSkype contact: SpanishSkype School \n \nSpanish Skype \nSpanish lessons Skype \nSpanish classes online \nNative Spanish teachers \nNative Latin American teachers \nSpanish lessons online \n ",
        "title": "SPANISH CLASSES ON SKYPE FROM ONLY $10 WITH NATIVE TEACHERS"
    },
    {
        "postid": "5920577756",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExperienced and trained teacher specialises in ENGLISH LANGUAGE, LITERATURE and GENERAL PAPER.  \n Lessons conducted at student's home. \n Call 98214669 \n ",
        "title": "ENGLISH, LITERATURE &amp; GENERAL PAPER TUITION IN SINGAPORE"
    },
    {
        "postid": "5954252435",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAlways wanted to learn how to play tennis but don't know how to get started. \nTennis is a fun life long sports where a 7 yrs old child to 70+ yrs can learn and play. A \ngreat way to keep fit, connect with friends and family bonding activity. \n \nI am FULL TIME Coach with Professional Tennis Registry(PTR) and (AATC)  \nInternational accredited certification with a couple of years of  \ncoaching experience with Kids, teenager and Adult (beginner and Intermediate).  \n \nIf you are a beginner looking for a coach to help you learn the right basic \ntechnique as you embark on this fantastic sports or intermediate player looking \nto brush up your basic tennis stroke, identify and correct your bad or wrong hitting strokes or \nlooking to bring your game to the next level , you have come to the right place. \n \nFun kids lesson with games and using low compression balls and adults individual or group lessons at all location except west area. \n \nFeel free to write to me - Kelvin Goh or watsapps at Tel:9792-6990     ",
        "title": "TENNIS LESSONS for Kids and Adults with Pro Tennis Coach"
    },
    {
        "postid": "5952690530",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAlways wanted to Play the Piano but don't know? We will make your dreams come True! If you have the desire, we have the expertise. Joyce Music Studio (JMS) is a private piano studio for discerning talent, young or not so young, beginner or advanced level, to discover your hidden musical prowess. Our mission is to simply provide a holistic and individualized piano or keyboard lessons in a friendly and well equipped environment. We conduct individual or group lessons for all ages and experience levels.  JMS is staffed only by full-time professionally accredited piano teachers. Come and join us for interesting and creative piano/music lessons. We are located at Blk 502 Ang Mio Kio Ave 5 / Street 53, opposite the rear- gate of Nanyang Polytechnic at the junction of AMK Ave 5 and Street 53. Across the road from Anderson Sec School For a comprehensive tour of our services, please go to our web page or just call us at 6455 2116 for more information.  \nhttp://joycemusicstudio.wordpress.com/ \n ",
        "title": "Piano Lessons, Piano Teachers, Piano Classes"
    },
    {
        "postid": "5947636483",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThank you for being interested in learning Korean. \nHere are several things about me. \n \n1) I was born and grew up in Seoul. I graduated from University of Seoul and a certified Korean and English teacher with 7 years of teaching experience.  \n \n2) How do I teach?  \n \nWhat I do best is that I can lead lessons to what you need whether it's a daily conversation or business Korean or TOPIK. I prefer conversational approach and use books, picture cards , vocabulary quizzes , TV news , and K-POP lyrics depending on your level and interests. Currently, I have Korean learning blog/ Facebook page where you can learn Korean through K-POP lyrics. \n( http://koreanthroughkpop.blogspot.com, http://www.facebook.com/koreanthroughkpop)  \n \n3) One more advantage :  \n \nMy Chinese skill is intermediate (HSK level 4 acquired last year). This will definitely help you understand the formation of Korean words because 70% of them are based on Chinese characters. I lived in Shanghai and Beijing for a year to study and work for an international freight forwarding company before. \n \n4) How many students do I have? \n \nI have 10 students in total.Their occupations are various such as English teachers, office workers, a lawyer , a paramedic , etc.  \n \n5) My hour rate?  25USD by Paypal \n \nI offer you a free trial lesson and then you can decide if you want to work with me or not.  \nMy rate could change depending on your hours of one lesson. Also, group lessons are available and the rate is negotiable.  \n \n6) One more thing to say with my other services  \n \nI am very serious at teaching, so I won't let you waste your time and money. I always give you homework and test you. I feel proud of myself when I see my students' lives becoming easy in Korea. So I always do my best. Please feel free to email me for more information or you can visit my Facebook  \nhttp://www.facebook.com/seo.eunha \n \nAlso, I offer English-Korean translation service. I helped a few foreigners find a housing , buy a car, file a report in Korean to the court of law , and visit their Korean families.     ",
        "title": "Native Korean Tutoring &amp; Translation Service"
    },
    {
        "postid": "5954632469",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nKEYPOINT O/N LEVEL 121 TUITION COM SCI PHY CHEM MATHS ALL AREAS  \n \nPrepare thoroughly  for exam or test, go through the school homework and remedy any weak point \n \nHome individual tuition 121 at the student home \n \n1 tuition lesson of 1.5 hr is $40 , inclusive of books provided.  Useful tip and method of revising for test and exam.  \n \nTuition is step-by-step, intensive for the weak and slow, simple explanation of key concepts, exam question trend for combined science physics chemistry and maths for O/N level will be explained thoroughly and clearly.  \n \nFor more information, please sms me, Mr Lee,  92297801.  \n \n \n \n \n ",
        "title": "KEYPOINT O/N LEVEL 121 TUITION COM SCI PHY CHEM MATHS ALL AREAS"
    }
]