[
    {
        "postid": "5937030247",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello all \n \nI am looking for a good looking and open minded girl to be my date for a wedding i have to attend in Melbourne in January. The trip is all expenses paid for including accommodation at hotels and a trip to Sydney and Gold Coast after the wedding. It also includes all ticket prices paid for any activities in Gold Coast. \n \nI am single and recently broken up and need to blow off some steam. I do not want to attend this wedding alone and am looking for a fun, open minded companion for my travels. The trip is from 14th Jan for 16 days. \n \nPlease feel free to contact me or drop me an email with a photo of yourself and some details included. I would love to meet you so we can get to know each other better before the flight to Australia. \n \nThank you for your time. \n ",
        "title": "travel buddy all expenses paid"
    },
    {
        "postid": "5942834996",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDo you want new chalenges? \nDo you want to grow in your position? \nDo you want a creative position? \nDo you have your own computer? \nDo you have basic computer skills? \n \nAre you motivated? \nAre you ready for new training and education? \nAre you ready for a brand new position? \n \nEmail for more information \n ",
        "title": "Motivated Marketing"
    },
    {
        "postid": "5897385034",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for a sales executive.  \nWebsite Design Company.  \n \nThis is a part-time role working from Yishun Home Office of Manager.  \n \n3 working days, 5 hours (Mon to Wed) \nPay is $8 an hour. with additional commission of 10% of total sales amount brought in by executive.  \n(Starting sales target is just 3 per month. Commission Percentage will increase if more projects brought in) \n \nAchieving sales target \nMain goal is driving up customer enquiries and web design sales.   \n \n \nRoles &amp; Responsibilities \nValue-add to current product sales by promoting related products \nDevelop good product knowledge and market awareness \nHandle sales enquiries from customers \nProvide customers with satisfactory proposals \nEnsure sales target/quota is met  \nSecure new business by executing effective sales strategies \nPlan and work towards meeting sales targets \n \n \nJob Requirements \nComputer literate \ngood communication skills.  \nenergetic, creative and takes own initiative \nOrganized, independent and resourceful with high drive to work \nIT savvy \nstrong marketing skills experience would be desired.  \nexperience with online marketing like social media - facebook, classifieds etc. is desired \n \nPlease email your interest     ",
        "title": "Sales and Marketing Executive Position"
    },
    {
        "postid": "5918659783",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMaison Ikkoku looking for full time positions of:- \n \n1. Marketing and Events Manager \n2. Events Co-coordinator  \n \nplease email detail CV with recent photo to \n  show contact info \n ",
        "title": "Marketing and Events Manager"
    },
    {
        "postid": "5943043497",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a local company looking to engage marketing agents to promote our Pre-launch App product in Apple App Store and Google Play Store. \n \nMore details will be provided upon engagement. Please reply to set appointments. \nThank you.     ",
        "title": "Marketing Agents Needed Urgently"
    },
    {
        "postid": "5939183381",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDo you want new chalenges? \nDo you want a creative position? \nDo you have your own computer? \nDo you have basic computer skills? \n \nAre you motivated? \nAre you ready for new training and education? \nAre you ready for a brand new position? \n \nEmail for more information \n ",
        "title": "Motivated Marketing"
    },
    {
        "postid": "5926636583",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWork From Home 1-2 Hours Per Day ($4,000/month + Incentives) \n \nI'm looking for 20 individuals able to work Part-Time 1-2 Hours a day. Up to $1,000 per week inclusive of incentives. \n \nWork-scope includes of, \n- Copy and pasting \n- Social media marketing (Facebook/Email) \n \nIndividuals interested in applying, please complete the application form here: http://mttbapplication.pagedemo.co/ \n \nInterested applicants will be required to participate in a training. We will short-list and notify you via email. \n \nComplete this application form now: http://mttbapplication.pagedemo.co/     ",
        "title": "Work From Home 1-2 Hours Per Day Opening [$3,000/month + Incentives]"
    },
    {
        "postid": "5919947779",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for  \nRESELLER in MOBILE COMMERCE business \n \nBenefits: \n&#8776; Small startup capital will get you business tools \n&#8776; Can start Immediately \n&#8776; Low to No Risk business, simple return of capital inlay \n&#8776; Can enjoy benefits from partner vendors first, before sharing with others \n&#8776; Operate the business from anywhere and anytime \n&#8776; Age from 18 - 65, know how to use internet and smartphone \n \nResponsibilities: \n&#8776; Grow your own business, with teamwork support \n&#8776; Must undergo Company training for the shared objectives and marketing  \n&#8776; Promote vendors that are partnered with company \n \nResellers to be Motivated, Positive with a Can-Do Attitude! \n \nLimited to Applicants with the Right Attitude, so Don't Lose out by not providing contact details! \nEmail with name, contact number. \n \n \n \n \n \n ",
        "title": "M-Commerce Business Reseller"
    },
    {
        "postid": "5955340985",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a 6 month rolling contract with a singapore based start up in the e-commerce world. \n \nAbout you \nYou are a driven, self motivated, energetic and curious and entrepreneurial young professional. You need to be a star in generating/creating content, researching, editing videos, editing images and managing multiple priorities. Your sole game is content creation for social media and marketing coordination - you will likely have some training in graphic design or video editing. Thats it. You will be a one man/woman team supported by two cofounders who are hands on. Most likely will work out of a co-working space or remotely as needed. There will be 1-2 days a month when weekend work is required but we are super flexible with regards to time off and working arrangements. We don't care what qualifications you have or dont have...  as long as you understand the above - we will test your knowledge during interview but most of all we want to see your energy and attitude. \n \nRequirements:  \n* Adobe Photoshop/Indesign/Premier skills get you to the top of the list \n* Strong layout skills with a strong foundation of design fundamentals and colour theory. \n* Excellent English language written communication skills \n* up-to-date with new media; digital and social media savvy \n* Self-motivated, target driven, and able to work independently \n* Strong team player with a focus on productivity and deadlines \n* A perfectionist with an eye for detail down to the last pixel. \n* We like designers who ask questions and strive for quick, continuous learning. \n* Good attitude and personality. \n* able to think of the box \n \nAbout us \nWe are two co-founders running two e-commerce businesses and super excited about the prospect of bringing in someone on-board. The business is in the personal care business (skincare, hair, baby-care, etc) we are focused on promoting high quality products that are safe, ethical and eco in nature. The industry we are in is worth over 400 Billion annually and its experiencing disruption through a change in people's mindset and values.  \n \nWhat's in it for you:  \n- An opportunity \n- 1.8K per month \n- Quarterly bonus tied to KPI's \n- Experience &amp; exposure: you get be part of a brand new start up and see how the business is built ground up. You will take part in strategy, tactics, interviews with industry practitioners &amp; business founders, etc \n \n1/2 yearly revisions of salary tied to your performance and impact to bottom line.     ",
        "title": "Digital Content &amp; Marketing Hustler"
    },
    {
        "postid": "5939818962",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nStay home mum, student who wants a headstart, young people and those willing to take risk to follow their dream \nIf you have a job with no boss and no overhead expenses and could work your own hour at home with an excellent income, would you be interested? I help people start their own home-based business with no risk. Contact me now for more information and to set up an appointment \n•\tWhatsapp/text me at:- mobile - \n  show contact info \nor \n  show contact info \n \n•\tEmail - \n  show contact info \n    or    \n  show contact info \n \n \nI like to gift you with these very informative and useful ebooks below. Just send me an email to request and I will send them to you FREE! \n1. Ultimate Social Media Plan \n2. Tip &amp; Tricks for success for Young Entrepreneurship \n3. 55 graphics with health and fitness quotes for you to post in your social media \n ",
        "title": "Home-based, Part Time"
    },
    {
        "postid": "5953004225",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for Sales &amp; Marketing Freelance agent and we have attractive commission and basic of $50 per day even if there is no sales made that day! Kindly email your latest resume n photo to  \n show contact info  \n . We regret that only shortlisted candidate will be contacted for an interview.     ",
        "title": "Sales &amp; Marketing FreelancAgent needed! High Commission &amp; basic!!"
    },
    {
        "postid": "5934978594",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for self-motivated individuals to expand our team in Singapore upon our Companies launch in 2017. The company has experienced massive success already and will continue to increase in revenue. Work can be done on a spare time or part time basis. Opportunity to change your family's financial future. \n \nThe ideal candidate is competitive, energetic, passionate and aggressive in their pursuit of excellence. Successful candidates will advance to higher-level positions within the organization. Must live in Singapore and speak English. No VISA Sponsorships! \nRequired: \nDesire to Succeed \nMust be Coachable and Teachable \nWilling to Work Hard \nCommitment to Consistency \nAttend Weekly and Monthly Trainings     ",
        "title": "Elite Leaders"
    },
    {
        "postid": "5937333776",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCompany's Location: Mountbatten \n \n \n \nLooking for people who are willing to learn and is interested in games and marketing \n \nSingaporean and PR (18 - 25 years old) only \n \nFriendly and fun working environment \n \nNo experience needed and training is provided \n \n \n \nFor any inquiries or any candidates that is interested kindly SMS or Whatsapp Kenneth @ 969*** \n \n \n \nInformation Required: \n \nName  \n \nAge \n \nBrief description of your work experience     ",
        "title": "Become an exclusive marketing reseller"
    },
    {
        "postid": "5923939733",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n*NEW*  \nNSF AND ORD PERSONNEL WANTED  \n \n \n**Part Timers: $300-$500/ week \n \nWe are looking for people to assist in a local brand expansion project for a Singapore-based branding \n \nDescription: \n-Singaporeans preferred \n-Able to start immediately! \n-LIMITED to 8 more vacancies available \n-Students/graduates aged 18 &amp; above preferred! \n \nSMS NOW, your name, age as of now, nationality and current doing to YJ @ 90172053 to arrange an interview and find out more! \n \n*Text to YJ @ 90172053 or Jaye @ 96461905 for faster replies \n*Will not reply if SMS does not contain required basic info stated above     ",
        "title": "LOOKING FOR NSF/ORD PERSONNEL &amp;&amp; STUDENTS"
    },
    {
        "postid": "5911742685",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for \"Marketing Cum Project Coordinator\" to join our team! If you love working in a fast-paced rewarding environment, then we want to talk to you! \n \nResponsibilities: \n \nSystems in Marketing (Events/Roadshows) \nSales training and team leadership \nPeople development and management \nLeading in marketing campaign management and development \nQuality Control, Project/Sales management and Client relationship \nExcellent Communication Skills Perform administrative duties such as attending and receiving customers, answering phone calls, filing, office maintenance \nHandle all general office administrative functions \nCoordinate day-to-day staff operations and maintain records \nAny other ad-hoc duties assigned \nLimitless initiative, drive and maturity \n \nRequirements: \n \nAt least an O levels or Diploma \nWilling to multi-task and meticulous with work \nEffectively bilingual \nExcellent spoken communication skills \nDynamic personality \nEnjoy working with new people \nTraining will be provided \nFull-Time position(s) available. \nInterested candidates, kindly apply online together with your detailed CVs stating your salary expectations and availability. \n \n(Only shortlisted candidates will be notified) \n \nEmail: \n  show contact info \n \nContact Us @ 63232171 \n \nVisit our website @ http://imodelsholdings.com/marketing-cum-project-coordinator-imodelsholdings/ \n \nhttp://www.jobstreet.com.sg/en/job/5587385/sources/1/origin/sg     ",
        "title": "Marketing Cum Project Coordinator - iModels Holdings"
    },
    {
        "postid": "5918662043",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMaison Ikkoku looking for full time positions of:- \n \n1. Marketing and Events Manager \n2. Events Co-coordinator \n \nplease email detail CV with recent photo to \n  show contact info \n ",
        "title": "Marketing and Events Manager"
    },
    {
        "postid": "5919984442",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n=&gt;Gross salary $900/mth + commission ($100 per case) \n=&gt; 2 shifts available = 9am till 2pm/ 12pm till 5pm \n=&gt; Full time position 5hrs daily \n=&gt; CPF provided \n=&gt; Students are welcome to apply. \n=&gt; ONLY Singaporeans / PR's \nInterested please call to +\n  show contact info \n ",
        "title": "SIGNBOARDS CARRIER PROMOTER CUM FLYER DISTRIBUTING"
    },
    {
        "postid": "5908969857",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nJOB RESPONSIBILITIES: \n \n- Responsible for the company's marketing efforts from end to end, from development, idea generation, marketing strategy, execution and implementation \n- Increase the company's awareness online and, ultimately drive sales and increase market share both online and offline \n- Develop, co-ordinate and deliver outstanding digital communications across platforms (social media, website, partners etc.) \n- Create content resources to drive leads, subscribers and awareness \n- Optimize marketing automation tools (from CMS) and lead nurturing processes through email, content, and social channels \n- Generate ideas and create tactical promotions and campaigns with the key objective of generating leads \n \nJOB REQUIREMENTS: \n \n- Diploma / Degree in Marketing / Business Management or equivalent \n- At least 1 to 2 years' experience in executing marketing campaigns and strategies \n- Competent in website and marketing material content creation and management \n- A self-motivated individual who is able to work in a fast paced environment \n- Possess excellent verbal and written communication skills \n- Able to prioritise and manage multiple and competing demands in a timely and professional manner \n  \nInterested applicants kindly submit your resume in Microsoft Word document to \n  show contact info \n. Alternatively, you may fax your resume to us at 3151-8308. \n \nPlease include in your resume the following information: \n \n(1) Reason(s) for leaving your current and/or previous employment(s) \n(2) Availability / Notice period required \n(3) Current / Last drawn and expected salary \n(4) Recent photograph \n(5) Names and contact numbers of 2 character referees relating to your previous employment(s) \n \nWe thank you in advance for your interest in applying for this position and shall get in touch with you as soon as you have been shortlisted. \n  \nEA Registration No: R1103530 \nEA Licence No: 05C3767     ",
        "title": "Marketing Executive"
    },
    {
        "postid": "5940318318",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi i m looking for business partner. Please contact me 82317200 for further discussions. Whatsapp only.     ",
        "title": "Need business partner urgent"
    },
    {
        "postid": "5951292493",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTravel like an insider by getting Certified in Travel!!! \nGet Certified For 50-60$ in this 8 Trillion dollar industry. \nGenerate 1000$ monthly income from our Refer a Friend Program \n \n \nWRITE THIS DOWN!! \n \nGo to yrba.globalplatinumservices.com \nGo to Opportunity, Join us and Select distributor, find your country and language!!!     ",
        "title": "Platinum Plus Travel Agent at GPS"
    },
    {
        "postid": "5897142308",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCompany Overview \nAscenshoppe is committed to bringing to the market a portfolio of the highest quality health and beauty solutions that improve one's quality of life and extend the healthy life expectancy. We introduce essential beauty and wellness products from Japan, New Zealand and USA that align and satisfy consumers' every-growing desires and needs. Check us out at www.ascenshoppe.com.sg ! \n \nJob Scope / Responsibilities: \nYou will work closely with the Marketing team supporting clients with content development and marketing ideas for social and online platforms. \nAscen Resource values our interns for their strong design sensibility and promotes their professional development during the term. You will have the opportunity to learn to meet daily, weekly and long-term deadlines in a fast-paced environment; therefore the ability to take creative directions and work independently is a must. \n \nKEY RESPONSIBILITIES: \nEnsure the correct corporate policy and brand standards are followed for all printed and displayed materials \nAssist in managing Ecommerce and Facebook respond to queries \nCoordinate marketing POP deliveries \nMerchandizing of stores and first hand marketing research \nReporting of market findings \nImplement new initiatives for the merchant team to automate processes and speed up the current flow. \nWork with networks and merchants to ensure accurate information is being captured \n \nTALENT PROFILE: \nOpen to students who are seeking for internships/work attachment \nEquipped with skills in the use of PowerPoint, Word and Excel \n \nHOW TO APPLY: Please write in with your detailed resume and email us at \n  show contact info \n ",
        "title": "Looking for Marketing Intern! (Minimum 3 months)"
    },
    {
        "postid": "5908855733",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities  \n \nYour job will be to be a Interviewer (Field Work / Internet Growth Hacker) for CusJo - The Smarter Survey Analytics Company for StartUps, Professionals and Enterprises.  \n \nYou will be expected to identify respondents on behalf of our clients and get accurate and comprehensive responses for our clients to get the volume, variety and veracity of intelligence they require to assist them as part of their customer journey, market research and talent optimation analytics needs.  \n \nThis will require you to identify potential respondents and interact with them in a multitude of ways from face-to-face dialogue or using digital channels.  \n \nIf you perform your job well to the level of excellence we require, you will be invited to do more projects with us around the world as well as be given an opportunity to build your own team of Market Research Interviewers. \n \nIf you get past the interview stage you will also be provided with a comprehensive onboarding program  in which you will be brought up to speed on the principles of audience dialogues, respondent selection as well as on how to validate the quality of responses collated by your team if you are in a leadership position.  \n \nApply here to arrange for a faster interview. https://cusjo.cusjo.com/interview \n \n \nRequirements \n \nYou are expected to get out into the world, interact with a large number of people and: \n \n1) Have great commuication skills, be highly energetic and not let poor experiences get you down.  \n \n2) Be highly personable - warmly, welcoming, friendly, approachable and have a genuine curiosity about people.  \n \n3) Be highly professional - build domain knowledge in the field of intelligence gathering and have the competency to comprehend and answer the audiences questions and queries accurately and with sentivity.  \n \nApply here to arrange for a faster interview. https://cusjo.cusjo.com/interview     ",
        "title": "Market Research Interviewers (&gt; SGD 200 per day)"
    },
    {
        "postid": "5919582805",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis business has the potential to not only increase your income, but change your life!  \n \nIf you believe that there must be a better way to generate a significant income and create the life you desire, we would love to connect with you.  \n \nThis is not an MLM, pyramid or get-rich-quick scheme. You will never cold call, solicit, spam or reach out to your family and friends. You do not need to know how to \"sell\". You can work where, when and how you want. But you will have to work. This is about you, building your (global)  business. \n \nYou do need to be willing to invest in yourself, your business and your professional growth. You need to show up with a business mindset - as an entrepreneur and not as an employee.  \n \nThis is an opportunity for you to change your life, and we are here to show you how.  \n \nPlease respond with a valid phone number or visit moretimetogive.com/opportunity/ to connect.  \n \nYou will hear back from us personally within 48 hours. Catherine and Dave.     ",
        "title": "Opportunity is Knocking"
    }
]