[
    {
        "postid": "5920081678",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n\"Sharing Boating Bliss, Where Kinships Set Sail\"&#8203; \n \n1st in the World Sunreef Supreme 68S Luxury Catamaran, EagleWings: \nWith its spacious interiors and upper deck, coupled with the cabins with en-suite bathrooms, its perfect venue for  \n- Weekend getaways \n- Corporate events \n- Birthday Parties \n- Family Gathering \n- Product Launch \n- Networking Event \n- Wedding Ceremonies \n- Private Parties \n \nBoasting an incredible living space of 300 square metres, EagleWings is one of Singapore's largest catamarans -- a truly majestic location for any party or wedding.  \nWith its majestic exterior, the boat is even more impressive inside with sleek and modern furnishings such as spacious decks, a jacuzzi, fully-equipped bar, 10-seater dining space, and four luxurious cabins for overnight stays.  \n \nAvailable for hourly, breakfast, lunch, dinner or full-day charters to short get-away (max 12 paxs). \nEagleWings can hold up to 50  guests onboard. \nWater toys (Sea Scooter, Sparks, Kayak, Banana Boat) are included. Ideal for family, friends and team-bonding.  \n \n \nEagleWings II: \nNew addition to Eaglewings Fleet, a powered cruiser from world-renowned Sunseeker Manhattan Series. \nWith a maximum speed of 32 knots and 3000L fuel tank, this boat is deal for \n- Fishing Trips \n- Overseas getaways \n- Golf Trips \n- Small Private Parties \n- Island Explorations \n- Diving Trips \n \n \n** &#8203; \nWe welcome you to visit us at One Degree 15 Marina     ",
        "title": "Eagelwings Yacht Charters Singapore"
    },
    {
        "postid": "5930341122",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWashington State based USCG licensed Captain with experience in USA, Canada, Greenland, Cuba, Panama, French Polynesia, Australia, New Zealand, Philippines, Bering Sea, Japan, etc... 10 times across Pacific, twice solo. Available for yacht delivery anywhere in the world. Feel free to email me for a free quote.     ",
        "title": "Sailboat Delivery Captain"
    },
    {
        "postid": "5930341122",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWashington State based USCG licensed Captain with experience in USA, Canada, Greenland, Cuba, Panama, French Polynesia, Australia, New Zealand, Philippines, Bering Sea, Japan, etc... 10 times across Pacific, twice solo. Available for yacht delivery anywhere in the world. Feel free to email me for a free quote.     ",
        "title": "Sailboat Delivery Captain"
    },
    {
        "postid": "5922742199",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nwe are committed to providing easily accessible credit to all customers without any bias. We appreciate that emergencies can arise any time and our customised personal loan packages are designed to offset short-term monetary needs. We are one of the top finance company with years of experience in the financial industry, making us the best alternative to traditional banks. Our team of financial consultants is always ready to provide clients with information that will help them make the right decisions. We are the premier bad credit personal loan Singapore company and our expertise in this market makes us your first point of call. \n \nCall me @ 82628785 OR Whatsapp me @ 82628785  \n ",
        "title": "Quick loan"
    },
    {
        "postid": "5952715238",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nhi im monique 32 yrs of age provided shower together sensual relaxing and whole body oil massage outcall local and WatsApp no.+ \n show contact info  \n ",
        "title": "Classy and Busty With Relaxing Massage"
    },
    {
        "postid": "5936947493",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a well known CCTV security Service provider in Singapore. We have cheap  rang of IP Camera and AHD Camera. Used for CCTV surveillance area that need to security all of these Bars, casinos, schools, hotels, hospitals, restaurants, banks, all type of business. We offers best  and professional CCTV Camera Installation system in Singapore for your home and Offices.  \n \nIf you have any queries, please feel free to call me \nFor more info you can either contact \n \nADD: \nDCS NETWORKS PTE LTD , \n52 UBI AVE 3, #03-43 FRONTIER, SINGAPORE 408867 , \nPHONE: \n  show contact info \n  \nFAX: (65) 6100 PABX \n show contact info \n \nWEBSITE: www.dcsnetworks.co/cctv.html \n ",
        "title": "Singapore CCTV Surveillance"
    }
]