[
    {
        "postid": "5922585297",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIf you're looking for some blues to mellow the night away or dance to rock &amp; roll, please give us a listen.  We also play reggae, country and many other genres.  We're the house-band at The Sportsman bar every Thursday, Friday and Saturday.   \n \nParticularly, on Thursdays is when we host the all-Singapore jam and everyone is welcomed.  Also, high-energy songstress Emelda Houghton joins us on Friday nights. \n \nWe are Crozzroads and we are Billy (guitar and vocals), Aziz (bass and vocals) and Haris (on drums). \n \nWe're at: Far East Shopping Centre in Unit #02-01 (on the second floor just above Harry's) along 545 Orchard Road (next to Hilton Hotel).  If you need directions, please call 6735-1350.     ",
        "title": "Want to hear some blues, rock &amp; roll, country?"
    },
    {
        "postid": "5933371822",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n108-8611 \nTokyo &amp; Yokohama, Japan declares that she's an unforgettable INTERNATIONAL \"JAZZ &amp; GOSPEL\" Vocalist, Pianist, Organist, Composer, Educator, &amp; Inspirational Speaker. \n \nLisa and her entourage brings so much variety that Asia welcomes them with open arms!! Her originals and remakes are very unique and leaves her audiences speechless!! \n \nJapan, Europe, U.S.A., and so many more areas join Asia in supporting Lisa Gooch \"Jazz &amp; Gospel\" Concert Series!! These magnificent shows serve as organizations' fund raisers; also for the support of permanent facility expenses for Lisa's International Youth Choir. \n \nWritten Proposals are waiting for Booking Agents and prospective Concert Location Sponsors!! \n \nLisa also serenades hotel venues, cruises, political and corporate functions, Christian churches and events, and much more as solo, duet trio, or group. \n \nLISA GOOCH \"JAZZ\" ENTERTAINMENT \nwww.google.com/profiles/lisagoochjazzvideos \n \n(In Lisa's concerts, she implements acknowledgement and gratitude to her \"late\" Dad, for his teaching her to play piano.   https://www.dropbox.com/home?preview=IMG_7088.MOV ) \n \n show contact info \n show contact info \n ",
        "title": "Asia lays red carpet for Lisa Gooch\"Jazz\" &amp; Friends' Concerts!!"
    },
    {
        "postid": "5941570173",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi my name is Colin, Kamusta \nI play guitar in a rock band called The Superfluous Melons. I just recorded an album and I wanted to share this with people. You can e-mail me if you want to ask me any questions and I also like hearing what people have to say. I hope you at least stop by and say hi, maybe also like the facebook page. Hopefully I get to play live and meet you, I would really like that. Paalam, kasiyahan -Colin \n \nmyspace.com/thesuperfluousmelons \nfacebook.com/thesuperfluousmelons     ",
        "title": "experimental jazz &amp; rock music-demo"
    },
    {
        "postid": "5897593962",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nATTENTION! \n \n*SINGERS \n*MUSICIANS \n*SONGWRITERS \n*PRODUCERS/ENGINEERS \n*HOME STUDIO OWNERS \n*STUDENTS AND EDUCATORS \n \n3 DAY INTRODUCTORY RECORDING WORKSHOP \n \nWHEN: JANUARY 20-22 \nWHERE: KARMA SOUND STUDIOS \n \nPresented in world-class studios by platinum music industry professionals, our workshops provide hands-on knowledge of professional music production and audio recording. \n \nOur 3-day workshop is an exciting introduction to the world of professional audio production. \nYou will walk away from the workshop with your own project, fully produced by you and your team. \n \nOur celebrity recording/mixing facilitator for this workshop is Shane Edwards. \nShane's recent credits include the movie soundtracks for Batman vs. Superman, Inception, music artists Jamiroquai, Jimmy Page, pop icon Jessie J, Body Slam, Big Ass, Tata Young, Cho Yong Pil and many more. \n \nDon't miss this amazing opportunity! \n \nGo to our website at  http://recordingartsworkshops.com  and register online. \n \nAND, look for us on Facebook! \n \nOr, contact us here through Craigslist if you want more information. \n \nSee you in the studio!     ",
        "title": "3 DAY RECORDING WORKSHOP-FIRST TIME IN THAILAND!"
    },
    {
        "postid": "5950438476",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI'm a 35-year old experienced session guitarist, offering recording services to songwriters, producers, musicians, and bands. Perhaps you're a songwriter looking to take your recordings to the next level? Maybe you have the perfect drum track in place, a great bass track and the right piano part, but are missing the guitar tracks? Are you looking to create a new recording from ground up?  \n \nI've played on countless tracks across many genres - from rock and blues, to country, funk, acoustic, classical, bhangra, movie soundtracks, TV commercials, and more, and pride myself on always aiming to create the right parts for the song. With extensive session experience, professional studio recording equipment, and complete dedication to all artists, you can be guaranteed the results you're looking for. I'll take as much (or as little!) input from you as you like - from \"can you play this part exactly as written\" to \"can you make it sound like *insert band here*\" - so it doesn't matter if you know exactly what you want, or just know that something is isn't quite there yet. Whatever your requirements may be, I offer a cost effective solution to getting the results. \n \nPlease get in contact to discuss any requirements you have, or if you have any questions on how the recording process works. In a nutshell: you email me your track along with any required stylistic info, I then record and email you back the guitar parts, either in isolation or mixed in, at your choice. For more details, please see this video:  https://www.youtube.com/watch?v=VwEQ2kTqke4  \n \nMixing and production is also available, and I also have contacts for numerous great drummers (and I can handle bass-duties) if you're looking to build up a complete track from the ground up.  \n \nRecent feedback includes:  \n\"It sounds great - inspired work!\" - A. Hayman, Producer (Ronan Keating, Sugababes, All Saints) \n \n\"Jordan is a first class musician and a master of guitar sounds. I had a song which needed the right guitar part, and he provided it online in a couple of days, in a format which I could easily import into Cubase. File exchange means geography (I live in Germany) is no obstacle.\" - A.S, Singer/songwriter, Germany  \n \n\"Just listened to the track and I'm super happy with it, and very impressed. Thanks for making this so easy, I'm still amazed how quick and easy you made it for me!\" - N. Arninne, Singer \n \n\"We love the parts! Thank you so much, you're now one of my official go-to guys\" - Devin, Producer, Florida \n \n\"I've listened to the track over &amp; over and I love it! You've understood the style &amp; feel of the track from our conversation and I can't wait to put my vocals across it. This is my first time using a musician to build a track and its been a very positive experience.\" - T. Reading, songwriter  \n \nIf you have any questions please get in touch.  \nThanks, \nJordan  \n \nI'm a 34-year old experienced session guitarist, offering recording services to songwriters, producers, musicians, and bands. Perhaps you're a songwriter looking to take your recordings to the next level? Maybe you have the perfect drum track in place, a great bass track and the right piano part, but are missing the guitar tracks? Are you looking to create a new recording from ground up?  \n \nI've played on countless tracks across many genres - from rock and blues, to country, funk, acoustic, classical, bhangra, movie soundtracks, TV commercials, and more, and pride myself on always aiming to create the right parts for the song. With extensive session experience, professional studio recording equipment, and complete dedication to all artists, you can be guaranteed the results you're looking for. I'll take as much (or as little!) input from you as you like - from \"can you play this part exactly as written\" to \"can you make it sound like *insert band here*\" - so it doesn't matter if you know exactly what you want, or just know that something is isn't quite there yet. Whatever your requirements may be, I offer a cost effective solution to getting the results. \n \nPlease get in contact to discuss any requirements you have, or if you have any questions on how the recording process works. In a nutshell: you email me your track along with any required stylistic info, I then record and email you back the guitar parts, either in isolation or mixed in, at your choice. For more details, please see this video:  https://www.youtube.com/watch?v=VwEQ2kTqke4  \n \nMixing and production is also available, and I also have contacts for numerous great drummers (and I can handle bass-duties) if you're looking to build up a complete track from the ground up.  \n \nRecent feedback includes:  \n\"It sounds great - inspired work!\" - A. Hayman, Producer (Ronan Keating, Sugababes, All Saints) \n \n\"Wow, great job, I wouldn't change a thing. . .that was just how I envisioned it. Glad I found you!\" - J. Ramono, Producer, USA \n \n\"Jordan is a first class musician and a master of guitar sounds. I had a song which needed the right guitar part, and he provided it online in a couple of days, in a format which I could easily import into Cubase. File exchange means geography (I live in Germany) is no obstacle.\" - A.S, Singer/songwriter, Germany  \n \n\"Just listened to the track and I'm super happy with it, and very impressed. Thanks for making this so easy, I'm still amazed how quick and easy you made it for me!\" - N. Arninne, Singer \n \n\"I've listened to the track over &amp; over and I love it! You've understood the style &amp; feel of the track from our conversation and I can't wait to put my vocals across it. This is my first time using a musician to build a track and its been a very positive experience.\" - T. Reading, songwriter  \n \nIf you have any questions please get in touch.  \nThanks, \nJordan  \n \n http://www.jordanhumber.co.uk/sessions  \n http://www.youtube.com/jordanhumber  \n http://www.facebook.com/jordanhumberguitar   ",
        "title": "Recording (studio/session) guitarist available for your songs"
    },
    {
        "postid": "5947297281",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n'Good Night', my newest album as 'Kauso1', available on bandcamp for free.  \n \nRelaxed, chill, laid-back electronic music for your brain's pleasure. Enjoy. \n \n https://kauso1.bandcamp.com/  \n \n--- \n \nAlso, feel free of follow me on instagram if you like illustrative/graffiti/sci-fi artwork. \n \nInsta: jonmartinart \n \n----- \ntags: art music electronic electronica chill vibe relax art artwork space spaceart dallas dallasmusic dallaselectronic jam graf tag paint pen logic logicpro midi synth electro 8-bit 16-bit 8bit 16bit chip chiptune character     ",
        "title": "Free chill Electronic music, New EP/Album"
    },
    {
        "postid": "5958534983",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for SINGERS for Public Performances \nOur company is looking for talented singers and artists to perform in various platforms, events and activities. \n \nIf you are able to sing and perform well, you are the one we are looking for! \n \nCriteria:  \n- Passionate in Singing is a must!  \n- No age limit \n- No experience required \n- Good attitude and personality \n \nPlease SMS / WhatsApp 9734 5915 for audition with your Name [NRIC], Age, Gender &amp; Occupation  \n ",
        "title": "Looking for SINGERS for Public Performances"
    },
    {
        "postid": "5936875184",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSelf contained saxophonist is looking 2-3 months contract in ASEAN countries with Solo Program (saxophones+ backing tracks). Pop, smooth jazz, easy listening, soul, ballads, latin, etc. I play with original+minus tracks of Stevie Wonder, Michael Jackson,Frank Sinatra, George Benson, Michael Buble, Tony Bennett, Lee Ritenour, Kenny G, Eric Marienthal, David Sanborn and many others \n \nPromo video:  https://www.youtube.com/watch?v=fDBNjDO1JFg  \n \nalso with female US singer (backing tracks + vocal+ saxophone) or various live bands available! \n \nOnly serious jobs proposals. Preferably Hotels lounge music, live music pubs or restaurants.     ",
        "title": "Saxophonist"
    },
    {
        "postid": "5918826319",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nProfessional drummer offering basic lessons in rock &amp; roll, groove and whatever you need to start playing drums, start your own band, or maybe just to pick up a new hobby. \n \nPlease call or text message Haris at 9818-5934 to inquire about scheduling lessons and affordable rates. Drum kit and space included.  Hoping to hear from you soon. Thank you. (No emails please). \n \nFor drum instructors or music instrument instructors, I am pleased to say that I can also offer space by the hour for you to conduct lessons.     ",
        "title": "Basic drum lessons"
    },
    {
        "postid": "5930400209",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFemale-fronted traditional/epic doom metal band seeks guitarist to make the next full-length album. The band released an EP (CD, vinyl and digital download) in 2015. It was well-received in Europe and the Americas. Currently, the band have sufficient materials for a full-length LP and is signed to a Dutch label. There are also labels in Europe and North America expressing interest in the follow-up full-length. \n \nThe guitarist will handle both lead and rhythm parts. The ability to write is not mandatory as the band has a main songwriter and two supplementary writers. Of course, it would be a bonus if the guitarist is able to write and contribute to the album. The tuning used by the band is C# (1.5 steps down for all strings). Call or text 98763485 if interested.     ",
        "title": "Guitarist Wanted For Female-Fronted Traditional/Epic Doom Metal Band"
    },
    {
        "postid": "5933305925",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nASCAP songwriter and publisher seeks artists and producers in need of songs for upcoming album or side project. Must have recording budget or studio. I have a back catalog of 200 songs in the pop, rock, and country genre. No rap or hip hop. \n \nMy songs represent completed works, not unfinished music or lyrics. As a songwriter and publisher, I have secured many publishing and licensing deals, including major labels and publishers. As a manager and songplugger, I have secured indie releases and radio airplay for many songs and artists. \n \nMust be equipped to track, mix, and master songs. Music and vocals. If I like your work, I'll be glad to shop the recordings around the industry. While full demos may suffice for some songs, \"radio ready\" recordings allow me to shop the song and artist to additional outlets--including film and television. \n \nIf you are still interested, please provide a hyperlink to your website. Thanks.     ",
        "title": "Songwriter/Publisher Seeks On-Line Collaboration"
    },
    {
        "postid": "5958534224",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCall out for SINGING TALENTS! \nOur company is looking for talented singers and artists to perform in various platforms, events and activities. \n \nIf you are able to sing and perform well, you are the one we are looking for! \n \nCriteria:  \n- Passionate in Singing is a must!  \n- No age limit \n- No experience required \n- Good attitude and personality \n \nPlease SMS / WhatsApp 9734 5915 for audition with your Name [NRIC], Age, Gender &amp; Occupation  \n ",
        "title": "Call out for SINGING TALENTS!"
    },
    {
        "postid": "5895502093",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPiano and Music lessons available for all.Lessons will be held at a nice and safe neighborhood near Duke Homestead. \nLessons will be held weekly from 30, 45, 60 minutes (depending on level). \nFlexible schedule and fees starting from $130/month. Lessons can be held in groups of 2-4 or individually. \n \nLessons will be tailor made for unique individuals and classes. Believes anyone can create beautiful melodies even children of special needs. \nThere will be a FREE trial for all individual student. \n \nPlease email for more details and enquirers. \nThank you very much. Look forward to hear from you. \n \nMelissa \nmelodiouslioncubs.wordpress.com     ",
        "title": "****Piano / music lesson**** Free Trial lesson"
    }
]