[
    {
        "postid": "5910400057",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPart time and full time welcome \n \nWe need a virtual assistant. \n \nCustomers account manager: \nResponsibilities: \nRecord daily transactions in spreadsheet \nDaily tasks  \n \nWe pay daily \n \nEmail us with your cv     ",
        "title": "** JOIN US TODAY ** Homebased VA part time and full time"
    },
    {
        "postid": "5897149439",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking for an Admin Executive for a Church which is located at the east side of Singapore. \n \nThis person is someone with admin experience and able to coordinate with various parties to get things done. \n \nIf you are keen, please send us your resume with current salary and residential status details. Let us know your date of availability for the job if being selected.     ",
        "title": "Admin Executive"
    },
    {
        "postid": "5901797983",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are launching a New website TheNewMummy.co , and would like to hear from Pregnant or breastfeeding mothers!. \n \nWe are looking for mothers or mothers to be,  to give their experience with their pregnancy and breastfeeding, to help and educate other mothers and mothers to be. \n \nTheNewMummy.co is a website where soon to be and new mothers get all the information they need about pregnancy and being a new mother, based on experience shared by other mothers. \n \nThe Job Offered: \n \nWe are looking for soon to be mothers, as well as new mothers who are also breastfeeding to share their experience on pregnancy, birth and parenthood. \n \nYou will simply answer a set of questions, and then tell us your experience of being a mother/breastfeeding, or being pregnant. \n \nIt will take no more than 1 hour and you will be paid for your time. \n \nThe Pay: \n \nWe are paying a minimum of $80 for 1 hour but if you agree to share your experience on video, for the website, you will be paid up to $300 for 1 hour of your time. \n \nPlease get in contact if you are interested. There is a maximum of 10 spots available for this opportunity. \n \nWe look forward to hearing from you! \n \nTheNewMummy.co Team     ",
        "title": "Pregnant / Breastfeeding Moms - Get paid $300 to share your experience"
    },
    {
        "postid": "5955760501",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n**MUST HAVE AUSTRALIAN PAYROLL EXPERIENCE (END-TO-END PROCESSING)** \n \nCompany Overview \n \nHeadquartered in Dallas, SoftLayer, an IBM Company, is the innovation leader in on-demand Dedicated and Cloud hosting. As the largest hosting company in the world, SoftLayer lets customers create dedicated, cloud, or seamlessly integrated computing environments leveraging the company's world-class data center facilities and network Points of Presence across the globe. SoftLayer integrates and automates all elements of its platform, empowering enterprises of any size with complete control, security, scalability, and ease-of-management via a leading Customer Portal and Open API. \n \nJob Description \n \nReporting to the General Manager -- APAC, this role will be responsible for administrative activities related to payroll, HR, accounts payable, vendor relationships, and providing general organizational support. \n \nThe primary focus of the role is the office in Victoria, although support to other offices may be required from time to time. \n \nThe Office Manager will be responsible for the following duties: \n \nMaintenance of administrative, human resource policies and objectives in accordance with company objectives, ***including payroll processing and benefits \nOversight of external accounting functions (i.e. accounts payable) \nOversight of external vendors (e.g., payroll, ) \nMaintenance of administrative, human resource (HR) policies and objectives in accordance with company objectives, including payroll processing, benefits and health and safety \nOversight and maintenance of office supplies and equipment \nOverall administrative support of the team in Victoria \nSpecial projects and other related duties \nCandidate Requirements \n \nCandidacy for this position requires: \n \nPrior experience with HR, payroll processing, and accounts functions (Must have previous payroll experience) \nMust have exceptional verbal and written communications skills (English). \nWorking knowledge of MS Office Suite (Excel, Word, PowerPoint, Outlook) \nDemonstrated multi-tasking ability and effective organizational skills in order to meet short deadlines with finite resources. \nDemonstrated successful advanced problem solving, negotiating, and analytical skills \nMust be able to work in Australia without sponsorship \nJob Location \n \nMelbourne, Victoria, Australia     ",
        "title": "Office Manager"
    },
    {
        "postid": "5945281241",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA tutoring home business is looking for a student / freelancer / teachers assistant to help the main tutor with the following tasks on a part time basis: \n \n- keeping the accounts \n- reconcile payments received with outstanding \n- helping tutor organize their time better \n- general research for business \n- general filing \n- regular face book, linked in and other online updates \n- other office admin tasks  \n \nPotentially work from home 50% of the time. University students welcome \n \nPlease respond to Anshu Sharma \n  show contact info \n or email: \n  show contact info \n \n \nThanks     ",
        "title": "Part time startup admin needed"
    },
    {
        "postid": "5941843749",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nVacancy for sale rep or shopper..And if also want to make money daily..contact me..Will see if you meet up requirements     ",
        "title": "Make Extra Cash"
    },
    {
        "postid": "5936588916",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI work my own particular hours, anyplace I need. I am my own particular manager. I can even get back home and sleep at whatever time I need! Activity excessively insane? I can snatch a nibble to eat till its over... My first week I made $952.00 in 30 hours... yes its actual! No tricks, no tricks... also, its straightforward... BEST of all? Its an impact!  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~(*)|*|(*)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n========================== \n$100 sign up bonus, get it now! \n========================== \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~(*)|*|(*)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nOn the off chance that you don't have an auto, I have a couple of mixture sitting before my carport for my UBER companions.  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~(*)|*|(*)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nTurned into a Uber driver! You will get a join Bonus of $150 in the event that you join with me at:=!=Put33.com=!=  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~(*)|*|(*)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nWe will get in touch with you as quickly as time permits. Much obliged to you!     ",
        "title": "!!!$$$ F_le_xible H_ours, Dr_iv_er Del_iv_ery J-o-b.!!!"
    },
    {
        "postid": "5939448854",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWhat's The Deal?  \n \n- Make cash driving our Hybrid or Luxury vehicle with UBER.  \n- Potential for additional salary; manufacture your very own client organize, where you keep 100% of the tolls  \n____________________________________________________________________________ \nHalf and half Cars Available:  \n \n- Toyota Prius Hybrid  \n- Toyota Camry Hybrid  \n- Tesla S  \n- BMW Activehybrid 3  \n- Lexus ES 300h  \n- Mercedes S400 Hybrid  \n____________________________________________________________________________ \nWhy Work For Us?  \n \n- Founder has 5 Years of experience as a UBER accomplice, with an individual Driver Rating of 4.96 and  \n10,000 rides finished.  \n- Complete straightforwardness; perceive the amount you procure per trip  \n- Cash saved each week  \n- Join reward  \n- Pay ensure  \n____________________________________________________________________________ \nIn case you're searching for a super adaptable occupation to profit, Uber is for you.  \n____________________________________________________________________________ \nIf it's not too much trouble ensure you finish enlistment through this link:~!Put33.com!~  \n____________________________________________________________________________ \nWe will get in touch with you as quickly as time permits. Much thanks to you!     ",
        "title": "*!*We need to hire driver today. Get $100 sign up b-o-n-u-s.*!*"
    },
    {
        "postid": "5954588520",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDietary Coach Pte Ltd is a boutique dietary coaching company, looking for a part-time Personal Assistant. \n \nJob Type: Part-Time \n \nRequirements: \n \n- Good computer and internet research skills \n \n- Knowledge of social media \n \n- Flexibility and excellent interpersonal skills \n \n- Ability to work and execute tasks with minimum supervision \n \n- Execute a variety of personal and professional projects speedily \n \n \nThis opportunity is open to Singapore citizens only. Senior citizens are encouraged to apply. \n \nCompany Website: www.dietarycoach.com     ",
        "title": "Wanted: Part-Time Personal Assistant"
    },
    {
        "postid": "5951384374",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities: \n \n• Secure appointments/meetings through inbound and outbound calls to acquire new prospects \n \n• Close sales through inbound and outbound calls to acquire new sales \n \n• Close sales through inbound and outbound calls to upsell and cross-sell existing customers \n \n• Keep close track of leads and conduct follow ups with customers for closure of sales \n \n• Report to the Sales &amp; Business Development Manager \n \n \n \nJob Description \n \n• Ability to speak in Chinese \n \n• Deliver prepared sales talks, reading from scripts that describe products or services, or improvise, in order to persuade potential customers to take a desired action eg. agree to an appointment for presentation or purchase a product or service. \n \n• Schedule appointments for sales representatives to meet prospective customers or for customers to attend sales presentations or workshops. \n \n• Explain products or services and prices, and answer questions from potential customers. \n \n• Obtain potential customer information such as name, address, email, and contact numbers. \n \n• Obtain names and telephone numbers of potential customers from sources such as internet directories, telephone directories, trade directories, and lists purchased from other organizations. \n \n• Telephone or write email letters to correspondence with potential customers or to follow up initial sales contacts. \n \n• Documenting and recording information like entering, transcribing, recording, storing, or maintaining information of customers. \n \n• Maintain records of contacts, accounts, and new opportunities/leads created. \n \n• Conduct client or market surveys in order to obtain information about potential customers. \n \n• Contact existing customers to promote cross-sell or up-sell of companies' products and services. \n \n• Maintains phone time or sales quotas as determined by management \n \n \nSMS interest to Keagan @ 93526073, Preferably Locals and ability to converse in Chinese     ",
        "title": "Administrator / Personal Assistant"
    },
    {
        "postid": "5934263998",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are a fastest growing dance studio in Singapore, and we have been opened for 7 years now. We have got more and more famous through Mediacorp TV talent show and interviews, interviews by magazines and newspapers. We are also recognized as a fasting growing make up training studio. Our mission is to bring dance fitness &amp; healthy lifestyle, beauty and style to girls and women from all walks of life. Bring out the best in our clients, health and beauty inside out. As business is expanding, we need a full-time admin executive to be at our front desk, as the first smile to our clients.   \n   \n1. You must be bilingual.   \n  \n2. You must also know basic Microsoft computer skills.  \n  \n3. Able to work from Mondays to Thursdays between 11:30am-2:30pm and 5:30-9:30 and Sat is 9am-8:30pm, Sun 9am-5:30am, Friday is off day. In-between the lessons when there are no classes, flexible breaks up to a few hours are allowed during these gaps too.  \n  \n4. You must have a pleasant personality, enjoying socializing with people in a friendly and respectful way, extremely patient with our clients, capable to handle emergency situation at the front desk, provide a worry-free teaching environment for the dance instructors.  \n  \n5. Administration or sales experience is a bonus factor for the applicant. Passion in dance and fitness business are a must too.  \n  \nSalary and off days  \nTraining will be provided once you are hired. Probationary period will be 3 months.   \n  \n1. 1500 SGD basic salary for Probationary period (3 months), after that is 1700 SGD for the basic salaries.  Commissions and Bonus will be from 100 SGD to 500 SGD depending on the performance of the applicant. Future career development possibility will be provided periodically according to the performance of the applicant.   \n2. 14 days or more off days during the year according to the studio operating days. 5 days of MC or Emergency leaves.   \n3. Can take any dance or yoga classes whenever no more students need registration or other assistance.   \n \n ",
        "title": "fast growing dance studio needs a happy admin front desk lady :)"
    },
    {
        "postid": "5908907110",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am looking for an admin staff  for my Singapore office. \nSome travelling required and should be familiar with MS Office and admin matters. \nEnglish language skills required \nFemale preferred. \n \n \nWhatsapp  +\n  show contact info \n ",
        "title": "Looking for Admin Staff"
    },
    {
        "postid": "5956968332",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n\"Earn $180-$375 Daily doing admin or computer related work. \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nAll work will be done from your Home. No Commuting. No Gas. No Day Care. \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nPaid Daily \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nWe are a legitimate company taxes are paid. \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nFor more information, please fill in the form:_____*S&#8495;t33.com*_____ \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \nMust be at least 18 years old \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n***ONLY LOOKING FOR 12 PEOPLE***\"     ",
        "title": "*C*****omputer job. Work from h****ome.*"
    },
    {
        "postid": "5905734865",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWork from Home. Flexible hours. Decide how much you want to earn by how much effort you put in. Please email your name and phone number and we will arrange an interview.  \nSingaporeans and PRs wanted.     ",
        "title": "TUTION COORDINATIORS WANTED"
    },
    {
        "postid": "5945144785",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nForeign-based Operations-MANAGER/Phone-Sales-Operator/VA needed for Las Vegas Cleaning Company/Investor/Author \n \nPENN ENTERPRISES currently has one full time, LONG STANDING (more than 5 years) Ops Manager/ Salesman and is looking for another amazing remote worker! The company is owned by Dillon and his wife Venza.  \n \nThe Work: \nCleaning Company Management- \nWe average 50 hours of phone time per month (which will be split between the 2 operators). You would be the 2nd operator. A little more than half of the calls are inbound, in which the operator must use their excellent sales skills to book the client for as much business as possible (within their budget). The other half of the calls relate mainly to managing the 6 (current , and 9 optimal) cleaners and their current appointments, as well as doing customer service and collecting payment. The manager will also be helping to write and rewrite procedural documents and analyze statistics to make suggestions that help the company to run more efficiently/profitably. This is our main income source and the initial training period will be focused solely on the Cleaning Company. As time goes on the time dispersion will look more like the attached figure.  \nInvestment Company- \nWe have bought and sold about 30 buildings over the past 10 years, we currently own 3 apartment buildings, and are in the process of buying a 4th. Our candidate will also be operating as a VA to help us do property research, contact sellers, and to manage our current tenants as well as schedule repairs with our various contractors or our main maintenance person. \nBooks/info products-  \nThe 1st book in the series of 5 books has already been written. The books are based on dating and relationship advice. Our VA will be assisting in contacting publishers, setting up workshops, marketing the books and info products, and anything else needed.  \n \nThe Best Candidate: \n-Our best candidate is probably an expat, or someone NOT living in the USA, preferably in a country with a low cost of living. We are specifically looking to outsource to a country where things are less expensive so that we can secure a long standing, super competent, worker and pay them more than they can usually make in their country of origin, at a price that supports us investing as much money as possible back into the company to grow it as fast as possible. As we grow, we will plan to raise up our foreign workers along with our success and let them become the pillars of the company.  \n-Either English is your First Language, OR, you are completely bilingual. Accents must be either non existent, or if one is detectable, it must never cause miscommunications with our house cleaning clients or cleaners (both of which are costly). Someone who used to live in an English speaking country or was raised speaking English is ideal. \nApplicant Must: \n-Be able to quickly learn our procedures, computer systems, as well as the geographic area and cultural nuances of Las Vegas. \n-Have Management experience. The ability to be direct (in your speech) to cleaners about what they need to do, and compel them to follow their commitments on appointments is critical.  \n-Have phone experience. This means you had a job in which you were on the phone for much of your workday.  \n-Have Quick Transactional Sales experience. \n-Have Excellent problem solving skills. \n-have Positive attitude and outlook on life.  \n \n \nThe Pay:  \n \nUP to $1,500USD  40 hours a week. There will likely be a 3 month probation period, depending on the candidate. We also have bonuses based on the gross income of the cleaning company.  \n \n \nTo APPLY:  \nGo to this link www.proficientclean.com/APP     ",
        "title": "Operations-MANAGER/Phone-Sales-Operator/VA"
    },
    {
        "postid": "5895403371",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDuring the internship period, you will be exposed to these areas: \n \nResponsibilities: \n \n    • Orientation and familiarisation of the products and services of the company. \n    • Client liaison -- introducing our new models to clients from publishing houses, advertising agencies, production houses, event companies, fashion houses, show producers, etc. \n    • Working hands in hands with marketing team for various branding and marketing skills of maintaining website and social media content. \n    • Scheduling and coordination of the models' rosters. \n    • Assist inquiries via email, phone or face to face. \n    • Hands-on advertising campaign of our models in different platform media, e.g. filming, write up of testimonial &amp; execute marketing strategies. \n    • Practice good communication skills and manage expectations (Interact with external) \n \nRequirements: \n \n    Candidate must be currently pursuing at least a Diploma or Bachelor's Degree in Business Studies/Administration/Management, Human Resource Management, Economics, Marketing, Commerce or equivalent. \n    Applicants must be willing to work in ORCHARD CENTRAL. \n    3 Internship position(s) for duration of 4 month(s). \n \nOther benefits: \n \n    Excellent working environment. \n \n    Significant career development. \n    Wage system including basic commensurate with experience and productivity incentives. \n    Training provided. \n \n \nInterested candidates, kindly apply online together with your detailed CVs stating your salary expectations and availability. \n \n(Only shortlisted candidates will be notified) \n \nEmail: \n  show contact info \n \nContact Us @ 63232171     ",
        "title": "Internship for Business Studies/Administration Students - iModels Hold"
    },
    {
        "postid": "5958175507",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you a native ENGLISH SINGAPORE speaker? Lionbridge is looking for you! \n \nParticipate to our projects and get compensated! We are looking for home workers for frequent small tasks (e.g. voice recordings or transcription in your language).  \n \nFor more info and to register go to: http://datacollection_en-SG.register-lionbridge.com \n ",
        "title": "SINGAPORE ENGLISH SPEAKER"
    },
    {
        "postid": "5923558314",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe seek a part time admin assistant to join our friendly team. You'll get to learn up close how we run a creative small business! If you enjoy organisational tasks, please send in a resume to \n  show contact info \n \n \nAbout us: FASHION MAKERSPACE Pte Ltd is built to bring back the culture of DIY &amp; dressmaking skills. We are a one-stop-shop combining community, fashion design and dressmaking.  Learn more about us at our website http://fashionmakerspace.com/   \nOur office is at 10A Trengganu St Singapore 058464 (Chinatown). \n \nJob Requirements \n- Organized and Attentive to details \n- Willing to learn and help out as needed \n- Open to answering customer students' enquiries \n- Able to commit from 12-6pm, 4 days a week \n- Proficient in Internet &amp; Microsoft Excel/ Mac Numbers \n- Fluent in English &amp; Chinese \n- Able to commit for at least 1 year \n \nSalary is $8 per hour. \nPlease send in your resume to \n  show contact info \n ",
        "title": "Part Time Administrative Assistant for Fashion Makerspace"
    },
    {
        "postid": "5926486995",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFor those looking for a part time job that is not a 9 to 5 desk bound work, perhaps you may want to read through my ad. \n \nI am employing part time telemarketers who are experienced in making cold calls and can work at flexible office hours at their own choice of workplace. \nThe requirements for the incumbent are as follows : \n \n1. Able to converse in good English \n2. Need to commit a maximum of 8 hours in a week \n3. Experienced in making cold calls to SMEs and MNCs, relating to office renovation works \n4. Able to use MS Excel to key in details from each company \n5. Can choose to work anywhere as long as KPI log report is submitted on a weekly basis \n6. Able to start immediately \n \nRemuneration is based on : \n \n1. $6 per hour (maximum of $48 per week) with a minimum of 60 completed KPI \n2. Telephone allowance provided (based on $5 per week) \n3. Incentives are given for every successful appointment made \n \nA transcript will be provided and a telephone interview will be conducted to ensure that the candidate is suitable for this position. This part time position is recommended for those who do not enjoy the typical office hours' job and not bind to any associations.  \n \nFor interested parties, kindly email me for more details. \n ",
        "title": "Looking for Part Time Telemarketers"
    },
    {
        "postid": "5911835725",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for Vietnamese speaker to assist with small market research project. Must be native speaker with fluency in reading, writing, and commercial research in Vietnam. \n \nWe are looking for a project contributer to help us source suppliers in Vietnam. \n \nCompensation to be discussed     ",
        "title": "VIETNAMESE SPEAKER WANTED"
    },
    {
        "postid": "5915973813",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nNo past experience is ok to apply as training is provided.  No need to have diploma or degree.   Cannot speak English but can speak Mandarin is good enough.  Any race can apply - Malay, Indian or Eurasian or Chinese are welcome. \nApplicant should be open minded and willing to learn and try new things.  Must know how to use phone apps. \nReply with cv or resume and recent photo.  Or you may text to find out more. \nSalary will be matching with market rates and your personal qualifications, work experience and capability  \n ",
        "title": "Admin &amp; Operations Assistant"
    },
    {
        "postid": "5954094920",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you want to Achieve these points: \n____)______Wanting to make more money? \n_________)__________Spend more time with family? \n_______________)__________Doing things that you like at your spare time? \n___________________)______________Travel around the world? \n \nIf you have ever thought of the above. And you have the motivation to achieve these goals. We NEED your help. \n______________________________________________________________ \nWe are hiring 20 Candidates who are motivated enough to grow our business. This is simple admin work but require your sharp attention. \n______________________________________________________________ \nCandidate has the option to work from their own home. At their own place. \n______________________________________________________________ \nLimited spots available. Please apply through the link.========&gt;&gt;&gt;&gt;&gt;S&#8495;t33.com======     ",
        "title": "&gt;&gt;&gt;! Stay Home Mom needed for Simple work. !&gt;&gt;&gt;"
    },
    {
        "postid": "5905219138",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFull-Time \nCareer Level \nJunior \nALL ARE WELCOME \n- Administrative and accounting duties; \n-Data entry; \n-Process invoices; \n-Handling of petty cash,  \n-Process staff reimbursement and claims; \n-Answering of incoming calls &amp; transferring of calls, emails and facsimiles; \n-Printing of documents &amp; filing; \n-Monitoring time costs and dates; \n-Dispatching &amp; mailing out of letters and cheques; \n-Keep track of company monthly expenses and bank reconciliation; \n-Manage Director's personal account including keeping track of bills; \n-Other ad-hoc duties as assigned \nResponsibilities \n-Preference shall be given to applicants who are immediately available \n-Applicant must be literate, numerate, and articulate. \n-Applicant must display a good attitude, and be self-motivated individual. \n-Applicants with no experience may be considered, but must be willing to learn     ",
        "title": "Admin &amp; Accounts Clerk"
    },
    {
        "postid": "5918778080",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for candidates for a job opening as an admin staff. \n \nMain Target: \n1. Applicants with Long Term Visit Pass Plus, Dependent Pass, PR and Citizenship. \n2. Long Term Visit Pass Plus applicants must be from PHIL. \n3. Gender no issues - Male and Female may apply. \n \nMain duties are: \n1. Administrative Duties - Attend to phone calls, resolve issues \n2. Handle ecommerce orders and processes \n3. Reconcilation of orders and payments \n4. Other administrative work, data entry, preparation of payments. \n \nBenefits: \n1. Annual Leave \n2. 5 Days Work Week - Weekends and Public Holidays Off \n3. Relaxing informal environment \n4. Salary from 1.5K - 2.1K, depending on experience \n5. Starters and fresh applicants most welcome \n \nPls email your resume to \n  show contact info \n and provide the following info: \n1. Expected Salary \n2. Availability \n3. Experience Level \n \n \n ",
        "title": "Vacancy - Admin Asst - Online ecommerce environment"
    },
    {
        "postid": "5938395944",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPart time and Full Time telemarketers needed ASAP. \n \nExperienced telemarketers are preferred. \n \n$8 dollars an hour, with incentives included that will be paid MONTHLY. \n \nFlexible working hours, located at Alexandra. \n \nTraining will be provided. \n \n ",
        "title": "Telemarketers wanted"
    },
    {
        "postid": "5949116818",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis job is suitable for the following: \n1. NSFs, must be stay-out personnel \n2. Full-timers looking for a second source of income \n3. Homemakers looking to monetise their time spent at home \n4. Retirees  \n5. Self-employed people looking to supplement their irregular income \n6. People who are finding a legitimate way to make money trading the financial markets \n \nTruths about this job: \n1. It is trading, so of course you need money to make money. \n2. If you start off with the minimum trading amount of 250 USD, you are looking to make about 250-500 USD  a month. If you start off with 1000 USD, you are looking to make 1000 USD-2000 USD a month. Start less, earn less, start more, earn more.  \n3. If you are looking for overnight richness, sorry please do not contact me you are wasting my time. \n \nFor starters, I strongly recommend this as a part-time/supplement income. It can earn you up to 1000 SGD a month. For people who are professional in trading, there is no limit on how much you can earn, but it takes hard work. \n \nIf you are interested, please Whatsapp me at 97859692 and state \n1. name/age/craigslist02 \n2. What is your attitude towards trading? \n \n ",
        "title": "Independent forex trader"
    },
    {
        "postid": "5943140175",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n\"Full Time Telemarketeer / Coordinator\" \nReal Estate Firm \nDo cold calling, sending EDM, posting, arrange appointments and sending Email \nWorking place: Zhongshan Mall. Hiap Hoe Building \nWorking timing: 10am to 6pm (Night time may be required for certain days) Flexible \nBasic with commission \nRequirement: \nSelf initiative  \nSelf Discipline  \nSelf motivation \nCommitted \nResponsible  \nStarting immediate.     ",
        "title": "Telemarketeer / Coordinator"
    },
    {
        "postid": "5921450699",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFull Time Admin Cum Personal Service NEeded \nPay 2k \nMonday to SAturday \nSerangoon ARea \n \nContact Jonah at 93874394     ",
        "title": "Full Time Admin Cum Customer Service Immed Start"
    }
]