[
    {
        "postid": "5900381092",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFoupon Is best discount coupon website in India, We provide best discount coupon deals offers like, Amazon Discount Coupon, Flipkart Discount , Paytm Recharge Discount offers and much discounted offers  for all shopping Website ,  Also If want more Information so call us \nwebsite:http://www.foupon.in/     ",
        "title": "Paytm Discount Coupon"
    },
    {
        "postid": "5904694046",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPUBLIC HOLIDAY SURCHARGE WAIVED \n \nBusy at work or taking a much needed holiday? We are proud cat parents who will take good care of your feline furchildren in the safety and familiarity of your own home when you need to be away. We will feed them, clear their litter, brush their fur, play with them, and shower them with the same kind of attention we give our own babies.  \n \nOur rates vary according to location and number of cats.  Multiple visit packages are also available.  No extra charge for feeding other small furry/fishy critters living in the same household. Will travel to most parts of Singapore.  Current promotion: no public holiday surcharge.  Message us for a quotation today!     ",
        "title": "X'mas/New Year/CNY Promotion - Headbutts &amp; Kisses Cat Sitting Service"
    },
    {
        "postid": "5919903435",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAvailable to walk or run dog during the week.   In Singapore for 6 months, and missing my boys at home (2 cocker spaniels and a lab mix).   Would love to spend time with four legged friends and help out by walking or running your dog(s).   Please call me or email me.     ",
        "title": "Dog Walker / Runner"
    },
    {
        "postid": "5905898099",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi fellow pet owners, \n \n \n \n \n \nMy name is Sylvia. \n \nI have 2 lovely small dogs and my passion is what brings me here. \n \nThey are very friendly. Both sterilized, up to date vaccinated, on fleas and ticks prevention. \n \nIt will be great if they can make new friends time to time. \n \n \n \nI am providing home boarding services, pet sitting, dog walking or any kind of pet related services. \n \nAs I have experience working in a Vet Clinic, I am able to lend a helping hand to those in need. \n \nI am able to syringe feed food and water, provide subcutaneous fluid, feeding of medications and supplements. \n \nAs I am doing this for passion, I am committed in providing best home care for your beloved pet. \n \n \n \n \n \nI am reachable at 94747242, \n  show contact info \n ",
        "title": "Experienced Vet Assistant Loving Home Care (Boarding, Pet Sitting)"
    },
    {
        "postid": "5946476365",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA video production requires a rooster to star in it, and is looking for someone with a pet rooster. Please be available for full day on the 14th of Jan '17, Saturday. Do send images of your pet rooster in your reply. \n \nCompensation will be provided. \n \nThanks!     ",
        "title": "Do you have a pet rooster? Let him star in a video production!"
    },
    {
        "postid": "5954413387",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWoof woof happy active dog walking with me .  \n \nAlso includes dog baths for hot weather if needed.   \n \nExperience and reliable Pet sitting and dog walking services contact me via whatsapp for quick response :) 8161 9706     ",
        "title": "Active dog walker"
    },
    {
        "postid": "5944777674",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSpecial formula food for crayfish: \n- Balance nutrition \n- Color enhance \n \nPlease contact me for further information.     ",
        "title": "Crayfish Food for Sell"
    },
    {
        "postid": "5944956502",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you too busy to look after your dogs? Are you heading out of town and have no one to look after? \nCommercial pet hotels usually does not provide 24/7 supervision and do not have the freedom to roam around.  \n \nWith us, we look after your dogs in a home environment with 24/7 supervision. They also have the freedom to run around, cage-free! We usually allow the dogs to sleep with us in the bedrooms.  \n \nUnfortunately, we do not accept dogs with severe anxiety issues or aggression. \n \nOwners are advised to meet us, together with their dogs, first before deciding. Food and beddings (optional) are to be provided by the owner. \n \nDaycare (per dog) \n$25/day \n \nHome Boarding Prices (based on size)  \nSmall dogs - $35/night \nMedium dogs - $40/night \nLarge dogs - $45/night \n \n*subject to surcharges of $10/night during peak season \n*additional $25/night for each subsequent dogs \n \nWe have been doing this for 3 years, with over 96 reviews (as of dec 2016) \nhttps://www.pawshake.com.sg/petsitters/singapore/east-chia-house-travel-no-worries-65525 \n \ninterested, please feel free to  message at 98835478!     ",
        "title": "Home Boarding for Dogs"
    },
    {
        "postid": "5942805863",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCat description \n Cat name : Tiger \nBlack and gray combination of furr with white hair on area of the stomach ,short tail, wearing light blue collar with a bell on it.brown eyes. \n \nLast seen October 2,2016 @ 24 Lorong L Telok Kurau Singapore \n \nPlease contact us at 91483155 if you have seen our cat.Thank you     ",
        "title": "Lost Cat"
    },
    {
        "postid": "5936763884",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am providing the following services for a charge of $25 using my van .Owner is encouraged to travel together ie front or back with airconditioning and seats provided.Please sms or call @98567037 james to book.     ",
        "title": "Pet,pets ferrying,delivery,transport"
    },
    {
        "postid": "5904719043",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello, \n \nI'm an experienced house &amp; pet sitter (almost 30 assignments worldwide with many superb references) - and would be available over the next few weeks, including Christmas and New Year's holidays for cat sits. \n \nMore info and full list of references can be found here: \n \nLuxuryPetCompanion.com \n \nLook forward to hearing from you! \nGaby     ",
        "title": "Experienced, Loving House &amp; Pet sitter while you travel"
    }
]