[
    {
        "postid": "5929565559",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCockapoo so lovely puppies ,please contact us via email with your email to for more pics and details     ",
        "title": "Cockapoo so lovely puppies"
    },
    {
        "postid": "5910729656",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \n \nThis puppies are so cute and adorable.. The are well home trained ...and play with kids at home... Akc puppies... 2months old.. 13ibs.... Both male and female.. Am relocating please interested persons hit me up urgently. We are not allowed with puppies into a new home according to the housing agreement.. Please serious family hits us up.. - -it urgent.. NOW -     ",
        "title": "Akc shih tzu puppies ready for delivery at your home now!!"
    },
    {
        "postid": "5932967171",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt is important that the dogs entering Singapore are going to be treated in the same way. Pet Export Singapore Relocate and move your pet to Singapore. We offer a complete door to door handling service for pets.     ",
        "title": "Dogs entering Singapore"
    },
    {
        "postid": "5917270238",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are putting our two rabbits up for adoption as I will be moving abroad next year.  \n \nAdoption fee: $100 for one or $160 for both.  \n \nIf you take both, we will include the cage, water tray, litter tray, water bottle, food tray, pet grooming brush, pet collars and whatever feed we have left.  \n \nWe will prioritise adopters who can provide a warm and loving family to our rabbits.     ",
        "title": "ND Netherland Dwarf rabbits up for adoption"
    },
    {
        "postid": "5923294775",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCute British Blue Shorthair kittens \n2 British Blue Short-hair kittens ready for new home now. \nWe have Kittens very friendly and playful,they handled and played with all the time as brought up with young children. All kittens are eating well and litter trained.     ",
        "title": "Cute British Blue Shorthair kittens"
    },
    {
        "postid": "5952992242",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI have a sweet great pomsky pup that needs a new home, he approximately 3.5 months old. he is full blooded but not registered. She's been outside and around horses. Removing fee can be discussed. I have a newborn at home and I'm afraid she's going to accidently hurt the baby by playing too rough.We have a beautiful one 16wk old white SKP registered poms pup, he is from our own litter and was a gift for a family member who can no longer take him so we are looking to find him a good home. Prefer he goes to a family house particularly with children as these dogs adore kids. There is a rehoming fee that covers all his paper work and vet bills up to date. Text or call for info.     ",
        "title": "great pomsky puppy neutered"
    },
    {
        "postid": "5920072471",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThree cute and playful kittens, born and raised by their ex-stray mother in my house, are ready to go home with you! \n \nEbony - Sweet and vocal girl with a sleek, black coat.  \n \nPatches - Beautiful Tortiseshell girl with unique patterns on her belly.  \n \nJules - Laid back ginger boy. \n \nThey are all playful, curious and active and will grow up to be loving and affectionate cats once you bond with them. \n \nAll 3 have been vet checked, dewormed and vaccinated. \n \n \nIf you wish to adopt them, you will need to: \n \n1. Sign an adoption form. \n \n2. Pay a $100 DEPOSIT(not fee) which will be RETURNED IN FULL once your kitten is sterilized at 6 months old. \n \n3. Keep them strictly indoors and cat-proof the house. \n \n4. Provide them with quality wet and dry food and adequate veterinary care. \n \nTo experience the joy of bringing home a friend for life, do contact me at: \n \nEmail: \n  show contact info \n \n ",
        "title": "3 Cute Kittens for Adoption"
    },
    {
        "postid": "5899759136",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHandsome and beautiful little boy and girl amazing pupies, World character makes them this perfect cute pups. u can drop us an email we first of all have to study you and see if you can be fit for our puppies, if you pass the test then your the new owner whatsapp +447448264651 \n ",
        "title": "Handsome and beautiful little boy and girl amazing"
    },
    {
        "postid": "5923252435",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nStunning Purebred African Gray Parrots for free adoption \nCome with  \n-- A Cage \n-- Ownership Papers \n-- DNA Tested Papers \n-- Some Playing Toys \n-- Health Guarantee card \n-- Certificate of Veterinary Inspection \n-- Micro-Chipped (In case ever lost or stolen)     ",
        "title": "Purebred African Gray Parrots for free adoption"
    },
    {
        "postid": "5913295537",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAdorable christmas Chihuahua puppies for sale, comes with all papers. have both male and female.     ",
        "title": "Adorable christmas Chihuahua puppies for sale"
    },
    {
        "postid": "5943172085",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI'm leaving Singapore and need a good home for my pet turtle (red-eared slider). The turtle is 5 years old and was purchased from a Pet Lover's Centre here in Singapore when he was about thumb-nail sized. He is now about the size of a grown man's hand but is very gentle and easy to care for. He comes with an aquarium, cage (easier to clean), and feeding bowl. All for free to anyone who will provide him with a good home. Good pet - he only requires being fed once per day, and having access to a sunny area for part of the day so that he can sunbathe.     ",
        "title": "Moving - looking for home for pet turtle - FREE"
    },
    {
        "postid": "5918895259",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nADOPTION FEES @ SGD800 \nfor the immense dedication and effort WHATSAPP ONLY 91340934 \n \nBORN ON 13 SEPTEMBER 2016 / 5 OCTOBER 2016 \nPATERNAL PURE BREED AMERICAN SHORTHAIR \nMATERNAL PERSIAN / SOKOKE \n \nLITTER BOX TRAINED \nFORBID DECLAWING \nHOME VISIT ESSENTIAL to ensure grills/meshes on all possible exits/dangers AND INSIST ONGOING PLEASANT RELATIONSHIP WITH OWNERS \n \n \n- Playful / Very Active \n- Attention seeking \n- Enjoys viewing \n- Can be independent \n- Intelligent / Trainable \n- Calm attitude \n- Easily amused by simple pleasures of life (eg. strings, paper ball) \n- Easygoing companion who will be content to quietly follow you around and then sit in your lap for petting whenever you give him the chance. \n- Most affectionate : brilliant for families / children     ",
        "title": "3 Month Kitten for Adoption MIXBREED AMERICAN SHORTHAIR"
    },
    {
        "postid": "5901157651",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI have 3 females kitten two months that is of pure beige point ragdoll kittens born ------- and ready for new home. Also have 8 week kittens three males and one female that were born -------. Mom and dad is a cream point flame point white ragdoll. Both parents are purebred and on premises. These are very rare kittens and have their beige points coming in now. They are predominantly white, a glaciaer white body and light beige points on ears, tail and feet. Baby blue eyes which is also true to the breed. Reply to the email for more info and contact me if interested, they all have pure gorgeous blue eyes too! text me for more infi     ",
        "title": "***I have 3 females kitten two months***"
    },
    {
        "postid": "5933263911",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSelling my sapphire white winter hamster with its entire cage for $40. \n \nHamster is pearl white winter, female, 10 months old.  \n \nCage includes: \n-Water bottle  \n-Orange-shaped house  \n-Attached silent wheel that's detachable to be independent hamster ball \n \nPlease note that cage is a little broken on top (pic 2), but does not affect the use.  \n \nWill include full jar of food and bath sand (worth $10 and $5 respectively).     ",
        "title": "Hamster + 2-storey cage"
    },
    {
        "postid": "5923282603",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \naffectionate bengal kittens for adoption \nhere are our lovely vets checked and akc registered pets ready to be given to any caring and lovely  \nhome.     ",
        "title": "affectionate bengal kittens for adoption"
    },
    {
        "postid": "5954285501",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHave some cute pitbull puppies waiting for a new home.They vaccinated.Potty train,home raise and vet checked.Love to play with with kids and other domestic animals.Contact the email address for more information     ",
        "title": "Male and Female Pure Breed Pitbull puppies"
    },
    {
        "postid": "5887687210",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOver 400 dogs and 300 cats available for adoption. Saved from culling, abuses or abandoned. No fee in any form is chargeable. Just need give them a good home. Comes with tag and sterilisation.     ",
        "title": "dogs for adoption- no fee"
    },
    {
        "postid": "5918718569",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n2 kittens up for adoption (1 male, 1 female). \nKittens are 8 weeks old. Litter Trained. Weaned and on solid food. \n \nDOB: 18/10/2016 \n \nInterested please email me for details or watsapp. \n \nAdoption fees applies. \n ",
        "title": "Mixed Breed Ragamuffin/BSH Kittens for Adoption"
    },
    {
        "postid": "5898840136",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThere are home raise and well trained puppies for adoption. Chihuahua and Yorkshire  puppies ready for new homes. The puppies have been vet checked and had their most recent shots. There are in very good health condition and come with their Vet records.  Male and Female are available. The are home raise and so get along with house hold pets and love to be curdle. Got English understanding and are great home companions. Please Contact us for adoption at ( \n show contact info  \n)     ",
        "title": "Newly Born Yorkshire Puppies For Adoption."
    },
    {
        "postid": "5911937019",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n2 MONTH KITTENS (Male &amp; Female) \n \n \nADOPTION FEE @ SGD800/- each with vaccine/deworm/deflea \nfor the immense dedication and effort \n \nAccept offers and priority to adoption of both siblings \n \nBORN ON 5 OCTOBER 2016 \nPATERNAL: PURE BREED AMERICAN SHORTHAIR \nMATERNAL: SOKOKE \n \nLITTER BOX TRAINED \n \nDry &amp; Wet Food / KMR  \nEvo/Solid Gold Holistic Indigo Moon  \nFORBID DECLAWING \nHOME VISIT ESSENTIAL to ensure grills/meshes on all possible exits/dangers AND INSIST ONGOING PLEASANT RELATIONSHIP WITH OWNERS \n \n \nBehavior : Sociable \nClever / Hyper / Energetic / Playful / Friendly / Lovable / Easy to manage / Family-oriented pet / Independent / It keeps itself busy by playing in quick, intense bursts / Vocal \n \n \nCoat Grooming \nNeed little maintenance. Brushing once in every week is sufficient for their low-shedding coat. \n \n \nExercise \nGaming sessions that involve running, chasing, and jumping are required for this agile and active breed to burn off its excess energy. Toys like cat trees should be provided to satisfy its jumping and pouncing instincts.     ",
        "title": "Mixbreed American Shorthair Sokoke Kittens"
    },
    {
        "postid": "5949092614",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLovely well trained home raise Yorkshire and Pomeranian  puppies ready for adoption. The puppies have been vet checked and had their most recent shots. There are in very good health condition and come with their Vet records. Both male and Female are available for adoption. The puppies get along with other house hold pets and love to be curdle. Understand English and are great home companions. Please Contact us for adoption at (\n  show contact info \n) \nMarline     ",
        "title": "Baby Yorkshire and Pomeranian Puppies For Adoption"
    },
    {
        "postid": "5911618645",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAvailable: \n* 2 blue-and-gold macaws (both females); S$1600 each \n* 5 ring-necked parakeets (mix of males and females) \n \nPlease call if interested. \n ",
        "title": "Blue-and-Gold Macaw, Ring-Necked Parakeet"
    },
    {
        "postid": "5946479901",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA video production requires a rooster to star in it, and is looking for someone with a pet rooster. Please be available for full day on the 14th of Jan '17, Saturday. Do send images of your pet rooster in your reply. \n \nCompensation will be provided. \n \nThanks!     ",
        "title": "Do you have a pet rooster? Let him star in a video production!"
    },
    {
        "postid": "5905898860",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi fellow pet owners, \n \n \n \n \n \nMy name is Sylvia. \n \nI have 2 lovely small dogs and my passion is what brings me here. \n \nThey are very friendly. Both sterilized, up to date vaccinated, on fleas and ticks prevention. \n \nIt will be great if they can make new friends time to time. \n \n \n \nI am providing home boarding services, pet sitting, dog walking or any kind of pet related services. \n \nAs I have experience working in a Vet Clinic, I am able to lend a helping hand to those in need. \n \nI am able to syringe feed food and water, provide subcutaneous fluid, feeding of medications and supplements. \n \nAs I am doing this for passion, I am committed in providing best home care for your beloved pet. \n \n \n \n \n \nI am reachable at 94747242, \n  show contact info \n ",
        "title": "Experienced Vet Assistant Loving Home Care (Boarding, Pet Sitting)"
    },
    {
        "postid": "5910723867",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \n \nHome Raised Rag doll Kittens.I have 3 9 week old kittens (2 males 1 female) that need loving forever homes! They have been wormed and given flea control and been given kitten dry cat food. No shots. They are all using the litter box. They are very clean &amp; healthy. The one boy is black and white and the other boy is grey black and white the girl is tabby strips and dots! All very friendly and have been handled by young toddlers. They will come with a small bag of the kitten food they have been eating and their new collars!     ",
        "title": "Rag-doll kittens for sale"
    }
]