[
    {
        "postid": "5957232445",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities: \n \n-Accurate and rapid response to security events. \n-Advise and consult with internal customers on risk assessment, threat modelling, and vulnerability management. \n-Interpret and apply security policies and procedures. \n-Participate in incident response. \n-Identify security issues and risks and then develop mitigation plans. \n-Provide analysis and trending of security log data from various security devices. \n-Maintain up-to-date knowledge of the IT security industry, including awareness of new or revised security solutions, improved security processes, and the development of new attacks and threat vectors. \n-Provide information security reporting, including security metrics as required. \n-Recommend solutions to mitigate risk in any activity that potentially impacts security of existing IT and information management. \n \nRequirement: \n \n-Minimum two years of demonstrated experience in system, network, and/or application security. \n-Knowledge of network and web-related protocols (e.g., TCP/IP, UDP, IPSEC, HTTP, BGP and other routing protocols) \n-Experience with service-oriented architecture and web services security desired. \n-Experience with the application of threat modelling or other risk identification techniques. \n-Detailed knowledge of system security vulnerabilities and remediation techniques, including penetration testing and the development of exploits. \n-Able to work in a rotational 24/7 SOC environment. \n-Excellent leadership skills and teamwork skills. \n-Strong sense of ownership and drive. \n-Knowledge in the information security space with emphasis on TCP/IP network security, operating system security, common attack patterns, and exploitation techniques. \n \nInterested candidates, please send us your detailed resume in MS word format, attached with your recent photograph, stating your current/last drawn &amp; expected salary to cindysee@ acetech.net (EA Lic. 02C2819 / Reg No. R1658303) \n \nWe would like to thank all candidates in advance on their interest for this position and regret that only short-listed candidates will be notified.     ",
        "title": "Security Operations Centre (SOC) Analyst"
    },
    {
        "postid": "5895533965",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDo you know what the internet is? \nDo you have the ability to click things and read texts? \nThen you're all set for this simple yet rewarding job! :) \n \nJob: Tuition Coordinator! :) \n \nWhat you do: Simply match provided tutors to parents' description using a provided online portal. (Just key in the subject and level and you'll be matched with suitable tutors instantly!) Easy and free training will be provided when you sign up :) What's more, you can work from anywhere (at home/on-the-go) and anytime you like! \n \nSalary: This is how the pay works! You get 50% commission of the tutor's pay each month. \nCase 1: You match a tutor to a student that charges $400, you will get $200 that month. \nCase 2: You match 3 tutors to 3 students that charge $500 each, you will get 3 x $250 = $750 that month!! \nIt's THAT easy! (No quota!) \n(estimate: $1k salary a month) \n \nBONUS: You also get a recurring income each month for each student you match! This amount is on average $10 per student. e.g. If you match 3 students in February, from March onwards you get $30 each month without doing ANYTHING! \nBONUS 2: Get commission for every person you refer into being a coordinator too! \n \nWe are in need of workers so join us now! Students/Homemakers/NSF are welcomed too! \n \nIf you're interested, Call/Text Daniel at 98588951 to apply/ask questions! :) \n-Singaporean/PR only :) \n-Please don't message me through this website :) \nHear from you soon!     ",
        "title": "PART-TIME/FT JOB HERE! (ISLANDWIDE; GD PAY!)"
    },
    {
        "postid": "5954585711",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nZion Tech Group provides IT global services on demand. We are looking for a technical resource with field experience in IT assistance tasks on demand Level 1 and 2, with knowledge in PC Hardware, Data Center, Cisco, Computer Hardware Servicing, Computer Trouble shooting, Unix, Linux and Windows. \n \nRequirements: \n \n* Knowledge of Cisco Routers Configuration (LAN/WAN)  \n* Good English Communication Skills \n* Visit our customer for onsite support &amp; replace/install parts \n* HW / SW Maintenance, Configuration &amp; Installation \n* Troubleshoot Routers &amp; Replace components (Network cards/SPA etc) \n* Experience on Infrastructure ( IT, Switches, Server, Data Center ) \n* Imaging desktops and laptops using SCCM \n* Handling different operating systems  \n* Asset/Inventory Management at sites \n* Desktop/Network Printers Management at sites \n* Image creation &amp; Deployment\t \n \nWe will provide training if needed for all opportunities that you receive.     ",
        "title": "IT Support / Network Engineer"
    },
    {
        "postid": "5920047756",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities: \n- Troubleshoot and resolve Windows OS, network connectivity related issues for users \n- Perform day-to-day PC hardware and software support for users \n- Perform software and hardware upgrade \n- Perform network printer and scanner setup \n \nRequirements: \n- Nitec/Diploma in IT or equivalent \n- Min 1 year of IT support (desktop or helpdesk) experience \n- Good technical knowledge in Windows operating systems \n- Comfortable with roaming to various locations \n \n \nInterested candidates who wish to apply for the above position; please send in your resume in MS Word format to \n  show contact info \n ",
        "title": "Roaming Desktop Engineer"
    },
    {
        "postid": "5941852293",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSales assistant needed,if you can run errands with singapore or keep sales accounts,message me more that 1200 weekly     ",
        "title": "Assistant For Sales"
    },
    {
        "postid": "5918120961",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLocation \n \n§  Singapore -- IBP, Jurong \n \n \n \nRequirements \n \n§  Experience:  2 years and above \n \n§  Nationality: Singaporean \n \n§  Duration:    1-year \n \n \n \nJob Description \n \n§  Drives all aspects of project management activity, including collaborating and coordinating across the organization \n \n§  Changes that affect scope, schedule and resources are identified, managed and controlled with an integrated and cohesive plan. \n \n§  Scope is defined, approved, managed, controlled; ensuring completed deliverables are accepted by the customer. \n \n§  Schedule is developed and managed to on-time delivery. \n \n§  Resources are assigned and managed effectively and efficiently. \n \n§  High quality is planned and delivered on the project, meeting all agreed upon requirements and ensuring high customer satisfaction through the management of the overall customer experience. \n \n§  Communications are planned and conducted during the project to ensure stakeholders are involved, expectations are accurately set, managed, and key stakeholders receive adequate communications throughout the project lifecycle and this includes customer and Client stakeholders.     ",
        "title": "Project leads"
    },
    {
        "postid": "5910666064",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi friends \nName: arun kumar.n \nDob: 12/04/1995 \nEducation: diplomo in electrical engineering \nExperience: 2years working in shipyard \nData entry job \nNow i find good job pls pls frnds help me \nGenal worker, house maid also no problem \nI have loan problem \nAny body help me  \nPls email me \nThank you     ",
        "title": "HELLO"
    }
]