[
    {
        "postid": "5951485442",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nKOREAN LADY WOKRING IN HOTEL CUS SVC,IMMED WANTED ROOM \n \nFULL FURNISH,AC \nIMMED \nKOVAN SERANGOON,SENGKANG  \nBUDGET UP TO $650 \n \nCALL 90222367 SABRINA AGENT  \n ",
        "title": "KOREAN LADY WOKRING IN HOTEL CUS SVC,IMMED WANTED ROOM"
    },
    {
        "postid": "5946499538",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi, I am looking for a room to rent around 600 as close to beach road as possible.  \n \n26 yo, professional malaysian chinese male. Will begin working in SG starting february 1st. \n \nNon smoker, clean and hygienic.  \n \nCurrently in SG and available to view rooms. \n \nDo whatsapp me at +601123885531 thanks!     ",
        "title": "Looking for room"
    },
    {
        "postid": "5949093480",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nVery quiet and cozy room with wifi.Light cooking and washing machine.Single owner.High floor.Walking distance to bus stop,mrt,market,convenience store and atm machines. \nAvailable immediate     ",
        "title": "Fully furnished room with wifi"
    },
    {
        "postid": "5937156629",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am Male, Indian, SPR looking for a room near Boonkeng, Kallang or near by that areas..I required Wifi.. Aircon and cooing allowed will be a plus..     ",
        "title": "looking for a room"
    },
    {
        "postid": "5938057856",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n- 3 mins walk to Novena MRT; \n- Furnished Room in Private Estate; \n- A stone's throw away from Novena Medical Hub; \n- No Agent Fee!!! \n- No Owner staying !!!     ",
        "title": "No Agent Fee - Room in Novena"
    },
    {
        "postid": "5946164758",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDear valued Customers, \n \nRENTAL \nSingle lady Tenant,Male,Couple,Two lady looking for common room wanted urgent \nMaster Property Management Professional Marketing Sale &amp; Rental Specialize \nCome to us for your rental needs , Your interest is my priority. \nBest Value Marketing Plan , High Demand , Save Time , Peace Of Mind . \nAggressive Marketing, Property Adviser Free Service . \nWe Believe Best Results Assured . \nFull Commitment Right Person Sincerity &amp; Honesty . \nHome Protection Warranty Plan. \n \nISLANDWIDE MASTER RENTAL SPECIALIZE ,Rentout Within 2Day. \nProfessional Marketing Rental &amp; Sale Management Specialize \nCustomer Interest Is My Priority \n100% Genuine Excellent Service \n \nA POOL OF READY PROFESSIONAL TENANT FAMILY,COUPLE,SINGLE \nALL AREA 4rm/3rm/2m/1rm \nGood budget,Good profile. Network of excellent refer case. \nSIA,CITIBANK,SWISS BANK,NUS,CGH,SGH,PR holder \nProfessional tenant looking to rent in all parts of the country. \nImmediate occupancy. Pls contact me. Thanks. \n \nUnit Type \n \nPrice Range \n \nHDB Common Room : Single($450-$600), couple($600-$800) \nHDB Master Room : Single($900-$1.1k), couple($1k-$1.5K) \n \nCondo Common Room : Single($800-$1200), couple($1100-$100) \nCondo Master Room : Single($1100-$1250), couple($1200-$1600) \n \nHDB 1 room +1 hall flat $1200 - $1500 \nHDB 2 room +1 hall flat $1700 - $2100 \nHDB 3 room +1 hall flat $2000 - $2500 \nHDB 4 room +1 hall flat $2400 - $3600 \nAll price subject on location, condition size feet area of house. \nUnfurnish/partailly furnish/ fully furnish how many air con? \n \nCentral (Newton, Holland Village, River Valley, Orchard, Tanglin) \n \nHouse Wanted Area: Bishan, Ang mo kio, Yishun, Clementi, Jurong, CCK, Woodland, Commonwealth, Queentown, Redhill, Tiong Bahru, Depot road, Telok blangah, Toa payoh, Serangoon, Sengkeng, Punggol, Hougang, Kallang, Aljunied, Eunos , Marine parade, Bedok, Tampines , Pasir ris  \nEast Coast &amp; Bukit Timah. \nApartment  \nPenthouse \nTerraced House  \nBungalow \n \nOwner Pls call me more detail about selling or rental out your house \n \nBusiness Partner Right Person Sincerity &amp; Honesty \nProfessional Service with Personal Touch. \nTenant feedback is an important tool. \n12 year experience full time agent \nThe face you know the experience you trust \nYours sincerely, \nTroy edward +65-91009873 What's app, Viber \nSenior Sale Team Associate Marketing Director \nMCDOWELL REALTY NETWORK \nCEA License Number: L3006213G / R015039A \nCert BY CES/ RES / CPD \nTOP Producer, Top Achievers, Top Lister     ",
        "title": "Single lady looking CommonRm &amp; Masterm Wanted,Queentown,Tiong Bahru"
    },
    {
        "postid": "5935565100",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDear landlords, \nI have a single Chinese Malaysian lady working as auditor and currently holding onto employment pass. She works on a 6 day working week and due to her nature of work, she will be travelling most of the time and location will not be a problem as long as room condition is deem suitable. Cooking is not necessary but would be good if light cooking is allowed. Moving in date is flexible. Please call me (Jeffrey) at 96179459 if you have a room to sublet to my tenant. \n ",
        "title": "&#9733;ROOM WANTED&#9733;Msian-chinese Female Auditor looking for a room!"
    },
    {
        "postid": "5947495498",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY \n \nMOVE IN ANYTIME \nBUDGET UP TO $750 \nWALKABLE TO MRT ONLY \n \nCALL 90222367 SABRINA AGENT  \n \n ",
        "title": "FEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY"
    },
    {
        "postid": "5951501069",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPHILIPINE FEMALE TEACHER LOOKING FOR ROOM NEAR MRT  \nHOUGANG/KOVAN/SENGKANG/SERANGOON \n \nONLY WALKABLE TO MRT PLS \nIMMED \nPREFER TO HAVE WIFI,AC \nBUDGET UP TO $700 \nNEED LIGHT COOK LIKE NOODLE  \n \nCALL 90222367 SABRINA AGENT     ",
        "title": "HOUGANG /SENGKANG MRT ONLY COMMON ROOM WANTED--IMMED"
    },
    {
        "postid": "5900341035",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOwner Profile: Chinese Young Couple + 1yr Old Boy \n \nRoom 1 (Window Facing Corridor) \n \nRoom for rent: Furnished room with Air-conditioning &amp; Wi-Fi (bed and warerobe will be provided) \n \nHouse condition: Newly Furnished \n \nAble to use washing machine, water heater, refrigerator (raw meat &amp; seafood not allowed). Light cooking allowed \n \n \nRate: (Neg) \n \n         - Without Air-conditioning  \n             Single: $650 \n             Couple: $750 \n \n         - With Air-conditioning  \n           Single: $700 \n           Couple: $800 \n \n* Standard 1 month deposit required  \n \n* 1st come 1st serve basis \n \n* I am the direct owner, no agent fees required \n \nAddress: Blk 420 Bukit Batok West Ave 2 \n \nContact Number:     ",
        "title": "Room For Rent (URGENT)"
    },
    {
        "postid": "5947500285",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMALE ARCHITEC FILLIPINO SINGLE NEED COMMON ROOM  \nNEED FURNISH,AC \nLIGHT COOK \nMOVE IN END JAN  \nBUDGET UP TO $700 \nPREFER NEAR MRT WALKABLE DISTANCE \n \nLANDLORD PLS CALL 90222367  SABRINA AGENT  \n ",
        "title": "MALE ARCHITEC FILLIPINO SINGLE NEED COMMON ROOM"
    },
    {
        "postid": "5914609834",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHi area is not specific but ... about once a month I come to Singapore for a week... I only need a bed to sleep on, a hot shower and place to clean up... and internet... I would prefer to stay with a female or couple... I am a single mature man and I come here for work (I am self employed) and I am looking to cut costs... \n \nSo if you have room and want extra money... I have a need  \n \n ",
        "title": "Part time room wanted"
    },
    {
        "postid": "5945983752",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY \n \nMOVE IN ANYTIME \nBUDGET UP TO $750 \nWALKABLE TO MRT ONLY \n \nCALL 90222367 SABRINA AGENT  \n ",
        "title": "FEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY"
    },
    {
        "postid": "5894081635",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTwo common rooms for rent for single or double occupancy. Both rooms have single beds, wardrobe and fans. Live in owner is a mature lady who needs short or long term tenants. Light cooking allowed. Shared toilet and shower facilities. Internet wifi. Indian nationals, Malaysians are welcome. \n \nPer room $750 (shared); Single occupancy $600  (inclusive of utilities) \n \nBlock 279 Tampines St 22 is within walking distance of Simei MRT.  Provision and eating shops are close by.     ",
        "title": "Tampines Room for Rent,Near Simei MRT"
    },
    {
        "postid": "5915807458",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI'm looking for room rent at The SHORE Residences (East Coast). \n \nIf you have a room, please contact me by SMS or whatsapp. Can't receive call. \n \n \nProfile) \nKorean / Male / Working professional(Banking) / 27  \n \n ",
        "title": "Looking for room rent @ The SHORE Residences (East Coast)"
    },
    {
        "postid": "5957174231",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMALE MSIA TENANT MANAGER LOOKING FOR ROOM IN HOUGANG OR SENGKANG IMMED \n \nWOKRING AS MANAGER \nIMMED \nSINGLE MALE MSIA \nNEED NICE CLEAN ROOM \nPREFER NOT TOO FAR FROM MRT \n \nCALL 90222367 SABRINA AGENT  \n ",
        "title": "MALE TENANT MANAGER LOOKING FOR ROOM IN HOUGANG OR SENGKANG ONLY"
    },
    {
        "postid": "5943186333",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLarge common room with shared bathroom available starting early Feb. The house is a 3-bedroom flat (private apartment) in Novena with 1 master room and 2 common rooms. The Master room and 1 common room are currently occupied by my housemate Carlos and I, Apurva. \n \nApartment: \nFully furnished apartment with cable tv, fibre broadband, intercom, appliances and weekly cleaning services \n \nLocation: Quiet neighborhood near several amenities, 7 mins walk from Novena MRT, just behind Tan Tock Seng Hospital, minutes away from Balestier road with several eateries around. \n \nRoom: Large common room, great natural lighting, queen sized bed, closet and storage shelves. Monthly rent is SGD 966. Other costs (utilities, internet, cleaning) come to about SGD 150 per month \n \nDeposit: SGD 1066 \n \nLease Term: June 2016- 2017 with option to renew (I have stayed in this apartment for 5 years so we are likely to renew again come June 2017) \n \nPlease send me a message if you are interested and tell us about yourself. Thanks!     ",
        "title": "Large Common Room in Novena. No agent fees"
    },
    {
        "postid": "5936926218",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nProfessional Ready Tenant, Whole Unit Wanted, Ugently Islandwide Immed  \nDear valued Customers, \n \nISLANDWIDE PROFESSIONAL SALE &amp; RENTAL SPECIALIZE \nThis is why it's important to engage a qualified (certified), honest, driven, reliable, knowledgeable and capable housing agent who can readily give sound advice and work efficiently to address all your property needs. According to your properties' location and condition, we can tell you to improve your Higher Rental income And we can give you valuable advices to help you to improve your Rental price. This is what we want you benefit from our services. \n \nA pool of ready professional tenants' family, couple and single ladies! \nTENANTS are from Malaysia, Hong Kong, Philippine, Europe, USA, Australia, Russia, India, Japan, Korea, Indonesia, China. \nGood budget &amp; Good profile. \nNetwork of excellent refer case(10,000 ex-tenants): SIA, CGH, SGH, NUS, CITIBANK, OCBC BANK, CREDITSWISS BANK, HP CENTRE HQ, POLY STUDENT, PR holders. \nImmediate viewing, deposit plus Rental Advance &amp; occupancy! \nBest Value Marketing Plan, Aggressive Marketing, \nFree Property &amp; Legal Advices, Best Results Assured, \nFull Commitment, Right Person Sincerity &amp; Honesty. \nCustomer interest is our first priority, 100% genuine excellent service \n \n&lt;&lt;&lt; Price range depends on location, condition, furnish of the unit and size of the house &gt;&gt;&gt;  \nPlease contact us for FREE consultant, Marketing and analyze of your property.  \n \nYour friendly and reliable agent, you are always looking for. \nWe invite home owners to preview our marketing program. \nYou and your family can receive following benefits: \n \nOwner Benefits 33 Services of a Corporate / Company / Personal Lease: \n \nCall My Service: \n \nSTEP 1 : SALES &amp; RENTAL CALL TROY @ 91009873 for free property advices. \n \nSTEP 2 : Excellent Reputation and Strong Network Recommendation of 10000 ex-tenants, I can help you to find you preferred tenants for your property. \n \nSTEP 3 : We have enough experience and knowledge to market your property, provide you best coordination with the right price and good tenant that owners are looking for. \n \nSTEP 4 : Master the principal terms &amp; conditions in rental market, mindset of CEO. \n \nSTEP 5 : Don't waste your empty house - renting out your house is the fastest legal way to ensure a stable monthly cash flow during the economic downturn. \n \nSTEP 6 : We are always listening and understanding the customers' needs, and we are always there for you. We provide free legal advice to help you manage the property easily and avoid the unnecessary problems. \n \nMarketing the property: \n \nSTEP 7 : If you're looking to rent out your house and start collecting rental at the shortest time possible, you've found the right contact point. We are a team of full-time brokers specializing in rental. Just name us your requirements for your preferred tenants and we will proceed to match your house with our database of tenants immediately! \n \nSTEP 8 : We are expert in bringing suitable people &amp; properties together in shortest time. Customers' satisfaction guaranteed. We'd like to build a win-win situation for both parties. \n \nSTEP 9 : If you need to do some maintenance and decoration in the house, we have the contacts which provides cheap service charge and items, such as 50% discount of new furniture, cheap second hand furniture, cheap aircon chemical service, general cleaning service, movers, handyman. \n \nSTEP 10 : We will give you proper advice on pricing and presentation of your house, makeover to ensure you can get good deal. \n \nSTEP 11 : We do the free advertisement on newspaper, public areas and internet for you properties. \n \nSTEP 12 : According to the market rate, we will help you get the high rental. So you can seat back and get the expansion of your financial freedom. \n \nSTEP 13 : We have company lease tenants for you and they will accept all kind of unit conditions. If they have any requirement, we will subject to your approval and then the company lease tenants will furnish the unit themselves. \n \nSTEP 14 : We will verify the tenant's particulars document to make sure the tenants legal staying. \n \nSTEP 15 : All the viewers I brought to view your house with Higher budget and Positive Feedback. \n \n \nSigning the Tenancy Agreement: \n \nSTEP 16 : If owner go oversea and need to apply power of Attorney for the property from Law firm, we can give you the contact of the lawyer who charges the cheapest in Singapore. \n \nSTEP 17 : Verification of the tenant &amp; company lease office and business profile that Registered in Singapore. \n \nSTEP 18 : The agreement we use for your property is Professional Rental Management Tenancy Agreement to make sure you can rent out the flat peace of mind. \n \nSTEP 19 : I will give you my Home protection warranty plan to protect your properties! \n \nSTEP 20 : The one time commission payment protects landlords and tenants for the entire tenancy period which is one year lease up to 2 years lease. \n \nSTEP 21 : If you are too busy to go to the HDB office to get the approval, we can apply the HDB approval online for you. \n \nSTEP 22 :We are expert in bringing suitable people &amp; properties together in shortest time. \n \nSTEP 23 : We will apply the utility under the tenant name. \n \nSTEP 24 : We will do the stamp duty for your property after signing Tenancy Agreements (TA) at IRAS; the cost is to be paid by the tenants. \n \nSTEP 25 : Fuss Free, Prompt Payment of rental every month through GIRO / Standard Order through company account. \n \nSTEP 26 : We are professional marketing property management consultant analysis, master in HDB, Condo, Landed Properties' tenancy law and procedures. \n \nSTEP 27 : Once professional property management Tenancy Agreement signed, there will be no dispute and problem during the whole tenancy period with our unique services. \n \nSTEP 28 :Checking on tenants every month WITH RECORD to ensure that compliance with Tenancy Agreement(TA) is expected of all the tenants. \n \nDuring the lease \n \nSTEP 29 : Our honest, transparent and fair terms and conditions to help owners and tenants to get along well and solve any issues during the whole tenancy. There will be no worries and no problem between both parties. If there is anything you need my help, just give me a call I will come and solve your problems immediately. \n \nSTEP 30 : We will keep tracking of the tenants' particulars' validity in order to make sure they are legally staying in Singapore. \n \nSTEP 31 : We provide you free inspection of inventory check at the end of the tenancy lease. \n \nSTEP 32 : We provide you free general cleaning and air con service. \n \nSTEP 33 : Two months before end of the tenancy, we will check with the current tenants whether they want to continue to stay inside the property with your approval. If the tenants decide to move out, we will inform you immediately and by your approval to find suitable new tenants to match your requirements in time. We will make sure you won't lose any rental income. \n \n \nProfessional Service with Personal Touch. \nTenant feedback is an important tool. \n12 year experince full time agent Since 2003 \n \nYours sincerely, \nTroy Edward 91009873 \nSenior Sale Team Associate Marketing Director \nMCDOWELL REALTY NETWORK \nCEA License Number: \nL3006213G / R015039A \nCertify BY RES / CPD \nHDB RESALENET AGENT \n \nProperty Management Analysis \nRental , Sale , Buyer , HDB , Condo , Landed Properties \nProfessional Rental , Sale Specialize \nYour Perfect Real Estate Business Partner, Right Person     ",
        "title": "Professional Ready Tenant, Whole Unit,Masteroom,Common rm Immed"
    },
    {
        "postid": "5951482116",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY \n \nMOVE IN ANYTIME \nBUDGET UP TO $650 \nWALKABLE TO MRT ONLY \n \nCALL 90222367 SABRINA AGENT  \n ",
        "title": "FEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY"
    },
    {
        "postid": "5934242898",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n•\tFacilities includes  \n1. 24 hr Security (main gate, biometric system, card \naccess system and camera/video recording) \n2. Air-conditioned rooms(from 9pm to 7 am daily) \n3. Laundry facility -- coin operated \n4. Communal Toilet (male/female separate) / Shower Heater \n5. Room (aircon,fan,lights,bed,cupboard,table and \nChair) \n6. Pantry Area with Refrigerator  \n7. Housekeeping once a week upon request \n8. Student Lounge &amp; Study rooms \n9. Cafeteria \n10. Free Wi-Fi access @ designated area \n11. 24 hour hot and cold water dispensers \n12. Sports facilities inclusive (Indoor \nBadminton court/Basketball/Football field) \n•\tServices includes  \n1.\tAirport Transfer 3. Student Visa  \n2. Counseling &amp; special needs support \n \nType of Room \n4 Person Sharing  \nRoom Rental Rates \n(Minimum 6 months contract) \nS$650.00/month \nRoom Rental Rates \n(1-5 months contract) \nS$720.00/month \n \n6 Person Sharing \nRoom Rental Rates \n(Minimum 6 months contract) \nS$440.00/month \nRoom Rental Rates \n(1-5 months contract) \nS$480.00/month \n \nType of Room \n8 Person Sharing \nRoom Rental Rates \n(Minimum 6 months contract) \nS$325.00/month \nRoom Rental Rates \n(1-5 months contract) \nS$360.00/month \n \n \n \nWebsite: www.careline.com.sg \nFacebook Page: Careline Hostel \nContact No. 93374721 \n ",
        "title": "Careline Hostel"
    },
    {
        "postid": "5951483101",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nINDONESIA MALE SMU STUDENT LOOKING FOR ROOM IN HOUGANG OR SENGKANG \n \nFULL FURNISH WITH AC \nBUDGET UP TO $650 \nIMMED \nPREFER WALKABLE TO MRT  \n \nCALL SABRINA AGENT 90222367 \n \n \n ",
        "title": "INDONESIA MALE SMU STUDENT LOOKING FOR ROOM IN HOUGANG OR SENGKANG"
    },
    {
        "postid": "5903212244",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMaster Room Fully Furnished 940SGD per month. \n \nVideo -&gt; https://youtu.be/7x1afwWgp04 \n \nNo Agent Fee, No Owner Staying. \n \nMax of 2 pax only. \nWe do not accept short term lease or transient. \nLocation: BLK 131 Bedok Reservoir 470131 \nBus 61,65,66,8,506,21,60,22,CT18. \nStraight Bus to Orchard. \nStraight Bus to Chinatown. \nStraight Bus to Paya lebar. \nStraight Bus to Eunos Mrt. \nStraight Bus to Bedok Mrt. \nNear to Giants grocery, community centre gym, basketball court, wet market, KFC, Mcdo. \n7-8 minutes bus to Eunos Mrt \n8-9 minutes bus to Bedok Mrt. \nCurrently All Filipino tenants. \nPUB shared among tenants. \nCan cook, do laundry, with AC and wifi (1 gbps) and Starhub cable. \nWhatsapp 9466 8701 look for James \nAvailable Immediately. \n1 month advanced and 1 month security deposit. (original 2 months deposit)     ",
        "title": "Master Room Blk 131 Bedok Reservoir"
    },
    {
        "postid": "5918768848",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nprefer indonesia or malaysia chinese. fully furnished condo common room in the east.utilities wifi all included. near paya lebar mrt.     ",
        "title": "looking for female professional tenant utilities included"
    },
    {
        "postid": "5957161328",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nProfessional Ready Tenant, Whole Unit Wanted, Ugently Islandwide Immed  \nDear valued Customers, \n \nISLANDWIDE PROFESSIONAL SALE &amp; RENTAL SPECIALIZE \nThis is why it's important to engage a qualified (certified), honest, driven, reliable, knowledgeable and capable housing agent who can readily give sound advice and work efficiently to address all your property needs. According to your properties' location and condition, we can tell you to improve your Higher Rental income And we can give you valuable advices to help you to improve your Rental price. This is what we want you benefit from our services. \n \nA pool of ready professional tenants' family, couple and single ladies! \nTENANTS are from Malaysia, Hong Kong, Philippine, Europe, USA, Australia, Russia, India, Japan, Korea, Indonesia, China. \nGood budget &amp; Good profile. \nNetwork of excellent refer case(10,000 ex-tenants): SIA, CGH, SGH, NUS, CITIBANK, OCBC BANK, CREDITSWISS BANK, HP CENTRE HQ, POLY STUDENT, PR holders. \nImmediate viewing, deposit plus Rental Advance &amp; occupancy! \nBest Value Marketing Plan, Aggressive Marketing, \nFree Property &amp; Legal Advices, Best Results Assured, \nFull Commitment, Right Person Sincerity &amp; Honesty. \nCustomer interest is our first priority, 100% genuine excellent service \n \n&lt;&lt;&lt; Price range depends on location, condition, furnish of the unit and size of the house &gt;&gt;&gt;  \nPlease contact us for FREE consultant, Marketing and analyze of your property.  \n \nYour friendly and reliable agent, you are always looking for. \nWe invite home owners to preview our marketing program. \nYou and your family can receive following benefits: \n \nOwner Benefits 33 Services of a Corporate / Company / Personal Lease: \n \nCall My Service: \n \nSTEP 1 : SALES &amp; RENTAL CALL TROY @ 91009873 for free property advices. \n \nSTEP 2 : Excellent Reputation and Strong Network Recommendation of 10000 ex-tenants, I can help you to find you preferred tenants for your property. \n \nSTEP 3 : We have enough experience and knowledge to market your property, provide you best coordination with the right price and good tenant that owners are looking for. \n \nSTEP 4 : Master the principal terms &amp; conditions in rental market, mindset of CEO. \n \nSTEP 5 : Don't waste your empty house - renting out your house is the fastest legal way to ensure a stable monthly cash flow during the economic downturn. \n \nSTEP 6 : We are always listening and understanding the customers' needs, and we are always there for you. We provide free legal advice to help you manage the property easily and avoid the unnecessary problems. \n \nMarketing the property: \n \nSTEP 7 : If you're looking to rent out your house and start collecting rental at the shortest time possible, you've found the right contact point. We are a team of full-time brokers specializing in rental. Just name us your requirements for your preferred tenants and we will proceed to match your house with our database of tenants immediately! \n \nSTEP 8 : We are expert in bringing suitable people &amp; properties together in shortest time. Customers' satisfaction guaranteed. We'd like to build a win-win situation for both parties. \n \nSTEP 9 : If you need to do some maintenance and decoration in the house, we have the contacts which provides cheap service charge and items, such as 50% discount of new furniture, cheap second hand furniture, cheap aircon chemical service, general cleaning service, movers, handyman. \n \nSTEP 10 : We will give you proper advice on pricing and presentation of your house, makeover to ensure you can get good deal. \n \nSTEP 11 : We do the free advertisement on newspaper, public areas and internet for you properties. \n \nSTEP 12 : According to the market rate, we will help you get the high rental. So you can seat back and get the expansion of your financial freedom. \n \nSTEP 13 : We have company lease tenants for you and they will accept all kind of unit conditions. If they have any requirement, we will subject to your approval and then the company lease tenants will furnish the unit themselves. \n \nSTEP 14 : We will verify the tenant's particulars document to make sure the tenants legal staying. \n \nSTEP 15 : All the viewers I brought to view your house with Higher budget and Positive Feedback. \n \n \nSigning the Tenancy Agreement: \n \nSTEP 16 : If owner go oversea and need to apply power of Attorney for the property from Law firm, we can give you the contact of the lawyer who charges the cheapest in Singapore. \n \nSTEP 17 : Verification of the tenant &amp; company lease office and business profile that Registered in Singapore. \n \nSTEP 18 : The agreement we use for your property is Professional Rental Management Tenancy Agreement to make sure you can rent out the flat peace of mind. \n \nSTEP 19 : I will give you my Home protection warranty plan to protect your properties! \n \nSTEP 20 : The one time commission payment protects landlords and tenants for the entire tenancy period which is one year lease up to 2 years lease. \n \nSTEP 21 : If you are too busy to go to the HDB office to get the approval, we can apply the HDB approval online for you. \n \nSTEP 22 :We are expert in bringing suitable people &amp; properties together in shortest time. \n \nSTEP 23 : We will apply the utility under the tenant name. \n \nSTEP 24 : We will do the stamp duty for your property after signing Tenancy Agreements (TA) at IRAS; the cost is to be paid by the tenants. \n \nSTEP 25 : Fuss Free, Prompt Payment of rental every month through GIRO / Standard Order through company account. \n \nSTEP 26 : We are professional marketing property management consultant analysis, master in HDB, Condo, Landed Properties' tenancy law and procedures. \n \nSTEP 27 : Once professional property management Tenancy Agreement signed, there will be no dispute and problem during the whole tenancy period with our unique services. \n \nSTEP 28 :Checking on tenants every month WITH RECORD to ensure that compliance with Tenancy Agreement(TA) is expected of all the tenants. \n \nDuring the lease \n \nSTEP 29 : Our honest, transparent and fair terms and conditions to help owners and tenants to get along well and solve any issues during the whole tenancy. There will be no worries and no problem between both parties. If there is anything you need my help, just give me a call I will come and solve your problems immediately. \n \nSTEP 30 : We will keep tracking of the tenants' particulars' validity in order to make sure they are legally staying in Singapore. \n \nSTEP 31 : We provide you free inspection of inventory check at the end of the tenancy lease. \n \nSTEP 32 : We provide you free general cleaning and air con service. \n \nSTEP 33 : Two months before end of the tenancy, we will check with the current tenants whether they want to continue to stay inside the property with your approval. If the tenants decide to move out, we will inform you immediately and by your approval to find suitable new tenants to match your requirements in time. We will make sure you won't lose any rental income. \n \n \nProfessional Service with Personal Touch. \nTenant feedback is an important tool. \n12 year experince full time agent Since 2003 \n \nYours sincerely, \nTroy Edward 91009873 \nSenior Sale Team Associate Marketing Director \nMCDOWELL REALTY NETWORK \nCEA License Number: \nL3006213G / R015039A \nCertify BY RES / CPD \nHDB RESALENET AGENT \n \nProperty Management Analysis \nRental , Sale , Buyer , HDB , Condo , Landed Properties \nProfessional Rental , Sale Specialize \nYour Perfect Real Estate Business Partner, Right Person     ",
        "title": "Professional Ready Tenant, Whole Unit,Masteroom,Common rm Immed"
    },
    {
        "postid": "5938246759",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLarge L shape room in house on Upper East Coast Road / Wifi / Aircon / Fully furnished / Opposite bus stops to Shenton Way business districts , Orchard Road , Expo , Serangoon road / Bus shuttles or 10mn walk to MRT station / 10mn walk to East coast park &amp; seaside / Close to food centers &amp; Shops / Single Professional Only / Available now / S$950 per month / Call Owner : 96346594     ",
        "title": "Large room in house on Upper east Coast Road"
    },
    {
        "postid": "5940608902",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLarge L shape room in house on Upper East Coast Road / Wifi / Fully furnished / Aircon / Opposite bus stops to Shenton way business districts , Orchard road , Expo &amp; Serangoon road / Bus shuttles or 10mn walk to Tanah Merah MRT station / Close to food centers &amp; shops / Single professional Only / S$950 per month / Call Owner : 96346594     ",
        "title": "Large room in house on Upper east Coast Road"
    },
    {
        "postid": "5957177525",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMALE ARCHITEC FILLIPINO SINGLE NEED COMMON ROOM  \nNEED FURNISH,AC \nLIGHT COOK \nMOVE IN END JAN  \nBUDGET UP TO $700 \nPREFER NEAR MRT WALKABLE DISTANCE \n \nLANDLORD PLS CALL 90222367  SABRINA AGENT  \n \n ",
        "title": "WANTED COMMON ROOM FOR MALE ARCHITEC"
    },
    {
        "postid": "5897897227",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nTo all, I'm 30 years old female professional looking to rent a Decent Private Room. I'm specifically looking at this area as I'm studying part-time in the evening and working in the East-Central during the day.  \n \n•Wilkie Road •Selegie •Mount Sophia •Nearby KK hospital •Farrer Road •Little India •Dhoby Ghaut •Somerset •Orchard  \nMy Budget $400 (slight negotiable) Utilities &amp; Wifi Included.  \n \nHere's the thing, I'm open to any male/female owners. If you're single/couple working professional and have extra room But having second doubt over Cleanliness, Privacy, or Trust issues, you can put on ease. Nothing like Airbnb guest. I am 100% criminal free, good knowledge about Singapore, Flexible &amp; have good EQ and Care for the environment (live with fan, use electricity wisely). Sometimes money is not the issue, but a Friend to exchange greetings, share opinions, cooking/fitness/wine buddy or hangout during the free time. I am friendly, non judgemental, calm and happy go lucky type of person.  \nI'm looking at 1 year rental.  Jan/Feb 2017 - Dec 2017. But I understand that sometimes we still do have some doubts over something, so I'm willing to do short term rental for 6 months and review again. Of coz on my side I need to consider and make sure I'm not living with a Psychopath:) Only Genuine reply please, so we won't waste each other time.  \n \n*Sorry no agent. Prefer to deal with owner themselves.  \n \nSome notes about me  \nStraight&#10004;&#65039; \nSingle&#10004;&#65039; \n \n \n ",
        "title": "Decent Private Room for a 30 years old Female Professional"
    },
    {
        "postid": "5915808593",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for a room rent nearby Botanic Garden or Stevens. \n \nProfile) \nKorean / Male / 27 / Working Professional(Banking) \n \nPlease contact me by SMS or whatsapp. \n \nI can't receive a call as I'm in the office.     ",
        "title": "Looking for room rent @ Botanic Garden / Stevens"
    },
    {
        "postid": "5926290902",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking to rent a studio apartment for 12 months. Budget max S$1,700 pm. \nShould be fully furnished, with washer/dryer. \nI am a professional Caucasian male, aged 48 working in the Finance industry     ",
        "title": "Looking for an apartment"
    },
    {
        "postid": "5891272244",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBlk 660B Jurong West common room for rent $900 Only \n2 person $900  \n1 person $800 \n5 min walk to Lakeside mrt \nS'664660 \n(lady or man) Available on any time \nFurnished include utilities Aircon and wifi \nfrom 1.11.2016 start move in \nchinese owner \nPlease call / Ouw 98765497     ",
        "title": "Blk 660B Jurong West common room for rent $900 Only"
    },
    {
        "postid": "5957176166",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY \n \nMOVE IN ANYTIME \nBUDGET UP TO $750 \nWALKABLE TO MRT ONLY \n \nCALL 90222367 SABRINA AGENT  \n ",
        "title": "FEMALE TEACHER LOOKING FOR ROOM IN SENGKANG OR HOUGANG MRT ONLY"
    },
    {
        "postid": "5947512570",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDear valued Customers, \n \nRENTAL \nSingle lady Tenant,Male,Couple,Two lady looking for common room wanted urgent \nMaster Property Management Professional Marketing Sale &amp; Rental Specialize \nCome to us for your rental needs , Your interest is my priority. \nBest Value Marketing Plan , High Demand , Save Time , Peace Of Mind . \nAggressive Marketing, Property Adviser Free Service . \nWe Believe Best Results Assured . \nFull Commitment Right Person Sincerity &amp; Honesty . \nHome Protection Warranty Plan. \n \nISLANDWIDE MASTER RENTAL SPECIALIZE ,Rentout Within 2Day. \nProfessional Marketing Rental &amp; Sale Management Specialize \nCustomer Interest Is My Priority \n100% Genuine Excellent Service \n \nA POOL OF READY PROFESSIONAL TENANT FAMILY,COUPLE,SINGLE \nALL AREA 4rm/3rm/2m/1rm \nGood budget,Good profile. Network of excellent refer case. \nSIA,CITIBANK,SWISS BANK,NUS,CGH,SGH,PR holder \nProfessional tenant looking to rent in all parts of the country. \nImmediate occupancy. Pls contact me. Thanks. \n \nUnit Type \n \nPrice Range \n \nHDB Common Room : Single($450-$600), couple($600-$800) \nHDB Master Room : Single($900-$1.1k), couple($1k-$1.5K) \n \nCondo Common Room : Single($800-$1200), couple($1100-$100) \nCondo Master Room : Single($1100-$1250), couple($1200-$1600) \n \nHDB 1 room +1 hall flat $1200 - $1500 \nHDB 2 room +1 hall flat $1700 - $2100 \nHDB 3 room +1 hall flat $2000 - $2500 \nHDB 4 room +1 hall flat $2400 - $3600 \nAll price subject on location, condition size feet area of house. \nUnfurnish/partailly furnish/ fully furnish how many air con? \n \nCentral (Newton, Holland Village, River Valley, Orchard, Tanglin) \n \nHouse Wanted Area: Bishan, Ang mo kio, Yishun, Clementi, Jurong, CCK, Woodland, Commonwealth, Queentown, Redhill, Tiong Bahru, Depot road, Telok blangah, Toa payoh, Serangoon, Sengkeng, Punggol, Hougang, Kallang, Aljunied, Eunos , Marine parade, Bedok, Tampines , Pasir ris  \nEast Coast &amp; Bukit Timah. \nApartment  \nPenthouse \nTerraced House  \nBungalow \n \nOwner Pls call me more detail about selling or rental out your house \n \nBusiness Partner Right Person Sincerity &amp; Honesty \nProfessional Service with Personal Touch. \nTenant feedback is an important tool. \n12 year experience full time agent \nThe face you know the experience you trust \nYours sincerely, \nTroy edward +65-91009873 What's app, Viber \nSenior Sale Team Associate Marketing Director \nMCDOWELL REALTY NETWORK \nCEA License Number: L3006213G / R015039A \nCert BY CES/ RES / CPD \nTOP Producer, Top Achievers, Top Lister     ",
        "title": "Single lady looking CommonRm &amp; Masterm Wanted,Queentown,Tiong Bahru"
    },
    {
        "postid": "5939480728",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLarge L shape room in house on Upper East Coast Road / Wifi / Aircon / Fully furnished / Opposite bus stops to Shenton way business districts , Orchard road , Expo , Serangoon road / Opposite bus shuttles to MRT station or 10mn walk  / 10mn walk to East Coast Park &amp; seaside / Close to food centers &amp; shops / Single Professional only / S$ 950 per month / Call Owner : 96346594     ",
        "title": "Large room in house on Upper east Coast Road"
    },
    {
        "postid": "5915809115",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for a room rent nearby Tiong Bahru (Condo) \n \nProfile) \nKorean / Male / 27 / Working Professional(Banking) \n \nPlease contact me by SMS or whatsapp. \n \nI can't receive a call as I'm in the office.     ",
        "title": "Looking for room rent @ Tiong Bahru (Condo)"
    },
    {
        "postid": "5955743960",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSingle guy looking for a Master bed room or bed room. for short stay 2 months January &amp; February 2017.  \n \nContact me.     ",
        "title": "Single Bed room (Master preferred)"
    },
    {
        "postid": "5937045263",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBlk 660B Jurong West common room for rent $900 Only \n2 person $900  \n1 person $800 \n5 min walk to Lakeside mrt \nS'664660 \n(lady or man) Available on any time \nFurnished include utilities Aircon and wifi \nfrom 1.11.2016 start move in \nchinese owner \nPlease call / Ouw 98765497     ",
        "title": "Blk 660B Jurong West common room for rent $900 Only"
    }
]