[
    {
        "postid": "5952966118",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for IT savvy partners and associates to organize and operate various international lotteries across numerous European jurisdictions. Experience with the gambling industry is an added advantage.  \nSend us your resume, work experience and tell us how your capabilities could contribute and add value to our company. \n \nAll proposals considered seriously and treated in the strictest confidence. Only responders who qualify under our selective criteria will be contacted. \n \nNo financial investment required. \n ",
        "title": "BUSINESS PARTNERS WANTED"
    },
    {
        "postid": "5918264887",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDo you have knowledge of Legacy System &amp; Data Migration? \nDo you have contacts with Multinational Companies? \nDo you have passion for Sales &amp; Marketing? \nDo you have experience in Lead generation? \n \n \nIf the answers for above questions is yes, then you are qualified for this work.  \n \n \nWe are offering basically Deployer used for data migration from legacy systems to SharePoint or from SharePoint to SharePoint. Deployer is a world renowned migration tool used by many fortune 100/500 companies, government departments, US army and many big organizations. \n \nOne of the major USP of this product is: it is the only product which can migrate Oracle Aqualogic to SharePoint. \n \nWe offer Deployer tool and whole migration project and the price will vary according to the client's source and data volume. \n \n \nBackground: We call like LiveLink, LotusNotes, Documentum, Docushare, Aqualogic, eRoom, Exchange, Hummingbird Dm 5, etc legacy ECMs (Enterprise content management) (that has been in practice before MS SharePoint came into market), and our aim is to target clients who want to migrate from these Legacy Systems to SharePoint or from previous versions of SharePoint to newer version of SharePoint (or convince them to migrate). \n \n \nWork: Get leads who will be interested for the legacy system and data migration. Provide direct contact details, Company Name, Contact person, Position in Company, Mobile number and email id. \n \n \nCompensation: You will get 2 to 5% of the total amount, which will range from thousand to millions of each deal that is closed. \n \n \nThis is Work from anywhere job and doesn't require any specific time or amount of work. Amount you make will depend on how much valid leads you generate. \n \n \nP.S: This is not HOAX and only reply if you are genuinely interested and highly driven to make a successful career out of it. \n \n \nPlease reply with your CV, if interested. \n \n \n \n ",
        "title": "Work from anywhere as per your preference!!"
    },
    {
        "postid": "5957233182",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nResponsibilities: \n \n- Responsible for system support and maintenance of in-house developed and COTS Application System \n- Develop, test and implement of ICT solution as and when required \n- Manage Vendor on delivery of ICT solution and project.   \n- Liaising and collaborate with user on system matters \n- Participate in requirements gathering and solutioning as and when required. \n- Provide technical and functional documentation.   \n- Provide training to user. \n \n \nRequirements: \n \n- Diploma or higher in Computer Science, Computer Engineering, Information Systems Management or equivalent \n- Minimum 2 years of working experience in application software development on MS .Net platform.  - Working experience with relational database like Oracle and SQL server will be essential.  \n- Experience with PL/SQL will be advantageous. \n- Minimum 2 years working experience in logistics environment, knowledge on warehouse management system will be an advantage \n- Good understanding on interfaces between systems \n- Knowledge on mobile and handheld development will be an advantage \n- Resourceful and able to work independently \n- Possesses strong analytical, troubleshooting and problem solving skills \n- Positive and with good interpersonal and communication skills \n- Singaporean only \n \n \nInterested candidates, please send us your detailed resume in MS word format, attached with your recent photograph, stating your current/last drawn &amp; expected salary to \n  show contact info \n (Reg No. R1658303, EA Lic. No.: 02C2819)     ",
        "title": "Software Engineer (Warehouse Management System)"
    }
]