[
    {
        "postid": "5946246994",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCall out for INTERNET SINGERS \nWe are looking for singer for public performances like Festive shows, events and Dinners. \n If you are passionate about singing and keen to perform, you are the one that we are looking for! \n \nCriteria:  No age limit / No experience required / Good attitude and personality / Able to work as a team \n \nPlease SMS / WhatsApp 9734 5915 for audition: \n- Name, as in NRIC \n- Age \n- Gender \n- Occupation  \n ",
        "title": "Call out for INTERNET SINGERS"
    },
    {
        "postid": "5958534790",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLet the World Hear Your Voice \nA new ONLINE PLATFORM for you to showcase your talents,  \nlet the others listen to your voice and know about you!  \n \nIf you are PASSIONATE ABOUT MUSIC and PERFORMING, contact us now for audition. \n \nCriteria:  No age limit / No experience required / Good attitude and personality / Able to work as a team \n \nPlease SMS / WhatsApp 9734 5915: \n- Name, as in NRIC \n- Age \n- Gender \n- Occupation \n ",
        "title": "Let the World Hear Your Voice"
    },
    {
        "postid": "5957206934",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nAre you an aspiring model looking to enter the industry? \nLooking for a fun and interesting part time job? \n \nWe will provide a complimentary professional photoshoot along with further work opportunities for events and corporate videos.  \n \nKindly send us 5 of your best looking photos, (with one full body and close up) to \n  show contact info \n \n \nApply now and begin your path to stardom! =D \n \n ",
        "title": "Calling for all Aspiring Models!!!"
    },
    {
        "postid": "5921993702",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nI am searching for a female model between 18-21 years old 175-180 cm tall and attractive like a Johanna Cure, Adriana Lima, etc. Please enclose photo and measurements with reply. Also are you willing to relocate to USA.     ",
        "title": "Model Search"
    },
    {
        "postid": "5927302853",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are looking or clean women to travel to outer Islands and make Adult Films of all kinds. We are also looking for Adult Talent to travel all over Asia to pose for Photographs and to attend car shows and Holiday parties. We require that you send photographs are video taken of all your naked body. It helps the process go quicker and the ones that do that. We will be getting back in touch with you to set up casting shoot and go over Contract. Thank you all and Virgin gets an extra bonus. Most of our girls make $5000.00 \nTo $20,000.00 U. S. Dollars a month     ",
        "title": "LOOKING FOR ADULT TALENT FOR ADULT MOVIES AND MAGAZINES"
    },
    {
        "postid": "5958534504",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for a Platform to perform your Singing Talents? \nWe provide various platforms for our artists to perform like: Company's Dinner &amp; Dance, Themed Parties, Festive Shows and etc. \n \nDon't waste your talents at home or in the bathroom. Contact us now! \n \nCriteria:  \n- Passionate in Singing is a must!  \n- No age limit \n- No experience required \n- Good attitude and personality \n- Willing to commit for rehearsals (if selected)  \n- Able to work as a team \n \nCall or Text 9734 5915 for audition with your Name / Age/ Gender / Occupation. \n ",
        "title": "Looking for a Platform to perform your Singing Talents?"
    },
    {
        "postid": "5897184636",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nneed someone to help installin apps into KODI android tv app     ",
        "title": "kodi app"
    }
]