[
    {
        "postid": "5906220943",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a 3 bedroom unit with a living room, dining area, and a kitchen. (Picture is of sample unit, you might not get the exact unit as in the pictures. Layout is the same, furnishing might differ.) \n \nGetting around \n \n- 10-15 minutes walking distance to Clementi MRT station and Clementi Mall \n \n- 2 Minutes walking distance to nearby Food court / Supermarket / Dominos Pizza / ATM ( POSB &amp; UOB ) \n \nNumerous feeder bus services are available near your apartment. Guest can head down to the nearby West Coast Drive Market for daily necessities or alternatively, go to Clementi Town Centre for a suite of amenities such as supermarkets, restaurants and eating establishments, banks, and an upcoming mega mall.     ",
        "title": "Singapore Clementi WCW 3BR Srvcd Apt"
    },
    {
        "postid": "5938629725",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5937050013",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a 2 bedrooms apartment in the East side of Singapore with a double bed each. The apartment also features a food prep and cooking area where you can make simple meals on day you don't feel like eating at the near by restaurants and stalls. \n \nThe first room is furnished with a queen-size bed and the second room has same queen-size beds. Bedlinen are provided which includes: mattress protector, bed sheets, blanket with duvet cover, pillow and pillow case. There is an open closet area with an Iron and ironing board. Broadband internet access via WIFI. \n \nThe room also has air conditioning with individual temperature control.     ",
        "title": "Great Apartment In Perfect Location In Singapore"
    },
    {
        "postid": "5926522034",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBrand new furnished apartment. Professionally designed and decorated with custom kitchen with modern european cabinets, new stainless steel appliances and quartz counters with island. The living area has custom cabinetry for storage with built in work desk and entertainment center including a 40' LED Smart TV, Blu-ray player, digital cable and reliable high speed wireless internet. Comfortably sleep up to 4 with the leather queen size platform bed and double size fold out sofa bed. The bathroom has been completely gutted and has a new deep bathtub, new tiles and a modern suspended vanity. Stylish top quality furniture has been hand picked by our designer to fit the space perfectly and provide the most functional layout. The suite has queen bed and a sofa bed to comfortably sleep up to 4. \n \nAll utilities are included with high speed wireless internet and digital cable. Cookware, linens, towels and everything else is included as well. Just bring your clothes, we'll take care of the rest!     ",
        "title": "Brand New Luxury One Bedroom Apartment with free Airport pickup!!!!!!!"
    },
    {
        "postid": "5926524157",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe apartment is very quiet and located at the third floor with elevator of an elegant building. The interiors are spacious, furnished with care and very bright from the morning till the late afternoon. When you enter the apartment you are in a comfortable entrance leading up to the spacious living room. The living together with the dining room are the hearth of the apartment, from the living you can access the first bedroom, the bathroom and the dining room. From the dining room you will able to access the other two separate bedrooms. The living room comes with a large and comfortable corner sofa, that becomes a standard double bed, an armchair and a 50'' wide led television. All the 3 bedrooms are equipped with queen size beds, the first one comes also with a nice fireplace, the second is roomy enough to eventually guest an extra bed on request. The dining room comes with American kitchen and a table that once opened accommodate up to 8 guests. The kitchen comes with gas stoves, oven, microwave, refrigerator, freezer and cattle. The bathroom comes with a wide Jacuzzi bathtub with telephone shower, sink wc and bidet. In a separate room there is also the washing machine.     ",
        "title": "Amazing 3 bedrooms apartment in Orchard Road@@@@@@@@@@@"
    },
    {
        "postid": "5937227601",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n32% DISCOUNT from Grand Copthorne Waterfront, Singapore \n \nMore details and booking below  \n \nhttps://wttravellerdeals.wordpress.com/2016/12/29/b-en-32-percent-discount-from-grand-copthorne-waterfront-singapore/ \n \nAny enquiry, please send to #wttraveller Facebook \n \nFacebook.com/wttraveller     ",
        "title": "32% DISCOUNT from Grand Copthorne Waterfront"
    },
    {
        "postid": "5910496983",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis two bedroom corner unit has an incredible natural light and provides an amazing panoramic view. As one of the most coveted spots in the Orchard section of Singapore, this residence is just minutes away from all sorts of cafes, restaurants, shopping. In addition, for those common needs both a grocery store and metro station are just a few minutes walk away. \nThe building is filled with some of the best amenities out there including an amazing indoor swimming pool, as well as an outdoor pool and gym facilities. Inside the apartment enjoy the feeling of being in a home away from home. This open floor plan allows for the entire family to relax while watching television, using the work space with the free wireless internet, or eating in the dining area. The large and bright galley kitchen has all the most modern and Western stainless steel appliances available, perfect for the home cook who loves to make a few meals whilst on holiday.     ",
        "title": "Orchard District,WiFi,Swimming Pools, Spas"
    },
    {
        "postid": "5937039862",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe apartment is luxurious and spacious, the apartment are designer furnished with your utmost comfort in mind.The building is 4 stops away from Novena MRT station (which is easily accessible to City, Toa Payoh &amp; Ang Mo Kio). 10 bus stops to Orchard MRT station. Approximately 4 mins walk to Shaw Plaza where supermarket, Cineplex and Bank are located. Many famous eateries are within min walk. \n \nOne bedroom, defined living and dining areas and a well-equipped kitchen with designer appliances. Our residents have complimentary and unlimited access to our full range of thoughtfully-designed facilities and services: \n \n-High speed Wifi and cable TV \n \nFully equipped Kitchen including: \n \n-Microwave Oven \n \n-Cooker hob and hood \n \n- Glassware, crockery, cutlery &amp; utensils \n \n- Electric Kettle \n \n- Refrigerator \n \n- Washer dryer     ",
        "title": "Great Place To Stay In A Great Location"
    },
    {
        "postid": "5937044230",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis house is just a 2 minute walk to Holland Village and Holland MRT. It is also a 10 minute walk to Buona Vista MRT! \n \nRight next to Holland Village, one of the most popular tourist attractions, there are a wide array of cafes, pubs, restaurants and specialty shops including amenities like supermarkets, pharmacies and banks, providing unparalleled convenience. \n \nThe bedrooms have fresh linens, a study desk, clothes drawer/hanger and bed. There is a common area and plenty of green around the unit for fresh air as well as a fully equipped kitchen. \n \nFor those who are travelling from far, you can be assured our homes are a safe place to be in. We wish to provide a vibrant atmosphere within the house so that everyone has an enjoyable time with us. \n \nWe hope to see you soon! \n \nTHE NEIGHBORHOOD: \n \n- 24/7 supermarkets \n \n- Nearby shopping centre \n \n- Near banks \n \n- Bustling night life \n \n- Famous for pubs and eateries \n \n- Minutes to Orchard, Somerset, Dhoby Ghuat, Botanic Gardens, Dover, Buona Vista and One North MRT \n \n- Minutes to NUS, NUH, Biopolis, Fusionopolis and INSEAD \n \nThere's a bus stop right outside the house which brings you to most places listed above and various MRT stations. It is a 5 minute walk to Holland Village MRT if you're not too lazy!     ",
        "title": "Excellent Location For Touring Singapore"
    },
    {
        "postid": "5931554419",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5931544528",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5926526805",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe studio apartment is on the 4th floor and is served by an elevator. Although the apartment is compact it's perfect for a small family as a cost saver when compared with a comparable standard hotel room it can accommodate up to 2 people. Businesspeople might want to consider this as a self catering (healthier) alternative to a hotel/restaurant combination. Please note that the kitchen is fully equipped and is suitable for cooking simple meals. Room highlights are: Bathroom Hair Dryer, toilet, bathtub, Complimentary Soap/Shampoo/Conditioner, mirror Amenities Iron &amp; Ironing Board, Hair Dryer, Bed Linen &amp; Towels, Cable TV, CD player, vacuum cleaner, air conditioning, heating, city maps Bedroom/LivingRoom double bed, built-in wardrobes, 2 x night table, desk, TV, chest of drawers, 2 x armchairs, coffee table, lamp, shelves, 2 x Reading lamp Kitchen Cookware &amp; Kitchen Utensils, cooker, electric kettle, microwave, toaster, plates, pans, fridge / freezer, coffee maker, table and chairs, Complimentary Tea &amp; Coffee, cupboards Composition Bathroom, Bedroom/Living room with kitchen     ",
        "title": "New Flat In The Heart Of City"
    },
    {
        "postid": "5937044292",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA romantic ensuite for those who embrace the finer things in life. Relish in this intimate bedroom setting for you and your partner and be amazed by the endless possibilities that the bedroom has to offer. \n \nLocated right alongside Tanjong Pagar MRT within the Central Business District in Tanjong Pagar offers a wide variety of dining options. Be it unique street hawker dishes at Maxwell to fine dining at the heart of Orchard a few train stops away, you're spoilt for choices. \n \nCommuting to and from work is just as convenient, with key towers in the CBD area within walking distance, and Tanjong Pagar MRT just 2 minutes from the apartment block.     ",
        "title": "Luxury Apartment In The Heart Of Singapore"
    },
    {
        "postid": "5937039910",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is our largest 1 bedroom apartment suitable for the Single , Couple and small family . It is equipped with a 50 inches television and full size kitchen and equipped with appliances . This unit is definitely a great place to live in. \n \nOVERVIEW \n \nGet to the shopping belt of Singapore within minutes. Bugis Junction and Iluma are just a short walking distance away! Hop by to Bugis street to snap up all the cheap deals and try out the street food! You can find a supermarket, fast food, Starbucks and a whole range of restaurants in Bugis Junction! \n ",
        "title": "Apartment For Couples And Family With All Amenities, Free Internet"
    },
    {
        "postid": "5911778839",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nExperience the unsurpassed beauty of The unit, while having a light lunch in the beautiful dining room, or in the sophisticated living room, that are both located on the ground floor. A fully equipped, state of the art kitchen, and a restroom are also located on the ground floor. \n \nThe whole house has inclusive wireless internet, satellite TV and daily cleaning service. A mouth-watering breakfast with fresh local products is also available upon request at an extra charge.     ",
        "title": "Stay with the best or stay with the rest!!!"
    },
    {
        "postid": "5926522132",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe apartment is centrally located in Orchard Road, 5 min walk from both the Orchard and Somerset train stations. The apartment is also of close walking proximity to Paragon Medical and Mount Elizabeth Hospital. \n \nExperience the unique blend of the Asian tradition set in a typical Western setting. The moment you step into the apartment you are immediately transformed to another world of experience. \n \nLet your senses embrace the harmony of the east and the west that is a great variation in itself. Get mesmerized seeing the extravagant and the dazzling lights, the beautiful interiors. The moment you step into the apartment you are transformed into a completely new world that is much like your cozy home. Located in the heart of the Orchard Road that lies in a close proximity to the premier shopping and entertainment districts of Singapore, the apartment is one of the top rated property that is only 30 minutes away from the Changi airport.     ",
        "title": "CUTE &amp; COZY 2 BED APARTMENT- CLOSE TO MOUNT ELIZABETH"
    },
    {
        "postid": "5911780489",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe property has been furnished to a high standard and consists of 2 bedrooms which all have their own bathroom, build-in wardrobes, large kitchen/dining room. \n \nApartment is suitable for 5 people. \n \n1 Double bed, 2 Queen beds and corner sofa in living room. \n \n*Large modern fully equipped kitchen with dishwasher, microwave, washing machine &amp; dryer. \n \n*TV, WiFi free unlimited internet access. \n \n*Bed linen, towels, cutlery &amp; crockery all provided. \n \n*Balcony. \n \nWe help with check in and check out 24/7.     ",
        "title": "Cozy 2 bed apt @ Beach Rd"
    },
    {
        "postid": "5937036072",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a modern 2 bedrooms apartment. Each of the 2 rooms has a queen size bed with clean &amp; fresh bedlinen. Single bed can be provided upon request. \n \nThe kitchen is modern &amp; fully equipped with cooking facilities. The living area is set up with a sofa and flat screen TV. The whole apt has air conditioning. Bathroom is a standing shower with hot and cold water. \n \nInternet Wifi is free! \n \nLocated right on Orchard Rd! You could feel the buzz and spirit of prime district in Singapore where a great shopping experience awaits you right at your doorstep. This location is the like of Oxford St. of London, 5th avenue of New York and Ginza of Tokyo, be our guests. Welcome! \n \nWelcome to my lovely country hope you will choose stay in our apt when you visit Singapore.     ",
        "title": "Come And Experience The Lifestyle Singapore Has To Offer!"
    },
    {
        "postid": "5940694693",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a very big 1 bedroom condominium as you can see from the photo. Nested in a very premium condo, the pool is definitely the selling point of the apartment. Great for sun tanning and lazing around. Fits 2 comfortably and if you have 1 child, we can provide extra mattress. \n \nThis is 1 bedroom apartment. The facilities and amenities in this apartment is brand new. \n \nThe is 1 bedroom room apartment. One queen size bed only. Will provide single mattress for extra person. For the ladies, there is also a large walk-in closet. \n \nIt is fully furnished and comes with basic cooking appliances to you to cook up a simple meal. \n \nLocated just 6min walk from Paya Lebar MRT, you are well connected as it is just 5 stops away to to downtown Singapore. \n \nDespite the Geylang address, known for its red light district (and yummy food), the vice is actually a good 25min walk away - VERY VERY far. The area that you are in is a decant residential neighborhood where family live. Not hookers. \n \nWIFI is provided in the apartment. \n \nI am renting out the entire 1 bedroom apartment so you need not to share with anyone. All the furnishing and equipment are in good working order. \n \nSomeone will meet you during check-in to do the handover. During your stay, should there be any issue with the apartment, we will try our very best to resolve it. \n \nI would be happy to recommend places to eat, shop, drink and play.Local food is the major plus for resident in Geylang. You will be never short of good and cheap local food. There is way too many to recommend and I suggest that you food blog the places to eat. \n \nResidents can get to nearby supermarkets or shopping mall within the area for an array of amenities such as grocery and retail shopping, banks, eateries and more. \n \nThis apartment is near to Geylang East. It is also close to City Plaza and Tanjong Katong Complex. \n \nPaya Lebar is a major train interchange where you can take either the green line (East-West) or the Circle Line (Marina Bay or Harbourfront). It is seriously very convenient. \n \nFrom the airport, it is 15min by cab \n \nIf you take a taxi to town area, it is also 15-20min. \n \nWe do provide: \n \n- a fresh set of bed sheet, pillow cover and blanket. \n \n- bath towels (1 per pax) \n \nWe do not provide: \n \n- Bathroom amenities (soap/shampoo) \n \n- Clothing washing detergent.     ",
        "title": "This is a very big 1 bedroom condominium"
    },
    {
        "postid": "5926524241",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIf you want to find a convenient way for accommodation in Singapore at prices much more affordable than a hotel we are the perfect choice that you can make. We are a company with over 10 years experience in real Estate and accommodation in Singapore and the quality of our service is impeccable, as evidenced by customers calling us for years!     ",
        "title": "Perfect for a holiday in Singapore - Two Bedroom Apartment, Sleeps 5"
    },
    {
        "postid": "5943285570",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLarge common room (1 - 2 person) \nNo Agent fee \nChinese owner \n \nFurnished: \nQueen size bed \n4 doors wardrobe \nDressing table \nWall Fan \n \nSharing: \nWater Heater / Light Cooking \nMicrowave / Washing Machine \nFridge / Wifi \n \nNear by: \nDowntown east \n24hrs supermarket \n4 coffeeshops \nAirport - few stops away \nMrt about 10 mins \n \nHp 91708826     ",
        "title": "Room for rent"
    },
    {
        "postid": "5910496882",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRoom highlights are: \nBedroom \nBed Linen &amp; Towels, double bed, built-in wardrobes, 2 x night tables, 2 x reading lamps \n \nBathroom \nHair Dryer, cupboard, toilet, bathtub, Towels, mirror \n \nComposition \nBathroom/WC, Bathroom, Kitchen, Living room, Bedroom \n \nAmenities \nCookware &amp; Kitchen Utensils, Iron &amp; Ironing Board, Hair Dryer, Bed Linen &amp; Towels, Central Heating, Washing Machine, TV, internet connection, air conditioning \n \nKitchen \nCookware &amp; Kitchen Utensils, Crockery &amp; Cutlery, Iron &amp; Ironing Board, Washing Machine, kettle, cooking hob, oven, electric kettle, microwave, toaster, fridge / freezer, coffee maker \n \nBedroom/LivingRoom \nTV, double sofa bed, bookshelf, Table, 2 x Chair     ",
        "title": "1 BEDROOM, INTEGRATED KITCHEN/DINING/LIVING ROOM, BATHROOM"
    },
    {
        "postid": "5911778344",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a very big 1 bedroom condominium as you can see from the photo. Nested in a very premium condo, the pool is definitely the selling point of the apartment. Great for sun tanning and lazing around. Fits 2 comfortably and if you have 1 child, we can provide extra mattress. \n \nThis is 1 bedroom apartment. The facilities and amenities in this apartment is brand new. \n \nThe is 1 bedroom room apartment. One queen size bed only. Will provide single mattress for extra person. For the ladies, there is also a large walk-in closet. \n \nIt is fully furnished and comes with basic cooking appliances to you to cook up a simple meal. \n \nLocated just 6min walk from Paya Lebar MRT, you are well connected as it is just 5 stops away to to downtown Singapore. \n \nDespite the Geylang address, known for its red light district (and yummy food), the vice is actually a good 25min walk away - VERY VERY far. The area that you are in is a decant residential neighborhood where family live. Not hookers. \n \nWIFI is provided in the apartment. \n \nI am renting out the entire 1 bedroom apartment so you need not to share with anyone. All the furnishing and equipment are in good working order. \n \nSomeone will meet you during check-in to do the handover. During your stay, should there be any issue with the apartment, we will try our very best to resolve it. \n \nI would be happy to recommend places to eat, shop, drink and play.Local food is the major plus for resident in Geylang. You will be never short of good and cheap local food. There is way too many to recommend and I suggest that you food blog the places to eat. \n \nResidents can get to nearby supermarkets or shopping mall within the area for an array of amenities such as grocery and retail shopping, banks, eateries and more. \n \nThis apartment is near to Geylang East. It is also close to City Plaza and Tanjong Katong Complex. \n \nPaya Lebar is a major train interchange where you can take either the green line (East-West) or the Circle Line (Marina Bay or Harbourfront). It is seriously very convenient. \n \nFrom the airport, it is 15min by cab \n \nIf you take a taxi to town area, it is also 15-20min. \n \nWe do provide: \n \n- a fresh set of bed sheet, pillow cover and blanket. \n \n- bath towels (1 per pax) \n \nWe do not provide: \n \n- Bathroom amenities (soap/shampoo) \n \n- Clothing washing detergent.     ",
        "title": "This is a very big 1 bedroom condominium"
    },
    {
        "postid": "5926526778",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe studio apartment is on the 4th floor and is served by an elevator. Although the apartment is compact it's perfect for a small family as a cost saver when compared with a comparable standard hotel room it can accommodate up to 2 people. Businesspeople might want to consider this as a self catering (healthier) alternative to a hotel/restaurant combination. Please note that the kitchen is fully equipped and is suitable for cooking simple meals. Room highlights are: Bathroom Hair Dryer, toilet, bathtub, Complimentary Soap/Shampoo/Conditioner, mirror Amenities Iron &amp; Ironing Board, Hair Dryer, Bed Linen &amp; Towels, Cable TV, CD player, vacuum cleaner, air conditioning, heating, city maps Bedroom/LivingRoom double bed, built-in wardrobes, 2 x night table, desk, TV, chest of drawers, 2 x armchairs, coffee table, lamp, shelves, 2 x Reading lamp Kitchen Cookware &amp; Kitchen Utensils, cooker, electric kettle, microwave, toaster, plates, pans, fridge / freezer, coffee maker, table and chairs, Complimentary Tea &amp; Coffee, cupboards Composition Bathroom, Bedroom/Living room with kitchen     ",
        "title": "New Flat In The Heart Of City"
    },
    {
        "postid": "5910716643",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n25% OFF at Regent &#8234;&#8206;Singapore&#8236; Rates from USD 213.46 \n \nBook now so you don't miss out on today's rate. Please go to the link below for booking and more details \n \nhttp://www.agoda.com/regent-singapore-a-four-seasons-hotel/hotel/singapore-sg.html?cid=1640564 \n \n(Rates depend on the period of your stay) \n \n------------------------------------------------------------------------------------------------------------------------ \n \n&#3626;&#3656;&#3623;&#3609;&#3621;&#3604; \n  show contact info \n&#3656; Regent &#8234;&#8206;Singapore&#8236; &#8234;&#3626;&#3636;&#3591;&#3588;&#3650;&#3611;&#3619;&#3660;&#8236; &#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609; 6,982 &#3610;&#3634;&#3607; \n \n&#3629;&#3618;&#3656;&#3634;&#3619;&#3629;&#3594;&#3657;&#3634;! &#3592;&#3629;&#3591;&#3648;&#3621;&#3618;&#3585;&#3656;&#3629;&#3609;&#3619;&#3634;&#3588;&#3634;&#3592;&#3632;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609; \n&#3592;&#3629;&#3591;&#3591;&#3656;&#3634;&#3618;&#3654; &#3652;&#3617;&#3656;&#3648;&#3626;&#3637;&#3618;&#3648;&#3623;&#3621;&#3634; \n&#3585;&#3619;&#3640;&#3603;&#3634;&#3652;&#3611;&#3607;&#3637;&#3656;&#3648;&#3623;&#3655;&#3611;&#3652;&#3595;&#3607;&#3660;&#3604;&#3657;&#3634;&#3609;&#3621;&#3656;&#3634;&#3591;&#3648;&#3614;&#3639;&#3656;&#3629;&#3592;&#3629;&#3591;&#3627;&#3657;&#3629;&#3591;&#3614;&#3633;&#3585;&#3649;&#3621;&#3632;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3648;&#3614;&#3636;&#3656;&#3617;&#3648;&#3605;&#3636;&#3617; \n \nhttp://www.agoda.com/regent-singapore-a-four-seasons-hotel/hotel/singapore-sg.html?cid=1640564 \n \n(&#3619;&#3634;&#3588;&#3634;&#3586;&#3638;&#3657;&#3609;&#3629;&#3618;&#3641;&#3656;&#3585;&#3633;&#3610;&#3623;&#3633;&#3609;&#3607;&#3637;&#3656;&#3648;&#3586;&#3657;&#3634;&#3614;&#3633;&#3585;) \n \n------------------------------------------------------------------------------------------------------------------------ \n \nhttps://www.facebook.com/wooddytangtravel \n ",
        "title": "25% OFF at Regent &#8234;&#8206;Singapore&#8236;"
    },
    {
        "postid": "5910716643",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n25% OFF at Regent &#8234;&#8206;Singapore&#8236; Rates from USD 213.46 \n \nBook now so you don't miss out on today's rate. Please go to the link below for booking and more details \n \nhttp://www.agoda.com/regent-singapore-a-four-seasons-hotel/hotel/singapore-sg.html?cid=1640564 \n \n(Rates depend on the period of your stay) \n \n------------------------------------------------------------------------------------------------------------------------ \n \n&#3626;&#3656;&#3623;&#3609;&#3621;&#3604; \n  show contact info \n&#3656; Regent &#8234;&#8206;Singapore&#8236; &#8234;&#3626;&#3636;&#3591;&#3588;&#3650;&#3611;&#3619;&#3660;&#8236; &#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609; 6,982 &#3610;&#3634;&#3607; \n \n&#3629;&#3618;&#3656;&#3634;&#3619;&#3629;&#3594;&#3657;&#3634;! &#3592;&#3629;&#3591;&#3648;&#3621;&#3618;&#3585;&#3656;&#3629;&#3609;&#3619;&#3634;&#3588;&#3634;&#3592;&#3632;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609; \n&#3592;&#3629;&#3591;&#3591;&#3656;&#3634;&#3618;&#3654; &#3652;&#3617;&#3656;&#3648;&#3626;&#3637;&#3618;&#3648;&#3623;&#3621;&#3634; \n&#3585;&#3619;&#3640;&#3603;&#3634;&#3652;&#3611;&#3607;&#3637;&#3656;&#3648;&#3623;&#3655;&#3611;&#3652;&#3595;&#3607;&#3660;&#3604;&#3657;&#3634;&#3609;&#3621;&#3656;&#3634;&#3591;&#3648;&#3614;&#3639;&#3656;&#3629;&#3592;&#3629;&#3591;&#3627;&#3657;&#3629;&#3591;&#3614;&#3633;&#3585;&#3649;&#3621;&#3632;&#3586;&#3657;&#3629;&#3617;&#3641;&#3621;&#3648;&#3614;&#3636;&#3656;&#3617;&#3648;&#3605;&#3636;&#3617; \n \nhttp://www.agoda.com/regent-singapore-a-four-seasons-hotel/hotel/singapore-sg.html?cid=1640564 \n \n(&#3619;&#3634;&#3588;&#3634;&#3586;&#3638;&#3657;&#3609;&#3629;&#3618;&#3641;&#3656;&#3585;&#3633;&#3610;&#3623;&#3633;&#3609;&#3607;&#3637;&#3656;&#3648;&#3586;&#3657;&#3634;&#3614;&#3633;&#3585;) \n \n------------------------------------------------------------------------------------------------------------------------ \n \nhttps://www.facebook.com/wooddytangtravel \n ",
        "title": "25% OFF at Regent &#8234;&#8206;Singapore&#8236;"
    },
    {
        "postid": "5947846272",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSofitel Singapore Sentosa Resort &amp; Spa  \n \nFrom SGD 414 Per Night \n \nMore details and booking below \n \nhttps://wttravellerdeals.wordpress.com/2017/01/06/ac-en-sofitel-singapore-sentosa-resort-spa/ \n \n- Rates and offers are subject to change without prior notice \n \n- Rates and offers depend on the period of your stay \n \n ",
        "title": "Sofitel Singapore Sentosa Resort &amp; Spa"
    },
    {
        "postid": "5911971791",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHotel Jen Orchardgateway &#8234;Singapore&#8236; From USD 159 \n \nBOOK NOW, Please go to the link below \n \nhttp://www.agoda.com/hotel-jen-orchardgateway-singapore/hotel/singapore-sg.html?cid=1640564 \n \n(Room rates depend on the period of your stay) \n \n------------------------------------------------------------------------------------------------------------------------ \n \nHotel Jen Orchardgateway &#8234;#&#8206;Singapore&#8236; &#8234;#&#8206;&#3626;&#3636;&#3591;&#3588;&#3650;&#3611;&#3619;&#3660;&#8236; &#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609; 5,365 &#3610;&#3634;&#3607; \n \n&#3592;&#3629;&#3591;&#3648;&#3621;&#3618; ! &#3585;&#3619;&#3640;&#3603;&#3634;&#3652;&#3611;&#3607;&#3637;&#3656;&#3621;&#3636;&#3591;&#3588;&#3660; &#3604;&#3657;&#3634;&#3609;&#3621;&#3656;&#3634;&#3591;  \n \nhttp://www.agoda.com/hotel-jen-orchardgateway-singapore/hotel/singapore-sg.html?cid=1640564 \n \n(&#3619;&#3634;&#3588;&#3634;&#3586;&#3638;&#3657;&#3609;&#3629;&#3618;&#3641;&#3656;&#3585;&#3633;&#3610;&#3594;&#3656;&#3623;&#3591;&#3648;&#3623;&#3621;&#3634;&#3607;&#3637;&#3656;&#3648;&#3586;&#3657;&#3634;&#3614;&#3633;&#3585;) \n \n------------------------------------------------------------------------------------------------------------------------ \n \nhttps://www.facebook.com/wooddytangtravel \n ",
        "title": "Hotel Jen Orchardgateway &#8234;Singapore&#8236; From USD 159"
    },
    {
        "postid": "5926524185",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nUltra Luxury and modern 80m2 (861s.f) 1 Bedroom 1 bathroom Apartment Located in the centre of Singapore. This apartment is perfect for the vacationer or Buisness traveler alike who wants to be near all the best tourist sites and be in a neighborhood at the same time. \n \nLook and see how everything is right outside your door! \n \nThis apartment has everything you need. \n \n42' Flatscreen Television in bedroom and living room \n \nSatellite T.V with 500 International Channels \n \nHighest Speed Internet money can buy \n \nHigh quality towels and sheets \n \nProper lighting everywhere \n \nNespresso Maker \n \nNew high quality utensils and kitchenware and \n \nsupplied with more than enough     ",
        "title": "Ultra Luxury one bedroom apartment in the centre of Singapore!"
    },
    {
        "postid": "5912578183",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGorgeous apartment for bigger or smaller groups in the very downtown of Singapore \n \nGreat design, 250 metres,with a jacuzzi, 4 bedrooms, 3 bathrooms, fully equipped modern kitchen, a triplex in downtown of Singapore. One of the most exclusive apartments in perfect area. \n \nApartment is located in the heart of Singapore city centre. \nThis apartment has a perfect location with all the chiq restaurants and cafeteries with an easy access to everywhere. \nCome and enjoy in this apartment the best holidays ever!     ",
        "title": "With jacuzzi, 4 bedrooms, 3 bathrooms, fully equipped modern kitchen"
    },
    {
        "postid": "5955781524",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFIXTURES \n-Minimalist concept furnishing and fittings. \n-Individually controlled air-con. \n-Flat screen Television with local channels \n-Fully equipped (dining ware, cookware, bread toaster, kettle, rice cooker) open kitchen concept \n-essentials e.g. hairdryer, iron, towels \n-first aid box, smoke alarm, fire extinguisher (underway) \n-free hi-Speed Internet wifi \n \nSERVICES \n-Housekeeping &amp; Cleaning Services. \n \nFACILITIES \n-Swimming pool. \n-24 hour security surveillance. \n \n \nPublic transportation is easily accessible, we are 5 minutes walk to Somerset MRT station, right at the door step of the mall is a taxi stand and the cab driver will readily fetch you to any desire destination. \n \nThank you for taking time to read our simple introduction and welcome to my lovely country, hope to see you when you visit Singapore. \nHouse Rules: Enjoy yourself while you staying in our apt,please help to keep your voice down after 9pm, thanks.     ",
        "title": "Orchard 1 Bedroom Apt IV Ea"
    },
    {
        "postid": "5947778507",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGrand Mercure Singapore Roxy \n \nFrom SGD 145 Per Night \n \nMore details and booking below &#9759; \n \nhttps://wttravellerdeals.wordpress.com/2017/01/06/ac-en-grand-mercure-singapore-roxy-from-sgd-145-per-night/ \n \n- Rates and offers are subject to change without prior notice \n- Rates and offers depend on the period of your stay     ",
        "title": "Grand Mercure Singapore Roxy"
    },
    {
        "postid": "5947778507",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGrand Mercure Singapore Roxy \n \nFrom SGD 145 Per Night \n \nMore details and booking below &#9759; \n \nhttps://wttravellerdeals.wordpress.com/2017/01/06/ac-en-grand-mercure-singapore-roxy-from-sgd-145-per-night/ \n \n- Rates and offers are subject to change without prior notice \n- Rates and offers depend on the period of your stay     ",
        "title": "Grand Mercure Singapore Roxy"
    },
    {
        "postid": "5954373990",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEntire cozy 4 bedroom flat about 1600 spf, at most popular expat spot &amp; central scenic area, short walk to Clark quay, Roberson quay, Chinatown,Financial center, Orchard road. Nice bars &amp; restaurants &amp; SG river at door step. Great for sight seeing. Walking distance to most famous spots in town. Save ur time and sweat for transportation. Fast WIFI. \n \nEntire spacious 4 bedroom with 3 bathrooms, about 160 square meters, cozy apartment at Robertson Quay, the most popular dinning area in CBD center, beside river. plenty of bars &amp; restaurants down starts and many boutique shop houses which are great attraction for tourist. Gym, huge swimming pool and tennis court available for your use. \n \nVery spacious living room and kitchen, Each room is well furnished with writing table, sofa and big wardrobe for your personal belongings. We provide comfortable bedding and peaceful surrounding to ensure that you feel like home. \n \nMost central in CBD, surrounded by many high end condos, shopping malls, office buildings and beautiful boutique shop houses. Walking distance to Clark Quay, Boat Quay, Chinatown, Orchard. If u don't mind walking, it's a very enjoyable walk along river to Raffles Place and Marina Bay Sands as well. The best place to experience the trendy metropolitan life in Singapore. \n \nGuest Access \n \nIncluded With Your Stay: \n- Big TV in living room. \n- All bedding, linen and fresh towels \n- Shampoo &amp; shower gel or soap, shower gel. \n- Unlimited high speed Wifi Internet \n- Free washer and drier usage (free laundry detergent provided) \n- In-room air-conditioning \n- Kitchen usage &amp; cooking welcome \n- Hair drier, iron, and ironing board available \n- Self-serve tea and coffee in kitchen \n- Global Universal sockets &amp; adapters \n ",
        "title": "Entire 4 Bedroom @ Robertson Quay"
    },
    {
        "postid": "5954374122",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis villa consist of three floors and has 6 bedrooms! It has a beautiful garden and yard! \n \nSuitable for large group! \n \nI am renting this villa as a whole unit, no room rental. \nAll rooms has aircon. \n \nCooking is allowed in the house. However, strictly NO EVENT is allowed. \n \nCentral, and Near to malls and train station. \n \nNovena train station is just 7 minutes away! \n \nPlease contact me once you landed in Singapore. If there is any delay of flight, please notify me in advance. \nHouse Rules: Please remove your shoes when entering the apartment, so that you can enjoy a clean home during your whole stay! ;) \n \nSmoking is not allowed in the apartment, but you can always do that at the balcony! ;) \n \nPlease switch off all the lights and aircon when you are not in the room, so they can function properly when you need them! \n \nIf you're below 21 years old, please make sure a guardian (above 21 years old) is staying with you! \n \nPlease keep your volume down so as to maintain good relationship with the neighbors. \n \nPlease note that once the check in time is confirmed, please be punctual. If there is any changes, contact me immediately. \n \nIf you encounter suspicious people please let us know. \n \nPlease do not misuse the apartment for any illegal activities. Any suspicious activity verified, we will report to the police immediately.     ",
        "title": "Superb 3 Floor Villa for Large Group"
    },
    {
        "postid": "5940702678",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWhat make us stand up from other accommodation providers is our location,we are the only host that is located in a Orchard Road address,we are located on top of Centrepoint Shopping Centre right along Orchard Road. \n \nCentrepoint Shopping Centre has been around since the 1970s and is an iconic heritage shopping mall.Some guests from the UK has compared the Orchard Road to London's Oxford street, while guests of ours from the US call the location to name of Fifth Avenue, as the Japanese felt a strong resemble of Orchard road to their district of GInza area. \n \nCentrepoint Shopping Centre houses many major established retailers, Robinsons, Marks and Spencer's and Harvey Norman etc. For food lovers,there are many quality restaurants in the mall like Chinese, Japanese, Thai, Western and even Indonesian restaurants open in regular hours for business. Fast food chains in the mall includes,Mc Donald's, Subways and Long John Silver etc. \n \nCold storage is a popular supermarket that you can buy all daily groceries. 7/11 is opens 24 hrs for you to purchase any late night needs. \n \nPublic transportation is easily accessible, we are 5 minutes walk to sommerset MRT station,right at the door step of the mall is a taxi stand and the cab driver will readily to fetch you to any desire destination. \n \nThis is 3 bedrooms apartment with a living room well furnished with a television, sofa and is attached to the kitchenette. \n \nLIVING ROOM \n \n* Plush furnishing and fittings. \n \n* Individually controlled ari-con. \n \n* Flat screen Television with local channels \n \nSERVICES \n \n* Housekeeping Cleaning Services. \n \nFACILITIES \n \n* Swimming pool. \n \n* 24 hour security surveillance. \n \n* Internet Capablities. \n \nThanks for taking time to read our introduction and hope to see you in Singapore soon. \n \nHouse Rules: This is your home and enjoy yourself to the fullest with this superb location.     ",
        "title": "Orchard Road 3 Bedrooms with free airport pick up + drop off"
    },
    {
        "postid": "5938591794",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5937266132",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n47% DISCOUNT from Park Hotel Alexandra, Singapore \n \nMore details and booking below  \n \nhttps://wttravellerdeals.wordpress.com/2016/12/29/b-en-47-percent-discount-from-park-hotel-alexandra-singapore/ \n \nAny enquiry, please send to #wttraveller Facebook \n \nFacebook.com/wttraveller \n ",
        "title": "47% DISCOUNT from Park Hotel Alexandra"
    },
    {
        "postid": "5917229455",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBeautifully remodelled from top to bottom, this home features a comfortable living room and open plan kitchen and dining area on the apartment. You'll find the lovely master bedroom with en suite bathroom. Also on the same level are the pretty second and third bedrooms and the second bathroom. The apartment welcomes up to six people in a stylish home setting in Singapore . You'll even find a study space with desk in the apartment - perfect for a quiet cup of tea or keeping in touch with family and friends.     ",
        "title": "Beautiful three bedroom, two bathroom Singapore holiday rental"
    },
    {
        "postid": "5937049985",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is 2 Bedrooms apartment is ideally situated and suited for on budget corporate housing needs, short term assignments or extended stays in Singapore. \n \nFully equipped with everything you need to settle in as soon as you step in, this is the right solution for Family or company professionals or a couple. \n \nAvailable for short or long term rent if you need to stay in Singapore for a few months or years. \n \nApartment is on the high floor unblock view and near to City Plaza. It is also close to Signpost shopping mall, Tanjong Katong Complex, Market and hawker centre. \n \nModern and new 2 bedrooms apartment. This fully furnished 2 bedrooms is perfect for a family looking for a place to stay in the East side of Singapore. \n \nBedroom A has a queen sized bed and bedroom B also has a queen bed. Living room is sofa, coffee table and TV All the furnishing and equipment in this apartment are in good condition. The kitchen comes with proper cooking equipment to cook a basic meal. WiFi is provided in the apartment. \n \nResidents can get to nearby supermarkets or shopping mall within the area for an array of amenities such as grocery shops, retail outlets, shopping malls, banks, eateries and more.     ",
        "title": "Amazing Apartment In Heart Of Singapore"
    },
    {
        "postid": "5940692480",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFully furnished to a very high standard with generously proportioned rooms &amp; halls, this is an opportunity to enjoy living in this apartment that combines comfort &amp; convenience with elegance &amp; extravagant sophistication.This is an fantasy that will cater to everyone seeking the good life. \n \nVisitors will come to enjoy the magnificent sunsets, unwind in the spas, pools and gardens and eat out at the fine selection of restaurants. There's a wide range of daytime activities, including water sports, aquariums, theme parks and of course miles of beautiful beaches. And at night the bars, clubs and shows offer plenty of fun and amusement. So why not come and explore the endless possibilities My Singapore Stay's serviced apartments on the Marina Bay have to offer you.     ",
        "title": "Furnished 4 bedrooms, 4 bathrooms, sleeps 8"
    },
    {
        "postid": "5940692480",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nFully furnished to a very high standard with generously proportioned rooms &amp; halls, this is an opportunity to enjoy living in this apartment that combines comfort &amp; convenience with elegance &amp; extravagant sophistication.This is an fantasy that will cater to everyone seeking the good life. \n \nVisitors will come to enjoy the magnificent sunsets, unwind in the spas, pools and gardens and eat out at the fine selection of restaurants. There's a wide range of daytime activities, including water sports, aquariums, theme parks and of course miles of beautiful beaches. And at night the bars, clubs and shows offer plenty of fun and amusement. So why not come and explore the endless possibilities My Singapore Stay's serviced apartments on the Marina Bay have to offer you.     ",
        "title": "Furnished 4 bedrooms, 4 bathrooms, sleeps 8"
    },
    {
        "postid": "5906215454",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe Icon located just next to Tanjong Pagar Mass Rapid Transit Station is a Perfect Choice for Single or Couple working in the Marina Bay Financial Centre or in Central Business District. \n \nThe Space \n \nOne Bedroom apartment with space and privacy that meets your business and leisure requirement. \n \nGuest Access \n \nThe Icon is a Mix development building which have a mix of offices, residences and retail shops. The building comprise of a roof garden which offer panoramic scenic views of the sea and the city. \n \nInteraction with Guests \n \nCOMPLIMENTARY SERVICES: \n \nHOUSEKEEPING \n \nHousekeeping is from Monday to Saturday. There will be no housekeeping on Sunday and Public Holidays. We put in place a very high standard of housekeeping services. Thus you need to experience to know. \n \nLAUNDRY SERVICE \n \nComplimentary personal laundry wash and iron and limited to 5 pieces per day for 1 bedroom unit. \n \nBROADBAND and WI-FI \n \nWe provide high power internet connection. \n \nCABLE TV \n \nWe provide complimentary 88 channels on Starhub cable TV for your leisure viewing. \n \nPHONE \n \nComplimentary dial out for both local landlines and mobile lines. \n \nSAFE BOX \n \nWe provide a Safe Box in the wardrobe \n \nFACILITIES \n \nAccess to Gym and Swimming Pool at facilities floor is strictly by the Facilities Access Card. Our Service Crew who attend to your check in will present you the Facilities Access Card. \n \nSECURITY \n \n24-Hour Security and Closed-circuit Monitoring \n \nThe Neighbourhood \n \nYou can enjoy the ultimate rejuvenation and recreation experience with your friends and family after work as our residence is situated conveniently within driving distance to both the intergrated resorts, Marina Bay Sands and Resorts World Sentosa Integrated Resorts. \n \nGetting Around \n \nSituated 5 minutes stroll from Tanjong Pagar MRT station, and right behind the main CBD area, this apartment brings you the most convenient location to stay in, and provides you with access to flavourful districts such as the Tanjong Pagar conserved street as well as the Amoy Street and Telok Ayer areas. \n \nThe apartment is within a private condominium building, with a wide array of food and beverage establishments on the first level. Two supermarts, one convenience store and a range of local hawker fare is just 5 minutes walk away. There is also an entire street of Korean restaurants at Tanjong Pagar street, and a mixture of Western and Mexican restaurants and cafe located 10 minutes walk away at Duxton Hill. For those craving for fast food, there is a 24 hour MacDonald's outlet 5 minutes away within the CBD. \n \nOther Things to Note     ",
        "title": "Icon located just next to Tanjong Pagar"
    },
    {
        "postid": "5937039839",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nPark/Sea view at mid level from lounge room. 2 minutes walk to nearest Lavender MRT Station which is the main MRT Line of Singapore. It is located in middle of the city. In addition, you can avoid crazy part of town and retreat to a quitter locale and connect more with local life. Thus just a stone throw from MRT station and a very short taxi ride, you may reach all the places of attraction in Singapore.  \n \nWe welcome children and families, however apartments include standard furnishings and equipment intended for family friendly, this is a perfect choice for both SHORT and LONG term living in Singapore. \n \n*** For LONG term stay will provide weekly cleaning schedule such as changing of linens and towels and essentials etc. are included. \n \nPlease kindly proceed the booking sooner as the reservation is FIRST COME FIRST SERVE BASIS.     ",
        "title": "Beautiful Apartment With All The Amenities Of Home"
    },
    {
        "postid": "5954814421",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEntire cozy 4 bedroom flat about 1600 spf, at most popular expat spot &amp; central scenic area, short walk to Clark quay, Roberson quay, Chinatown,Financial center, Orchard road. Nice bars &amp; restaurants &amp; SG river at door step. Great for sight seeing. Walking distance to most famous spots in town. Save ur time and sweat for transportation. Fast WIFI. \n \nEntire spacious 4 bedroom with 3 bathrooms, about 160 square meters, cozy apartment at Robertson Quay, the most popular dinning area in CBD center, beside river. plenty of bars &amp; restaurants down starts and many boutique shop houses which are great attraction for tourist. Gym, huge swimming pool and tennis court available for your use. \n \nVery spacious living room and kitchen, Each room is well furnished with writing table, sofa and big wardrobe for your personal belongings. We provide comfortable bedding and peaceful surrounding to ensure that you feel like home. \n \nMost central in CBD, surrounded by many high end condos, shopping malls, office buildings and beautiful boutique shop houses. Walking distance to Clark Quay, Boat Quay, Chinatown, Orchard. If u don't mind walking, it's a very enjoyable walk along river to Raffles Place and Marina Bay Sands as well. The best place to experience the trendy metropolitan life in Singapore. \n \nGuest Access \n \nIncluded With Your Stay: \n- Big TV in living room. \n- All bedding, linen and fresh towels \n- Shampoo &amp; shower gel or soap, shower gel. \n- Unlimited high speed Wifi Internet \n- Free washer and drier usage (free laundry detergent provided) \n- In-room air-conditioning \n- Kitchen usage &amp; cooking welcome \n- Hair drier, iron, and ironing board available \n- Self-serve tea and coffee in kitchen \n- Global Universal sockets &amp; adapters \n \nWithin Condo Facilities: \n- 24 hours security \n- swimming pool &amp; Gym \n \nFor your reference: This is popular tourist area, more than 10 hotels nearby, hotel price is about SGD$300/night for 2 person only. \n \nInteraction with Guests \n \nI'm traveling most of the times. Whenever i'm free, I will be more than happy to share with u my insights of Singapore and give u my personal tips. Also I will provide tourist maps and my own introduction booklet in the living room for reference. \n \nThe Neighbourhood \n \nRoberson Quay is the most exclusive area for entertainment, hundreds of trendy bars and restaurants around this place, many historic old shop houses and high end residential, shopping malls and office around, you can find all your need within a few minutes walk. And the beautiful Singapore river is at door step, very enjoyable for a walk. \n ",
        "title": "Entire 4 Bedroom @ Robertson Quay"
    },
    {
        "postid": "5954512979",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMandarin Oriental, Singapore  \n \nMarina Bay View Room Twin / King with Breakfast : SGD 409 Per Night \n \nPlease go to the link below for more details and booking \n \nhttp://wttraveller.weebly.com/deals/a-en-mandarin-oriental-singapore-marina-bay-view-room-twin-king-with-breakfast-sgd-409 \n \n#WTTRAVELLER #travel #hotels #flights #deals #affiliate \n \nAny enquiry, please contact &gt; https://www.facebook.com/wttraveller/     ",
        "title": "Mandarin Oriental, Singapore"
    },
    {
        "postid": "5926526982",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a modern two bedroom apartment, there is a queen size bed and two single bed in this apt.The kitchen is new and modern with cooking utensils, the living area is set up with a sofa,and a TV. The whole apt has air conditioning. Bathroom is a standing shower with hot and cold water. Most importantly, we provide great hospitality. \n \nThe Aparment is located on a tranquil, tree-lined Orchad Boulevard, it is 25 minutes drive away from Changi International Airport and only steps away from Orchard Road, which is a great choice for travellers interested in luxury brand shopping, shopping for clothes and shopping. \n \nThe unit is a scenic 10-minute drive from the Botanic Gardens and a 15-minute drive from the Marina Bay Business District. Sentosa Island and Universal Studios Singapore is also a 15-minute drive away. \n \nThis fully furnished apartments come with a kitchenette. An outdoor pool and a gym are available. Featuring modern designs, it includes a TV, a washing machine, clothes dryer and free parking space.     ",
        "title": "New River Valley 2 bedrm Apt@$150"
    },
    {
        "postid": "5906212857",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe Parc Condo is a brand new high rise development with full facilities: gym, long swimming pools, playgrounds, tennis courts, BBQ pits, fitness track. \n \nThe apartment has a large living / dining area with a nice balcony with unblock view and a garden set. \n \nThe decoration is modern and comfortable: \n \nL Shape Sofa, LCD TV, DVD player and WIFI internet. \n \nA dining set for 6 persons. \n \nA fully equipped kitchen with all necessary utensils and kitchen ware. \n \nA master bedroom with queen size bed, attached bathroom with bathtub, shower cubicle, toilet, all marble tiled. \n \nTwo standard bedrooms: one with a queen size bed the other with a single bed. A common shower room with toilet. \n \nA laundry area with washing machine, dryer, iron, ironing table, drying rack, vacuum cleaner and all cleaning product and equipment. A store room and a maid toilet.     ",
        "title": "3 BR apartment in a full facility condominium"
    },
    {
        "postid": "5930286757",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n*(REASONABLE PRICE FOR VAN SERVICE) \n \n&#9733;&#9733;(QUOTATION THRU SMS ONLY)&#9733;&#9733; \n \nFor enquiries pls SMS your: (1) Detail of items. (2) Both address with post code. \n(3) Are both add,at lift level? (4) Date &amp; time. \n \nSERVICE: (1) Transport without labour. (2) Transport with driver assist. (3) Transport with driver and labour assist. \n \nHAVING DIFFICULTY IN GETTING CHEAPEST CHARGE? I CAN PROVIDE YOU A COVERED TOYOTA HIACE VAN, FROM $40 ONWARDS.SMS ME (ALIF) AT MY MOBILE (84005231),FOR FURTHER INQUIRY. \n \n&#9733;&#9733;(Your BUDGET is always my PRIORITY)&#9733;&#9733; \n \n[[ SERVICES THAT I PROVIDE ]] \n \n&#9733; MINOR ROOM SHIFTING.   \n \n&#9733; DISPOSAL SERVICE. \n \n&#9733; TRANSPORT ITEM FROM IKEA. \n \n&#9733; TRIP TO CHANGI AIRPORT. \n \n&#9733; EVENT AND EXHIBITIONS: (EG: KARAOKE ENTERTAINMENT, CATERING) \n \nLAST BUT NOT LEAST,ANYTHING THAT NEEDS TO TRANSPORT USING VAN, IM HERE SINCERELY WAITING FOR YOUR CALL. SAVE MY NUMBERS, AS IT WILL BE USEFUL FOR YOUR FUTURE NEEDS.  \n \n&#9733;&#9733;(Your SATISFACTION is my GAIN)&#9733;&#9733;     ",
        "title": "MOVER SVCS,ALIF 84005231.mattress,washer,chair,table,oven,fan."
    },
    {
        "postid": "5926524176",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBe our guest in one of the guaranteed most beautiful apartments of Singapore! \n \nNow, We can offer Free airport transfer! (max 6 persons) \n \nThe apartment is right in the city center, Nothing can endanger your security, the police are 24/7 present! \n \nIn the apartment the air conditioning and the luxurious fitting will contribute to your convenience. Don't leave your best tracks at home - you can enjoy them on the 5.1 sound system from cd, dvd or usb. \n \nEverything is available in a 100 meters radius. The apartment accommodates 6 persons. \n \n \nThe apartment you chose is probably the best possible solution for your comfortable stay in Singapore. \n \nWe offer you the best possible services and conditions: \n- Location in the very heart of Singapore, which means excellent public transportation -- save time and money reaching your target, any program you choose \n- Free airport transfer \n- Local mobile phone for a cheaper local communication (if required) \n- Air condition  \n- Wifi for internet connection \n- Assistance in any unexpected situation \n- And one more extra: One bottle of excellent wine awaits you in the apartment, too.     ",
        "title": "Modern Apt, Great Location"
    },
    {
        "postid": "5937044253",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nYou are looking at one of our most unique apartment. Located right on the fringe of the Central Business District, our new Loft apartment is the newest addition to our range of quality serviced apartment. \n \nSituated 5 minutes stroll from Tanjong Pagar MRT station, and right behind the main CBD area, this apartment brings you the most convenient location to stay in, and provides you with access to flavourful districts such as the Tanjong Pagar conserved street as well as the Amoy Street and Telok Ayer areas. \n \nThe apartment is a loft-style, 1 bedroom and 1 living room interior, with a self sufficient kitchenette that enables you to prepare your own meals. The interior is fitted warmly with quality furnitures, wifi, and cable channels available on the television. \n \nWith full secure access, it will ensure that you can stay in Singapore with a peace of mind. \n \nThe apartment is within a private building, with a wide array of food and beverage establishments on the first level. Two supermarts, one convenience store and a range of local hawker fare is just 5 minutes walk away. There is also an entire street of Korean restaurants at Tanjong Pagar street, and a mixture of Western and Mexican restaurants and cafe located 10 minutes walk away at Duxton Hill. For those craving for fast food, there is a 24 hour MacDonald's outlet 5 minutes away within the CBD.     ",
        "title": "Great Place, Great Location, Clean, Quiet, Bright... Excellent Value"
    },
    {
        "postid": "5955276586",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMinimalist concept furnishing and fittings. \n-Individually controlled air-con. \n-Flat screen Television with local channels \n-Fully equipped (dining ware, cookware, bread toaster, kettle, rice cooker) open kitchen concept \n-essentials e.g. hairdryer, iron, towels \n-first aid box, smoke alarm, fire extinguisher (underway) \n-free hi-Speed Internet wifi \n \nSERVICES \n-Housekeeping &amp; Cleaning Services. \n \nFACILITIES \n-Swimming pool. \n-24 hour security surveillance. \n \n \nPublic transportation is easily accessible, we are 5 minutes walk to Somerset MRT station, right at the door step of the mall is a taxi stand and the cab driver will readily fetch you to any desire destination. \n \nThank you for taking time to read our simple introduction and welcome to my lovely country, hope to see you when you visit Singapore. \nHouse Rules: Enjoy yourself while you staying in our apt,please help to keep your voice down after 9pm, thanks.     ",
        "title": "Orchard 1 Bedroom Apt IV Ea"
    },
    {
        "postid": "5910493605",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe apartment is for both holiday and business guests are assured a pleasant stay. Comfortable apartment that has been newly refurbished, and it's located in the most exciting spot of Singapore, right on Orchard area, some minutes walk from the MRT station     ",
        "title": "Cozy apartment in the best location of Singapore"
    },
    {
        "postid": "5913375628",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#9642; Marina Bay Sands \n \n&#9642; From USD 395 / Night \n \n&#9642; Please go to the link below for more details and reservation \n \nhttps://plus.google.com/collection/Anv4DB \n \n** Remarks \n- Room rates are subject to change without prior notice \n- Rates depend on the period of your stay     ",
        "title": "MARINA BAY SANDS : HOT DEALS !!!"
    },
    {
        "postid": "5926522019",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSpectacular 3 bedrooms and 2 bathrooms apartment for up to 7 people. Wide and bright living room with fireplace, air conditioning, plasma color TV, satellite channels, wi-fi Internet connection. Fully equipped kitchen, 2 bedrooms with double king size beds and 1 bedroom with 2 single beds that can be made up as a double bed, balcony facing an internal courtyard. Additional sofa bed for the 7th person in one of the 2 double bedrooms. The apartment has been completely renovated with high quality materials and furnishings. All the main attractions are within a 10 minutes walk.  \n \nYou'll be delighted by this wide luxurious apartment with 3 bedrooms at the price of a double bedroom of a high quality hotel in Singapore. A great opportunity to bring back home unforgettable memories of your holiday, don't miss it for any reason in the world.     ",
        "title": "Stylish and Comfortable 3 Bedrooms Apartment with Wifi and a/C"
    },
    {
        "postid": "5926522081",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis house is for 2 people, 38 m2, luxurious furnishings.Living/sleeping room with cable TV, DVD, video, radio, hi-fi system, CD player, open fireplace and dinette. Smoking not allowed. Internet (Wireless LAN [WLAN]). 1 double sofa bed.Kitchenette with 2 hot plates, fridge and deep freezer.Shower/WC.Other equipment: safe, hair dryer. \n \nSmall, modern, luxurious house, renovated in 2013.House Equipment: air conditioning.All-season motor access to the house. Situation: in the centre of Singapore.     ",
        "title": "&#9658;Special &#9658; Lovely and Romantic 1BR House with free Airport pickup"
    },
    {
        "postid": "5950356810",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5957216895",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEntire cozy 4 bedroom flat about 1600 spf, at most popular expat spot &amp; central scenic area, short walk to Clark quay, Roberson quay, Chinatown,Financial center, Orchard road. Nice bars &amp; restaurants &amp; SG river at door step. Great for sight seeing. Walking distance to most famous spots in town. Save ur time and sweat for transportation. Fast WIFI. \n \nEntire spacious 4 bedroom with 3 bathrooms, about 160 square meters, cozy apartment at Robertson Quay, the most popular dinning area in CBD center, beside river. plenty of bars &amp; restaurants down starts and many boutique shop houses which are great attraction for tourist. Gym, huge swimming pool and tennis court available for your use. \n \nVery spacious living room and kitchen, Each room is well furnished with writing table, sofa and big wardrobe for your personal belongings. We provide comfortable bedding and peaceful surrounding to ensure that you feel like home. \n \nMost central in CBD, surrounded by many high end condos, shopping malls, office buildings and beautiful boutique shop houses. Walking distance to Clark Quay, Boat Quay, Chinatown, Orchard. If u don't mind walking, it's a very enjoyable walk along river to Raffles Place and Marina Bay Sands as well. The best place to experience the trendy metropolitan life in Singapore. \n \nGuest Access \n \nIncluded With Your Stay: \n- Big TV in living room. \n- All bedding, linen and fresh towels \n- Shampoo &amp; shower gel or soap, shower gel. \n- Unlimited high speed Wifi Internet \n- Free washer and drier usage (free laundry detergent provided) \n- In-room air-conditioning \n- Kitchen usage &amp; cooking welcome \n- Hair drier, iron, and ironing board available \n- Self-serve tea and coffee in kitchen \n- Global Universal sockets &amp; adapters \n \nWithin Condo Facilities: \n- 24 hours security \n- swimming pool &amp; Gym \n \nFor your reference: This is popular tourist area, more than 10 hotels nearby, hotel price is about SGD$300/night for 2 person only. \n \nInteraction with Guests \n \nI'm traveling most of the times. Whenever i'm free, I will be more than happy to share with u my insights of Singapore and give u my personal tips. Also I will provide tourist maps and my own introduction booklet in the living room for reference. \n \nThe Neighbourhood \n \nRoberson Quay is the most exclusive area for entertainment, hundreds of trendy bars and restaurants around this place, many historic old shop houses and high end residential, shopping malls and office around, you can find all your need within a few minutes walk. And the beautiful Singapore river is at door step, very enjoyable for a walk. \n ",
        "title": "Entire 4 Bedroom @ Robertson Quay"
    },
    {
        "postid": "5938615968",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5926526776",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis two bedroom apartment is 80 square metres (860.8 square feet) Two Bedroom apartment located on Marina Bay in Singapore.  the apartment is on the 6th floor and is served by an elevator. Two bedroom apartments are perfect for larger families, friends sharing and 2-3 business colleagues sharing. Please refer to both the bedding arrangements and photos to determine whether the property is suitable for your needs. Please note that the kitchen is fully equipped and is suitable for cooking simple meals. Room highlights are: Composition Bathroom, Kitchen, Living room, 2 x Bedroom Livingroom TV, coffee table, table and chairs, sofabed Bedroom Bed Linen &amp; Towels, double bed, desk, Chair Bedroom Bed Linen &amp; Towels, double bed Amenities Iron &amp; Ironing Board, Bed Linen &amp; Towels, Washing Machine, TV, vacuum cleaner, internet connection, heating Kitchen Cookware &amp; Kitchen Utensils, Washing Machine, electric kettle, toaster, fridge / freezer, gas/electric hob, Espresso-Machine Bathroom toilet, shower, washbasin     ",
        "title": "Elegant and Charming Two Bedroom Apartment on the 6th floor"
    },
    {
        "postid": "5937039901",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWhat make us stand up from other accommodation providers is our location,we are the only host that is locatied in a Orchard Road address,we are located on top of Centrepoint Shopping Centre right along Orchard Road. \n \nCentrepoint Shopping Centre has been around since the 1970s and is an iconic heritage shopping mall.Some guests from the UK has compared the Orchard Road to London's Oxford street, while guests of ours from the US call the location to name of Fifth Avenue, as the Japanese felt a strong resemble of Orchard road to their district of GInza area. \n \nCentrepoint Shopping Centre houses many major established retailers, Robinsons, Marks and Spencer's and Harvey Norman etc. For food lovers,there are many quality restaurants in the mall like Chinese, Japanese, Thai, Western and even Indonesian restaurants open in regular hours for business. Fast food chains in the mall includes,Mc Donald's, Subways and Long John Silver etc. \n \nCold storage is a popular supermarket that you can buy all daily groceries. Is opens 24 hrs for you to purchase any late night needs. \n \nPublic transportation is easily accessible, we are 5 minutes walk to sommerset MRT station,right at the door step of the mall is a taxi stand and the cab driver will readily to fetch you to any desire destination.     ",
        "title": "Romantic Apartment In The Centre Of Singapore"
    },
    {
        "postid": "5947587553",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOne Spacious Queen Bedroom near Raffles place is available for rent. \nVery breezy and clean unit .  \nFully furnished large rm  \nFully Furnished with air-con, dryer, washer avail. \nCooking allowed, visitors allowed \nHigh Floor \nFriendly,and easy going people. \n-Great location.Centrally located near Downtown line , Raffles Place, Suntec City, MBFC \n- Walking distance to restaurants, shops, bars and malls.  \n- Nearby bus-stops and MRT stations  \n- Nearest MRT - Raffles Place and Downtown     ",
        "title": "Raffles Place Big Common Room"
    },
    {
        "postid": "5950348315",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5952159013",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSingle Travellers looking for homestay? \n \nLook no more! This is a beautifully renovated home that's located in the prime location, heart of Singapore, makes travelling convenient and easy for travellers! \n \nIdeal location in Singapore for travellers at fraction of the price! Located near Orchard Road, Singapore Flyer, Millenia Walk, Suntec City, Marina Bay Sands, Sentosa, CBD, Chinatown, Bugis, Central Business District \n \nThere are local and international food within walking distance \nLots of shops and malls that u can buy necessities \nMRT station within 10 minutes walk \nLots of buses to town and around town \n \nRequires:  \n \nRespectful, clean and tidy person that is sharing my house with me \nNo guests allowed in the house \nStrictly no smoking indoor \nNo cooking (except boiling water and instant noodles only) \nCleanliness, peace and safety are my priorites \nNo time curfew for you to return home but please be considerably quiet if you come back really late \n \n \nRegular Room Daily Rate: $75 \n7 - 13 days: $69 (per day) \n14 - 20 days: $65 (per day) \n21 - 30 days: $60 (per day) \n31 days onwards: $55 daily \n \nSmall Room Daily Rate: $65 \n7 - 13 days: $59 (per day) \n14 - 20 days: $55 (per day) \n21 - 30 days: $50 (per day) \n31 days onwards: $45 daily \n \n \nPlease whatsapp me at +\n  show contact info \nor email me at \n  show contact info \n for more queries. Jamie \n \n**DO NOT reply here. I can't retrieve my mails via craigslist for some reasons. Thanks. \n ",
        "title": "Prime Location Beautiful Room for Homestay (Single Traveler only)"
    },
    {
        "postid": "5913372243",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nBEST DEALS &#10004;&#65038; Hotel Grand Pacific \n \nDeluxe (Breakfast included) : USD 89.66 / night \n \nBOOK NOW ! &#8659; \n \nhttps://www.agoda.com/hotel-grand-pacific/hotel/singapore-sg.html?cid=1640564 \n \n* Rates depend on the period of your stay \n* Facebook.com/wooddytangtravel     ",
        "title": "BEST DEALS &#10004;&#65038; Hotel Grand Pacific"
    },
    {
        "postid": "5911777825",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe living room comes with a comfortable sofa and 2 arm chairs. This is the perfect spot to sit back in and relax; TV, DVD, all the appliances are top notch making this a luxurious apartment. The sofa can be converted into a comfortable double bed for the 3rd and 4th guest in one easy movement. The spacious private terrace with table and chairs for 4 people plus 2 sun chairs is reachable from the living room. Orientation is south, perfect for sun hungry travellers. Even during sunny winter days this terrace is a plus as pretty much covered from the wind. \n \nThere is also a dining table inside the apartment which appears to be a desk to work on but can be easily converted and offers space for 4 guests to enjoy a meal. \n \nThe main bedroom comes with a double bed and ample wardrobe space. This bedroom also has an en-suite bathroom tastefully done in marble with bath/shower and fresh towels, soap and shampoo ready for use on arrival. \n \nKitchen: The fully equipped and modern kitchen offers everything necessary in case guests wish to prepare a meal. All appliances are top brands. At the guests disposal are an induction stove, oven, coffee maker, fridge, freezer, dish washer, washing machine, dryer, microwave, toaster, etc.     ",
        "title": "Romatic stylish one bedroom apartment in Ochard area in singapore"
    },
    {
        "postid": "5911779352",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIt is a popular for honeymooners, business and leisure travelers. Guests also can enjoy the beautiful scenery and fresh air around the Building All guest accommodations feature thoughtful amenities to ensure an unparalleled sense of comfort. \n \nSpacious apartment in 5th floor with the best layout, fully furnished, panoramic city views. This 2 bedroom with spacious kitchen with living hall and family dining equipped with LCD TV with DVD player and satellite TV connection, Wi-Fi. Master bedroom has en-suite bathroom. Kitchen is fully equipped with all cutlery and crockery and a excellent dining space. \n \nThe apartment is designed with modern living in mind with balconies and terraces. In addition, all guest accommodations feature thoughtful amenities to ensure an unparalleled sense of comfort. \n \nThe apartment outdoor pool, fitness center are ideal places to relax and unwind after a busy day. With an ideal location and facilities to match.     ",
        "title": "Two beds apt located on Cairnhill Rd!"
    },
    {
        "postid": "5931517505",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5948587019",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEnjoy your Singapore Holiday staying at this spacious 1 bedroom short stay apartment has a nice size balcony, fully fitted kitchen, en suite bathroom to good size master bedroom and walk in closet and a nice living/dining area. The unit comes with 1 parking space and offers visitor parking. \n \nAmenities include Separate gymnasium for ladies and gents, large swimming pool, Sauna, Jacuzzi, Steam roo     ",
        "title": "Spacious One Bedroom Apartmen"
    },
    {
        "postid": "5926522051",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nSpectacular 3 bedrooms and 2 bathrooms apartment for up to 7 people. Wide and bright living room with fireplace, air conditioning, plasma color TV, satellite channels, wi-fi Internet connection. Fully equipped kitchen, 2 bedrooms with double king size beds and 1 bedroom with 2 single beds that can be made up as a double bed, balcony facing an internal courtyard. Additional sofa bed for the 7th person in one of the 2 double bedrooms. The apartment has been completely renovated with high quality materials and furnishings. All the main attractions are within a 10 minutes walk.  \n \nYou'll be delighted by this wide luxurious apartment with 3 bedrooms at the price of a double bedroom of a high quality hotel in Singapore. A great opportunity to bring back home unforgettable memories of your holiday, don't miss it for any reason in the world.     ",
        "title": "Stylish and Comfortable 3 Bedrooms Apartment with Wifi and a/C"
    },
    {
        "postid": "5911775167",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe Executive Apartment comprises of 4 spacious bedroom with street views to the rear, a large private garden with private swimming, covered outdoor seating area, BBQ and a spacious lounge and dining area with separate kitchen, to host up to 8 guests including children.  There are 4 spacious bedrooms. A master bedroom with a large King Size Bed and sofa bed, complete with an en-suite bathroom a security safe and an outdoor terrace, which overlooks the garden, swimming pool&amp;. The second bedroom is a double bedroom with a large double bed overlooking the local area. The third bedroom provides two single beds which also overlook the front of the apartment. All the bedrooms are fitted with built in wardrobes for ample storage. \n \nLuxury Egyptian cotton bed linen, bath towels and toiletries are provided as standard. To the floor the open plan lounge area provides seating for up to 8 guests, and a dining area which also offers seating for 8 guests. The fully equipped kitchen is completely separate with all the modern day appliances. The  floor offers a WC and a separate study room with sofa bed, work desk and chair, which can also easily transformed into a fourth bedroom if required. \n \nThe fully equipped kitchen provides a great place to cook and prepare your own meals with the provision of all crockery and cutlery items. \n \nTo get your holiday off to a flying start. We offer a great welcome pack which includes various breakfast items. \n \nAlso included is weekly maid service as well as television with satellite channels and complimentary Wi-Fi to keep you connected during your stay. \nHouse Rules: Full details regarding key collection will be released upon successful booking     ",
        "title": "EXECUTIVE APARTMENT - 3BT/4BD+ Private Pool"
    },
    {
        "postid": "5937036058",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nYour apartment has 2 master bedroom, each with their own private bathroom. Your third room is a loft with 2 single beds. We are able to accommodate up to 8 persons with an additional sofa bed that we can provide. \n \nYou can expect a clean environment with greenery view from your apartment. \n \nKitchen comes fully equipped with washer and dryer. There are supermarket and restaurant just downstairs your apartment. \n \nIt takes only about 10-15 minute taxi ride from the airport or sentosa. You can also choose to take the public transport as the MRT station is very near your apartment. \n \nThis is very ideal for a big family up to 8. I will be looking forward to host you in Singapore. \n \nDo note, kindly keep your noises down after 10pm so that you will not disturb the neighbours.     ",
        "title": "Excellent 3 Bedrooms And 2 Bathrooms In The Heart Of Singapore"
    },
    {
        "postid": "5937044306",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nGet to the shopping belt of Singapore within minutes. Bugis Junction and Iluma are just a short walking distance away! Hop by to Bugis street to snap up all the cheap deals and try out the street food! You can find a supermarket, fast food, Starbucks and a whole range of restaurants in Bugis Junction! \n \nLocated along Liang Seah Street, where delightful treats varies, from great hawker fare to lavish cuisines, you can indulge in one of Singapore's greatest pastimes - Eating. \n \nSituated at the fringe of the city centre, the apartment provides easy access to the Central Business District and the Orchard Road shopping belt via Bus or Mass Rapid Transit (MRT) system. The nearest MRT station can be found at Bugis. \n \nA classy and cosy apartment equipped with a 1 seater sofa, flat screen television and full kitchen appliances. This unit is truly a place to live in.     ",
        "title": "Amazing Apartment In The Best Location In Singapore"
    },
    {
        "postid": "5940754274",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRoom highlights are: \nBedroom \nBed Linen &amp; Towels, double bed, built-in wardrobes, 2 x night tables, 2 x reading lamps \n \nBathroom \nHair Dryer, cupboard, toilet, bathtub, Towels, mirror \n \nComposition \nBathroom/WC, Bathroom, Kitchen, Living room, Bedroom \n \nAmenities \nCookware &amp; Kitchen Utensils, Iron &amp; Ironing Board, Hair Dryer, Bed Linen &amp; Towels, Central Heating, Washing Machine, TV, internet connection, air conditioning \n \nKitchen \nCookware &amp; Kitchen Utensils, Crockery &amp; Cutlery, Iron &amp; Ironing Board, Washing Machine, kettle, cooking hob, oven, electric kettle, microwave, toaster, fridge / freezer, coffee maker \n \nBedroom/LivingRoom \nTV, double sofa bed, bookshelf, Table, 2 x Chair     ",
        "title": "1 BEDROOM, INTEGRATED KITCHEN/DINING/LIVING ROOM, BATHROOM"
    },
    {
        "postid": "5911973874",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n&#9642; York Hotel \n \n&#9642; From USD 145 / Night \n \n&#9642; Please go to the link below for more details and reservation \n \nhttp://www.agoda.com/york-hotel/hotel/singapore-sg.html?cid=1640564 \n \n** Remarks \n- Room rates are subject to change without prior notice \n- Rates depend on the period of your stay \n \n------------------------------------------------------------------------------------------------------------------------ \n \nWOODDY TANG TRAVEL  : travel / lifestyle / food / hotels / airlines / reviews / deals / affiliate \n \nfacebook.com/wooddytangtravel \n ",
        "title": "York Hotel *--*"
    },
    {
        "postid": "5926526478",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMassive, luxurious, 1600 sqf(160 mp) fully-furnished 2 bedroom apartment on orchard road. Minutes from everything you need to enjoy the best Singapore has to offer. 2 giant terraces for outdoor parties(2200 sqf/220 mp), and much more... \n \nThe Space \n \n- luxury apartment in a new building \n \n- huge living room + 2 bedrooms + 2.5 baths \n \n- sleeps up to 6 people \n \n- high-end 'white concept' furnishings \n \n- 2 massive furnished terraces (50 square meters + 100 square meters with sun-roof) \n \n- open views to the park \n \nGuest Access \n \n- apartment includes free wifi, cable, all utilities \n \n- ready-to-use kitchen ware, bedding, towels, baby crib \n \n- private cook / maid / nanny (SGD 50/day) by request \n ",
        "title": "Luxury Two Bedroom Apartment Located In the Very Center Of Singapore"
    },
    {
        "postid": "5954815854",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nhis villa consist of three floors and has 6 bedrooms! It has a beautiful garden and yard! \n \nSuitable for large group! \n \nI am renting this villa as a whole unit, no room rental. \nAll rooms has aircon. \n \nCooking is allowed in the house. However, strictly NO EVENT is allowed. \n \nCentral, and Near to malls and train station. \n \nNovena train station is just 7 minutes away! \n \nPlease contact me once you landed in Singapore. If there is any delay of flight, please notify me in advance. \nHouse Rules: Please remove your shoes when entering the apartment, so that you can enjoy a clean home during your whole stay! ;) \n \nSmoking is not allowed in the apartment, but you can always do that at the balcony! ;) \n \nPlease switch off all the lights and aircon when you are not in the room, so they can function properly when you need them! \n ",
        "title": "Superb 3 Floor Villa for Large Group"
    },
    {
        "postid": "5940692078",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a very big 1 bedroom condominium as you can see from the photo. Nested in a very premium condo, the pool is definitely the selling point of the apartment. Great for sun tanning and lazing around. Fits 2 comfortably and if you have 1 child, we can provide extra mattress. \n \nThis is 1 bedroom apartment. The facilities and amenities in this apartment is brand new. \n \nThe is 1 bedroom room apartment. One queen size bed only. Will provide single mattress for extra person. For the ladies, there is also a large walk-in closet. \n \nIt is fully furnished and comes with basic cooking appliances to you to cook up a simple meal. \n \nLocated just 6min walk from Paya Lebar MRT, you are well connected as it is just 5 stops away to to downtown Singapore. \n \nDespite the Geylang address, known for its red light district (and yummy food), the vice is actually a good 25min walk away - VERY VERY far. The area that you are in is a decant residential neighborhood where family live. Not hookers. \n \nWIFI is provided in the apartment. \n \nI am renting out the entire 1 bedroom apartment so you need not to share with anyone. All the furnishing and equipment are in good working order. \n \nSomeone will meet you during check-in to do the handover. During your stay, should there be any issue with the apartment, we will try our very best to resolve it. \n \nI would be happy to recommend places to eat, shop, drink and play.Local food is the major plus for resident in Geylang. You will be never short of good and cheap local food. There is way too many to recommend and I suggest that you food blog the places to eat. \n \nResidents can get to nearby supermarkets or shopping mall within the area for an array of amenities such as grocery and retail shopping, banks, eateries and more. \n \nThis apartment is near to Geylang East. It is also close to City Plaza and Tanjong Katong Complex. \n \nPaya Lebar is a major train interchange where you can take either the green line (East-West) or the Circle Line (Marina Bay or Harbourfront). It is seriously very convenient. \n \nFrom the airport, it is 15min by cab \n \nIf you take a taxi to town area, it is also 15-20min. \n \nWe do provide: \n \n- a fresh set of bed sheet, pillow cover and blanket. \n \n- bath towels (1 per pax) \n \nWe do not provide: \n \n- Bathroom amenities (soap/shampoo) \n \n- Clothing washing detergent.     ",
        "title": "This is a very big 1 bedroom condominium"
    },
    {
        "postid": "5948203767",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nEntire cozy 4 bedroom flat about 1600 spf, at most popular expat spot &amp; central scenic area, short walk to Clark quay, Roberson quay, Chinatown,Financial center, Orchard road. Nice bars &amp; restaurants &amp; SG river at door step. Great for sight seeing. Walking distance to most famous spots in town. Save ur time and sweat for transportation. Fast WIFI. \n \nEntire spacious 4 bedroom with 3 bathrooms, about 160 square meters, cozy apartment at Robertson Quay, the most popular dinning area in CBD center, beside river. plenty of bars &amp; restaurants down starts and many boutique shop houses which are great attraction for tourist. Gym, huge swimming pool and tennis court available for your use. \n \nVery spacious living room and kitchen, Each room is well furnished with writing table, sofa and big wardrobe for your personal belongings. We provide comfortable bedding and peaceful surrounding to ensure that you feel like home. \n \nMost central in CBD, surrounded by many high end condos, shopping malls, office buildings and beautiful boutique shop houses. Walking distance to Clark Quay, Boat Quay, Chinatown, Orchard. If u don't mind walking, it's a very enjoyable walk along river to Raffles Place and Marina Bay Sands as well. The best place to experience the trendy metropolitan life in Singapore. \n \nGuest Access \n \nIncluded With Your Stay: \n- Big TV in living room. \n- All bedding, linen and fresh towels \n- Shampoo &amp; shower gel or soap, shower gel. \n- Unlimited high speed Wifi Internet \n- Free washer and drier usage (free laundry detergent provided) \n- In-room air-conditioning \n- Kitchen usage &amp; cooking welcome \n- Hair drier, iron, and ironing board available \n- Self-serve tea and coffee in kitchen \n- Global Universal sockets &amp; adapters \n \nWithin Condo Facilities: \n- 24 hours security \n- swimming pool &amp; Gym \n \nFor your reference: This is popular tourist area, more than 10 hotels nearby, hotel price is about SGD$300/night for 2 person only. \n \nInteraction with Guests \n \nI'm traveling most of the times. Whenever i'm free, I will be more than happy to share with u my insights of Singapore and give u my personal tips. Also I will provide tourist maps and my own introduction booklet in the living room for reference. \n \nThe Neighbourhood \n \nRoberson Quay is the most exclusive area for entertainment, hundreds of trendy bars and restaurants around this place, many historic old shop houses and high end residential, shopping malls and office around, you can find all your need within a few minutes walk. And the beautiful Singapore river is at door step, very enjoyable for a walk. \n \n-Nearest MRT station is Clark Quay, about 8-10 minutes walk along beautiful Singapore river. \n \n- 3 bus stops around this condo area. U can search by: gothere doc sg for detail transport guidance. \n- Shopping mall, banks, bars and restaurants, whatever u need can be found downstairs or within 2-5 minutes walk. \n ",
        "title": "Entire 4 Bedroom @ Robertson Quay"
    },
    {
        "postid": "5932147670",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n- Fully furnished entire condo unit for rent.  \n- 1 bed room with separate living room, kitchen, store room.  \n- Complete privacy no sharing with others.  \n- 5 minutes walk to Lavender and Farrer Park MRT stations.  \n- 3 minutes walk to City Square Mall.  \n- Full condo facilities. \n- Free Wi-Fi \n \nEmail: \n  show contact info \n&#65307; Mobile: 8.1.8.1-zero.six.faiv.eight     ",
        "title": "Cozy Condo unit near Farrer Park MRT"
    },
    {
        "postid": "5940696582",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe living room comes with a comfortable sofa and 2 arm chairs. This is the perfect spot to sit back in and relax; TV, DVD, all the appliances are top notch making this a luxurious apartment. The sofa can be converted into a comfortable double bed for the 3rd and 4th guest in one easy movement. The spacious private terrace with table and chairs for 4 people plus 2 sun chairs is reachable from the living room. Orientation is south, perfect for sun hungry travellers. Even during sunny winter days this terrace is a plus as pretty much covered from the wind. \n \nThere is also a dining table inside the apartment which appears to be a desk to work on but can be easily converted and offers space for 4 guests to enjoy a meal. \n \nThe main bedroom comes with a double bed and ample wardrobe space. This bedroom also has an en-suite bathroom tastefully done in marble with bath/shower and fresh towels, soap and shampoo ready for use on arrival. \n \nKitchen: The fully equipped and modern kitchen offers everything necessary in case guests wish to prepare a meal. All appliances are top brands. At the guests disposal are an induction stove, oven, coffee maker, fridge, freezer, dish washer, washing machine, dryer, microwave, toaster, etc.     ",
        "title": "Romatic stylish one bedroom apartment in Ochard area in singapore"
    },
    {
        "postid": "5926524150",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThe apartment is located at the second floor with elevator of an elegant and quiet building. When you enter you got a large living room with a comfortable double sofabed, three double bedrooms, one of them with a second single bed, two bathrooms, one with shower and a second with shower tub, a fully equipped kitchen with a table able to accommodate up to 9 guests when opened. The apartment is really easy to live, the 3 bedrooms are completely independent, and the two bathrooms are not en-suite. \n \nThe apartment comes with independent heating, air conditioned and wifi internet access. \n \nPlease do get back to me with information below: \n \nCheck in date: \nCheck out date: \nEmail address: \nContact number: \n \nPrice is 150 USD per night!!!     ",
        "title": "Luxury &amp; Charming 3bdrs 2bths in the Heart of Singapore"
    },
    {
        "postid": "5912060472",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nDorsett Singapore : from SGD 180 / night \n \nPlease go to the link below for more details and booking \n \nhttps://www.facebook.com/wttraveller/posts/1127286260646318 \n \n----------------------------------------------- \n** Remarks \n1. Room rates are subject to change without prior notice \n2. Rates depend on the period of your stay \n----------------------------------------------- \n \n--------------------------------------------- \n \nEnquiry : Please send your message to \n \nfacebook.com/wttraveller \n \nFACEBOOK MESSENGER : @wttraveller \n \nLINE ID : wttraveller \n \nWECHAT : wttraveller \n \n show contact info \n ",
        "title": "Dorsett Singapore : Hot Deals !!!!"
    },
    {
        "postid": "5941794791",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n4 Bedrooms Unit Queen Room for Rent  \nFully Furnished Queen bedroom for at The Sail @ marina bay For Rent \nNear Raffles Place and Downtown MRT \n- Ideal for working professional  \n- Unit comes with living area, bedroom, bathroom &amp; kitchen \n- Fully furnished (Bed, Dining, Washer/Dryer, Frig) \n- Queen Bed for $1,800 \n- Full Condo facilities \n- Excellent location near Downtown line  \n- 10 mins MRT to Orchard &amp; Clark Quay     ",
        "title": "Full Furnished Queen Bedroom"
    },
    {
        "postid": "5937049944",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nhis 4 Bedrooms Apartment is simple and modern. Great for 7 to 10 people. Ideal for families or guests seeking for 100% Privacy. \n \nOur accommodations are less than a 2 minute stroll with many amenities nearby, such as Orchard MRT Station, Takashimaya, Paragon, Wisma Atria &amp; many more. \n \nLocated strategically along the Orchard Road main shopping belt. We provide on the lowest rates in town, at least 70% cheaper than the 4&amp;5 star hotels located at Orchard Road. \n \nWe are strategically located amongst many facilities like shopping places, eateries &amp; restaurants, 24hr convenience stores, banks &amp; money-changers, medical centres &amp; hospitals, etc. \n \nWe desire to remain as affordable as possible to all our friends out there and we look forward to seeing you in the near future.     ",
        "title": "Perfect Location In The Heart Of Singapore"
    },
    {
        "postid": "5950358442",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5940695490",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nRoom highlights are: \nBedroom \nBed Linen &amp; Towels, double bed, built-in wardrobes, 2 x night tables, 2 x reading lamps \n \nBathroom \nHair Dryer, cupboard, toilet, bathtub, Towels, mirror \n \nComposition \nBathroom/WC, Bathroom, Kitchen, Living room, Bedroom \n \nAmenities \nCookware &amp; Kitchen Utensils, Iron &amp; Ironing Board, Hair Dryer, Bed Linen &amp; Towels, Central Heating, Washing Machine, TV, internet connection, air conditioning \n \nKitchen \nCookware &amp; Kitchen Utensils, Crockery &amp; Cutlery, Iron &amp; Ironing Board, Washing Machine, kettle, cooking hob, oven, electric kettle, microwave, toaster, fridge / freezer, coffee maker \n \nBedroom/LivingRoom \nTV, double sofa bed, bookshelf, Table, 2 x Chair     ",
        "title": "1 BEDROOM, INTEGRATED KITCHEN/DINING/LIVING ROOM, BATHROOM"
    },
    {
        "postid": "5954739237",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nCarlton City Hotel Singapore \n \nSGD 217 / Night \n \nMore details + Booking below \n \nhttps://wttravellerdeals.wordpress.com/2017/01/11/carlton-city-hotel-singapore-from-sgd-217/ \n \nEnquiry &gt; Facebook.com/wttraveller     ",
        "title": "Carlton City Hotel Singapore"
    },
    {
        "postid": "5911774656",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWhat make us stand up from other accommodation providers is our location,we are the only host that is located in a Orchard Road address,we are located on top of Centrepoint Shopping Centre right along Orchard Road. \n \nCentrepoint Shopping Centre has been around since the 1970s and is an iconic heritage shopping mall.Some guests from the UK has compared the Orchard Road to London's Oxford street, while guests of ours from the US call the location to name of Fifth Avenue, as the Japanese felt a strong resemble of Orchard road to their district of GInza area. \n \nCentrepoint Shopping Centre houses many major established retailers, Robinsons, Marks and Spencer's and Harvey Norman etc. For food lovers,there are many quality restaurants in the mall like Chinese, Japanese, Thai, Western and even Indonesian restaurants open in regular hours for business. Fast food chains in the mall includes,Mc Donald's, Subways and Long John Silver etc. \n \nCold storage is a popular supermarket that you can buy all daily groceries. 7/11 is opens 24 hrs for you to purchase any late night needs. \n \nPublic transportation is easily accessible, we are 5 minutes walk to sommerset MRT station,right at the door step of the mall is a taxi stand and the cab driver will readily to fetch you to any desire destination. \n \nThis is 3 bedrooms apartment with a living room well furnished with a television, sofa and is attached to the kitchenette. \n \nLIVING ROOM \n \n* Plush furnishing and fittings. \n \n* Individually controlled ari-con. \n \n* Flat screen Television with local channels \n \nSERVICES \n \n* Housekeeping Cleaning Services. \n \nFACILITIES \n \n* Swimming pool. \n \n* 24 hour security surveillance. \n \n* Internet Capablities. \n \nThanks for taking time to read our introduction and hope to see you in Singapore soon. \n \nHouse Rules: This is your home and enjoy yourself to the fullest with this superb location.     ",
        "title": "Orchard Road 3 Bedrooms with free airport pick up + drop off"
    },
    {
        "postid": "5906223805",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis apartment is located right at the heart of Singapore, 3 minutes walk to Tanjong Pagar MRT, financial area, historical reservations, tourists attractions and China Town is in the walking distance. Life is super convenient, shopping, food courts, restaurants, pubs and supermarkets are within 3-5 minutes walk. \n \nThis apartment is 1173 sqf, 2 storeys, 2 bedrooms, 2 bathrooms, regular layout, comfortably fit for 4 persons or more, a king-sized bed upstairs in the master room, a super single and a pull out single bed in the downstairs common room. Furnished kitchen. Can add mattress in the upstairs master room and living room. It is furnished as the service apartment. Just bring your luggage. \n \nMaster room can put one more mattress for kid to stay. \n \nGuests will have access to the 50 meter swimming pool, aqua aerobics pools, refexology water jests,gym, Jacuzzis, sauna, Tennis courts, BBQ pits. WIFI, cable TV, a full kitchen inside the apartment. \n \nI am in Singapore most of the time. Can help the guests while they are in Singapore. I do the check in and check out, keep contact with guests. \n \nThis neighbourhood is one of the oldest in Singapore, very dynamic still. On one part, you will see the old and traditional Singapore neighbourhood: new and old HDB flats, historically conserved shop houses, Chinese and Indian temples; on the other part, you see modern Singapore, sky scrapers in the financial areas, luxury hotels. You will experience Singapore's short history. Life is also extremely convenient: shopping, three supermarkets, banks, post office, food courts, restaurants, pubs are all within 3-5 minutes walk. \n \nThe Tanjong Pagar MRT is only 3 minutes walk, easy to get a taxi also. From the airport, you can take a cab about 17 minutes, about S$20. If you only have a hand luggage, you can take a train directly to Tanjong Pagar, about 30 min.     ",
        "title": "Spacious Apartment in the heart of Singapore"
    },
    {
        "postid": "5955781003",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA private 2 bedrooms with 1 study room apartment 5 minutes walk from Novena MRT. The apartment comes with 2 bedrooms, 2 bathrooms, a study room, a kitchen and a living room. There are 1 queen-sized bed, 1 super single sized bed and 2 sofa beds. \n \nWater kettle, oven, toaster, hair dryer and washer cum dryer are available in this unit. This apartment is also located on a high floor where you can get a bird-eye view of the city-scape. \n \nThe apartment is located in Novena, which is a great place to be if you want to be close to city centre. It is also a popular choice for medical tourist because it is not more than 15 min away from many hospitals and medical centres, like Thomson Medical Centre, Glen Eagles, Mount Elizabeth Hospital etc. The apartment is a 3 minutes walk to the Novena MRT, And shopping malls like Velocity, United Square, Novena Square. \nThe following landmarks can be accessed in under 20 minutes on MRT: \n ",
        "title": "2 Bedder @ Novena/Newton"
    },
    {
        "postid": "5938582287",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5938603008",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    },
    {
        "postid": "5937049901",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a perfect choice venue for singles or small families who are working in the central business district. Strategically located in the fringe of the Marina Bay Financial Centre. \n \nThe apartment 1 bedroom and 1 living room interior, with a self sufficient kitchenette that enables you to prepare your own meals. The interior is fitted warmly with quality furnitures, wifi and cable channels available on the television. \n \nWith full security access, it will ensure that you can stay in Singapore with a peace of mind.     ",
        "title": "Best Location To Explore Singapore"
    },
    {
        "postid": "5938388742",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nMARINA MANDARIN SINGAPORE HOTEL \n \nFrom SGD 264 / night \n \nBOOK NOW , please go to the link below for more details and booking \n \nhttp://wttraveller.blogspot.com/2016/12/marina-mandarin-singapore-hotel.html \n \n* Rates depend on the period of your stay \n* Kindly contact #wttraveller for any enquiry \n* Facebook.com/wttraveller  \n ",
        "title": "MARINA MANDARIN SINGAPORE HOTEL"
    },
    {
        "postid": "5926479075",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \n*(REASONABLE PRICE FOR VAN SERVICE) \n \n&#9733;&#9733;(QUOTATION THRU SMS ONLY)&#9733;&#9733; \n \nFor enquiries pls SMS your: (1) Detail of items. (2) Both address with post code. \n(3) Are both add,at lift level? (4) Date &amp; time. \n \nSERVICE: (1) Transport without labour. (2) Transport with driver assist. (3) Transport with driver and labour assist. \n \nHAVING DIFFICULTY IN GETTING CHEAPEST CHARGE? I CAN PROVIDE YOU A COVERED TOYOTA HIACE VAN, FROM $40 ONWARDS.SMS ME (ALIF) AT MY MOBILE (84005231),FOR FURTHER INQUIRY. \n \n&#9733;&#9733;(Your BUDGET is always my PRIORITY)&#9733;&#9733; \n \n[[ SERVICES THAT I PROVIDE ]] \n \n&#9733; MINOR ROOM SHIFTING.   \n \n&#9733; DISPOSAL SERVICE. \n \n&#9733; TRANSPORT ITEM FROM IKEA. \n \n&#9733; TRIP TO CHANGI AIRPORT. \n \n&#9733; EVENT AND EXHIBITIONS: (EG: KARAOKE ENTERTAINMENT, CATERING) \n \nLAST BUT NOT LEAST,ANYTHING THAT NEEDS TO TRANSPORT USING VAN, IM HERE SINCERELY WAITING FOR YOUR CALL. SAVE MY NUMBERS, AS IT WILL BE USEFUL FOR YOUR FUTURE NEEDS.  \n \n&#9733;&#9733;(Your SATISFACTION is my GAIN)&#9733;&#9733;     ",
        "title": "MOVER SVCS,ALIF 84005231.mattress,washer,chair,table,oven,fan."
    },
    {
        "postid": "5937039876",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThis is a 2 bedrooms serviced apartment in the East side of Singapore, apartment for only 2 to 8 people. Ideal for a large family who want somewhere self-sufficient to stay in after long hours at work, or a couple on holiday on our sunny island. \n \nThe apartment is furnished with a queen-size bed, bed linen are provided which includes: mattress protector, bed \n \nsheets, blanket with duvet cover, pillow and pillow case. There is an open closet area with an Iron and ironing board. \n \nBroadband internet access via WIFI. \n \nThe room also has air conditioning with individual temperature control.     ",
        "title": "Fantastic Apartment In The Heart Of Singapore"
    },
    {
        "postid": "5906218278",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOVERVIEW \n \nSingle Storey Skyvilla Penthouse Overlooking the Central Business District &amp; Sentosa Waterfront precinct. Located just minutes away from a host of shopping, dining, entertainment options &amp; 2 MRT lines. \n \nABOUT \n \nLuxurious and modern apartment along the Waterfront Promenade with fully equipped kitchen, huge dining area, common living and entertainment area, outdoor patio, and four bedrooms. It is tastefully furnished and boasts of floor to ceiling windows overlooking the Central Business District &amp; Sentosa Waterfront Precinct.     ",
        "title": "Beautiful penthouse overlooking Sentosa Island"
    },
    {
        "postid": "5937049994",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nThree Bedrooms Apartment with king sized beds. There are 2 bathrooms; one ensuite and one common. There is also a washer, dryer and a 40\" TV within the apartment. \n \nThere is a kitchen, mirowave oven, cooking stove, pots, pans, cutlery to whip up a nice meal. \n \nThe apartment is extremely conveniently located. Harbourfront MRT is just across the road (5 mins walk) \n \nA large shopping mall - Vivo City - is just at harbourfront mrt. \n \nVivo City has many restaurants, a large supermarket and amenities. You can easily get to Sentosa by taking a monorail from Harbourfront. Walking to Sentosa is also possible - 5-7mins. Raffles Place - by cab 7 mins. Orchard Road - 10mins. Airport - 15-20mins - depending on traffic. \n \nWifi is included in the apartment.     ",
        "title": "Charming, Quiet, Beautiful With All Actvities In Singapore"
    },
    {
        "postid": "5938538081",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nA beautiful and spacious apartment equipped with the following room amenities : \n \n-Designer bed frames with Queen Size Mattress and quality linens \n \n-Designer dining table with beautiful chairs \n \n-Kitchen with Fully cooking utensils , Rice cooker, Stove \n \n-Refrigerator and Freezer \n \n-Comprehensive Cooking Utensils &amp; Cutlery \n \n-Hair Dryer \n \n-Iron and Ironing Board \n \n-Washing Machine cum Dryer \n \n-Air-Conditioning with Individual Controller \n \nGuest Access \n \nHOUSEKEEPING \n \nWe provide complimentary housekeeping once a week. We emphasis a high standard of housekeeping services which all our customers talk about. \n \nLAUNDRY \n \nPersonal Laundry wash and iron are unlimited as long as you stay. \n \nBROADBAND and WI-FI \n \nWireless High speed internet provided \n \nCAR PARK     ",
        "title": "Redwood Apartment near Farrer Park"
    }
]