[
    {
        "postid": "5944641430",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nHello, I'm Steven from Nubela Co, and SilvrBullet is the sales automation product under our company. SilvrBullet takes the menial processes of prospecting corporate sales leads and automated it. \n \nIn Jan 2017, we are seeking a big data intern to help to train with train our machine learning. Don't worry,  it is not hard. All you have to do is to surf the web. \n \n \n \n#### Responsibilities \n \nThe job scope is simple and fun. As our Big Data intern \n \n1. To browse the web \n2. And identify the category of the website  \n \nThat's it! By doing so, you will be helping to train our machine-learning model so we can predict categories algorithmically. Super cool. \n \n \n \n#### Benefits \n \nWe will pay $800/- for 2 weeks of work. \n \nWe also work inside a condo apartment so coming to work is a breeze given that it's just beside the MRT station. And you can go to the gym or swim anytime you want. \n \nInterested? Send an email with a resumé to \n  show contact info \n ",
        "title": "Big Data Intern with SilvrBullet ($800/2weeks)"
    },
    {
        "postid": "5913064348",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nOpportunity to earn an extra couple of hundred USD weekly \nAll is required is a smartphone with data connection everyday for 30minutes \n&#10006; physical stock \n&#10060; qualification \n&#10006; hard selling \n&#10060; presentation  \nText me for more information today! \n ",
        "title": "Freelance work"
    },
    {
        "postid": "5898800440",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nWe are an IT outsourcing company localed in Sri Lanka,and we have a history of more than ten years. We hope to find local IT professionals to recommend reliable sources of projects to us, and we are responsible for the development. You can get a generous commission. We use the online systems to do the projects management, and you can check the progress of the projects at any time and anywhere, so as to obtain a commission. Looking forward to your application.     ",
        "title": "IT outsourcing project seekers recruited"
    },
    {
        "postid": "5920046872",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nLooking for website designer whom like to spend less time doing the tedious technical work of creating website from scratch for demanding customers. \nAnd current digital sales &amp; marketing personnel whom will like to see your own efforts grown into long term livelihood that you and your family can enjoy. \n \nOnly motivated individuals with positive attitude and a dream to succeed need to connect.  Start part time and leverage your way to financial freedom for your family. \n \nFind out more by sending your profile and current work experience.     ",
        "title": "Part Time Website Sales"
    },
    {
        "postid": "5921412170",
        "postingbody": " \n \n QR Code Link to This Post \n  \n \nIf you: \n \n- are passionate about doing social good in a big way \n \n- are a UI/UX guru \n \n- like to enjoy the benefit of working from anywhere, at your pace while still holding onto your personal time and space for work for income \n \n- either like to get back into the startup scene again or curious to get involved in a startup without losing too much in terms of giving up work and loss of income \n \n- preferably was involved in a startup in some ways \n \nget in touch! \n \nWe are a small team with big dreams of disrupting the mental health space in a big way. It is our way of starting a simple project to align our working methods, see if we can pull off something within a reasonable timeline, without the stress of VC or angel funds, so we can grow organically. It will be fun and there is an idea pipeline so if the working styles complement, there is a possibility of taking on other projects on different scales. The existing team comprises of folks who have been involved in startups before.  \n \nThere is no requirement to go full time (yet) but passion is the #1 criteria.  \n \n#teambeforeproduct     ",
        "title": "Seeking passionate UI/UX Designer"
    }
]